fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#ifndef __STC32G144K246_DEF_H__
#define __STC32G144K246_DEF_H__

/////////////////////////////////////////////////

#include "stc32g144k246.h"
#include "def.h"

/////////////////////////////////////////////////

#define PORT_SetInitLevelLow(p, b)      CLR_REG_BIT(P##p, (b))
#define PORT_SetInitLevelHigh(p, b)     SET_REG_BIT(P##p, (b))

#define PORT_SetInitLevelLowX(p, b)     CLR_REG_BIT(P##p##OUT, (b))
#define PORT_SetInitLevelHighX(p, b)    SET_REG_BIT(P##p##OUT, (b))

#define PORT_SetQuasiMode(p, b)         CLR_REG_BIT(P##p##M0, (b)); \
                                        CLR_REG_BIT(P##p##M1, (b))

#define PORT_SetPushPullMode(p, b)      SET_REG_BIT(P##p##M0, (b)); \
                                        CLR_REG_BIT(P##p##M1, (b))

#define PORT_SetHighZInputMode(p, b)    CLR_REG_BIT(P##p##M0, (b)); \
                                        SET_REG_BIT(P##p##M1, (b))

#define PORT_SetOpenDrainMode(p, b)     SET_REG_BIT(P##p##M0, (b)); \
                                        SET_REG_BIT(P##p##M1, (b))

#define PORT_SetAutoMode(p, b)          CLR_REG_BIT(P##p##BP, (b))
#define PORT_SetManualMode(p, b)        SET_REG_BIT(P##p##BP, (b))

#define PORT_EnablePullUp(p, b)         SET_REG_BIT(P##p##PU, (b))
#define PORT_DisablePullUp(p, b)        CLR_REG_BIT(P##p##PU, (b))

#define PORT_EnablePullDown(p, b)       SET_REG_BIT(P##p##PD, (b))
#define PORT_DisablePullDown(p, b)      CLR_REG_BIT(P##p##PD, (b))

#define PORT_EnableSchmitt(p, b)        CLR_REG_BIT(P##p##NCS, (b))
#define PORT_DisableSchmitt(p, b)       SET_REG_BIT(P##p##NCS, (b))

#define PORT_SetSlewRateFast(p, b)      CLR_REG_BIT(P##p##SR, (b))
#define PORT_SetSlewRateNormal(p, b)    SET_REG_BIT(P##p##SR, (b))

#define PORT_SetDrivingStrong(p, b)     CLR_REG_BIT(P##p##DR, (b))
#define PORT_SetDrivingNormal(p, b)     SET_REG_BIT(P##p##DR, (b))

#define PORT_SetAnalogInput(p, b)       CLR_REG_BIT(P##p##IE, (b))
#define PORT_SetDigitalInput(p, b)      SET_REG_BIT(P##p##IE, (b))

#define SetP0nInitLevelLow(b)           PORT_SetInitLevelLow(0, (b))
#define SetP1nInitLevelLow(b)           PORT_SetInitLevelLow(1, (b))
#define SetP2nInitLevelLow(b)           PORT_SetInitLevelLow(2, (b))
#define SetP3nInitLevelLow(b)           PORT_SetInitLevelLow(3, (b))
#define SetP4nInitLevelLow(b)           PORT_SetInitLevelLow(4, (b))
#define SetP5nInitLevelLow(b)           PORT_SetInitLevelLow(5, (b))
#define SetP6nInitLevelLow(b)           PORT_SetInitLevelLow(6, (b))
#define SetP7nInitLevelLow(b)           PORT_SetInitLevelLow(7, (b))
#define SetP8nInitLevelLow(b)           PORT_SetInitLevelLowX(8, (b))
#define SetP9nInitLevelLow(b)           PORT_SetInitLevelLowX(9, (b))
#define SetPAnInitLevelLow(b)           PORT_SetInitLevelLowX(A, (b))
#define SetPBnInitLevelLow(b)           PORT_SetInitLevelLowX(B, (b))

#define SetP0nInitLevelHigh(b)          PORT_SetInitLevelHigh(0, (b))
#define SetP1nInitLevelHigh(b)          PORT_SetInitLevelHigh(1, (b))
#define SetP2nInitLevelHigh(b)          PORT_SetInitLevelHigh(2, (b))
#define SetP3nInitLevelHigh(b)          PORT_SetInitLevelHigh(3, (b))
#define SetP4nInitLevelHigh(b)          PORT_SetInitLevelHigh(4, (b))
#define SetP5nInitLevelHigh(b)          PORT_SetInitLevelHigh(5, (b))
#define SetP6nInitLevelHigh(b)          PORT_SetInitLevelHigh(6, (b))
#define SetP7nInitLevelHigh(b)          PORT_SetInitLevelHigh(7, (b))
#define SetP8nInitLevelHigh(b)          PORT_SetInitLevelHighX(8, (b))
#define SetP9nInitLevelHigh(b)          PORT_SetInitLevelHighX(9, (b))
#define SetPAnInitLevelHigh(b)          PORT_SetInitLevelHighX(A, (b))
#define SetPBnInitLevelHigh(b)          PORT_SetInitLevelHighX(B, (b))

#define SetP0nQuasiMode(b)              PORT_SetQuasiMode(0, (b))
#define SetP1nQuasiMode(b)              PORT_SetQuasiMode(1, (b))
#define SetP2nQuasiMode(b)              PORT_SetQuasiMode(2, (b))
#define SetP3nQuasiMode(b)              PORT_SetQuasiMode(3, (b))
#define SetP4nQuasiMode(b)              PORT_SetQuasiMode(4, (b))
#define SetP5nQuasiMode(b)              PORT_SetQuasiMode(5, (b))
#define SetP6nQuasiMode(b)              PORT_SetQuasiMode(6, (b))
#define SetP7nQuasiMode(b)              PORT_SetQuasiMode(7, (b))
#define SetP8nQuasiMode(b)              PORT_SetQuasiMode(8, (b))
#define SetP9nQuasiMode(b)              PORT_SetQuasiMode(9, (b))
#define SetPAnQuasiMode(b)              PORT_SetQuasiMode(A, (b))
#define SetPBnQuasiMode(b)              PORT_SetQuasiMode(B, (b))

#define SetP0nPushPullMode(b)           PORT_SetPushPullMode(0, (b))
#define SetP1nPushPullMode(b)           PORT_SetPushPullMode(1, (b))
#define SetP2nPushPullMode(b)           PORT_SetPushPullMode(2, (b))
#define SetP3nPushPullMode(b)           PORT_SetPushPullMode(3, (b))
#define SetP4nPushPullMode(b)           PORT_SetPushPullMode(4, (b))
#define SetP5nPushPullMode(b)           PORT_SetPushPullMode(5, (b))
#define SetP6nPushPullMode(b)           PORT_SetPushPullMode(6, (b))
#define SetP7nPushPullMode(b)           PORT_SetPushPullMode(7, (b))
#define SetP8nPushPullMode(b)           PORT_SetPushPullMode(8, (b))
#define SetP9nPushPullMode(b)           PORT_SetPushPullMode(9, (b))
#define SetPAnPushPullMode(b)           PORT_SetPushPullMode(A, (b))
#define SetPBnPushPullMode(b)           PORT_SetPushPullMode(B, (b))

#define SetP0nHighZInputMode(b)         PORT_SetHighZInputMode(0, (b))
#define SetP1nHighZInputMode(b)         PORT_SetHighZInputMode(1, (b))
#define SetP2nHighZInputMode(b)         PORT_SetHighZInputMode(2, (b))
#define SetP3nHighZInputMode(b)         PORT_SetHighZInputMode(3, (b))
#define SetP4nHighZInputMode(b)         PORT_SetHighZInputMode(4, (b))
#define SetP5nHighZInputMode(b)         PORT_SetHighZInputMode(5, (b))
#define SetP6nHighZInputMode(b)         PORT_SetHighZInputMode(6, (b))
#define SetP7nHighZInputMode(b)         PORT_SetHighZInputMode(7, (b))
#define SetP8nHighZInputMode(b)         PORT_SetHighZInputMode(8, (b))
#define SetP9nHighZInputMode(b)         PORT_SetHighZInputMode(9, (b))
#define SetPAnHighZInputMode(b)         PORT_SetHighZInputMode(A, (b))
#define SetPBnHighZInputMode(b)         PORT_SetHighZInputMode(B, (b))

#define SetP0nOpenDrainMode(b)          PORT_SetOpenDrainMode(0, (b))
#define SetP1nOpenDrainMode(b)          PORT_SetOpenDrainMode(1, (b))
#define SetP2nOpenDrainMode(b)          PORT_SetOpenDrainMode(2, (b))
#define SetP3nOpenDrainMode(b)          PORT_SetOpenDrainMode(3, (b))
#define SetP4nOpenDrainMode(b)          PORT_SetOpenDrainMode(4, (b))
#define SetP5nOpenDrainMode(b)          PORT_SetOpenDrainMode(5, (b))
#define SetP6nOpenDrainMode(b)          PORT_SetOpenDrainMode(6, (b))
#define SetP7nOpenDrainMode(b)          PORT_SetOpenDrainMode(7, (b))
#define SetP8nOpenDrainMode(b)          PORT_SetOpenDrainMode(8, (b))
#define SetP9nOpenDrainMode(b)          PORT_SetOpenDrainMode(9, (b))
#define SetPAnOpenDrainMode(b)          PORT_SetOpenDrainMode(A, (b))
#define SetPBnOpenDrainMode(b)          PORT_SetOpenDrainMode(B, (b))

#define SetP0nAutoMode(b)               PORT_SetAutoMode(0, (b))
#define SetP1nAutoMode(b)               PORT_SetAutoMode(1, (b))
#define SetP2nAutoMode(b)               PORT_SetAutoMode(2, (b))
#define SetP3nAutoMode(b)               PORT_SetAutoMode(3, (b))
#define SetP4nAutoMode(b)               PORT_SetAutoMode(4, (b))
#define SetP5nAutoMode(b)               PORT_SetAutoMode(5, (b))
#define SetP6nAutoMode(b)               PORT_SetAutoMode(6, (b))
#define SetP7nAutoMode(b)               PORT_SetAutoMode(7, (b))
#define SetP8nAutoMode(b)               PORT_SetAutoMode(8, (b))
#define SetP9nAutoMode(b)               PORT_SetAutoMode(9, (b))
#define SetPAnAutoMode(b)               PORT_SetAutoMode(A, (b))
#define SetPBnAutoMode(b)               PORT_SetAutoMode(B, (b))

