fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define SetP0nManualMode(b)             PORT_SetManualMode(0, (b))
#define SetP1nManualMode(b)             PORT_SetManualMode(1, (b))
#define SetP2nManualMode(b)             PORT_SetManualMode(2, (b))
#define SetP3nManualMode(b)             PORT_SetManualMode(3, (b))
#define SetP4nManualMode(b)             PORT_SetManualMode(4, (b))
#define SetP5nManualMode(b)             PORT_SetManualMode(5, (b))
#define SetP6nManualMode(b)             PORT_SetManualMode(6, (b))
#define SetP7nManualMode(b)             PORT_SetManualMode(7, (b))
#define SetP8nManualMode(b)             PORT_SetManualMode(8, (b))
#define SetP9nManualMode(b)             PORT_SetManualMode(9, (b))
#define SetPAnManualMode(b)             PORT_SetManualMode(A, (b))
#define SetPBnManualMode(b)             PORT_SetManualMode(B, (b))

#define EnableP0nPullUp(b)              PORT_EnablePullUp(0, (b))
#define EnableP1nPullUp(b)              PORT_EnablePullUp(1, (b))
#define EnableP2nPullUp(b)              PORT_EnablePullUp(2, (b))
#define EnableP3nPullUp(b)              PORT_EnablePullUp(3, (b))
#define EnableP4nPullUp(b)              PORT_EnablePullUp(4, (b))
#define EnableP5nPullUp(b)              PORT_EnablePullUp(5, (b))
#define EnableP6nPullUp(b)              PORT_EnablePullUp(6, (b))
#define EnableP7nPullUp(b)              PORT_EnablePullUp(7, (b))
#define EnableP8nPullUp(b)              PORT_EnablePullUp(8, (b))
#define EnableP9nPullUp(b)              PORT_EnablePullUp(9, (b))
#define EnablePAnPullUp(b)              PORT_EnablePullUp(A, (b))
#define EnablePBnPullUp(b)              PORT_EnablePullUp(B, (b))

#define DisableP0nPullUp(b)             PORT_DisablePullUp(0, (b))
#define DisableP1nPullUp(b)             PORT_DisablePullUp(1, (b))
#define DisableP2nPullUp(b)             PORT_DisablePullUp(2, (b))
#define DisableP3nPullUp(b)             PORT_DisablePullUp(3, (b))
#define DisableP4nPullUp(b)             PORT_DisablePullUp(4, (b))
#define DisableP5nPullUp(b)             PORT_DisablePullUp(5, (b))
#define DisableP6nPullUp(b)             PORT_DisablePullUp(6, (b))
#define DisableP7nPullUp(b)             PORT_DisablePullUp(7, (b))
#define DisableP8nPullUp(b)             PORT_DisablePullUp(8, (b))
#define DisableP9nPullUp(b)             PORT_DisablePullUp(9, (b))
#define DisablePAnPullUp(b)             PORT_DisablePullUp(A, (b))
#define DisablePBnPullUp(b)             PORT_DisablePullUp(B, (b))

#define EnableP0nPullDown(b)            PORT_EnablePullDown(0, (b))
#define EnableP1nPullDown(b)            PORT_EnablePullDown(1, (b))
#define EnableP2nPullDown(b)            PORT_EnablePullDown(2, (b))
#define EnableP3nPullDown(b)            PORT_EnablePullDown(3, (b))
#define EnableP4nPullDown(b)            PORT_EnablePullDown(4, (b))
#define EnableP5nPullDown(b)            PORT_EnablePullDown(5, (b))
#define EnableP6nPullDown(b)            PORT_EnablePullDown(6, (b))
#define EnableP7nPullDown(b)            PORT_EnablePullDown(7, (b))
#define EnableP8nPullDown(b)            PORT_EnablePullDown(8, (b))
#define EnableP9nPullDown(b)            PORT_EnablePullDown(9, (b))
#define EnablePAnPullDown(b)            PORT_EnablePullDown(A, (b))
#define EnablePBnPullDown(b)            PORT_EnablePullDown(B, (b))

#define DisableP0nPullDown(b)           PORT_DisablePullDown(0, (b))
#define DisableP1nPullDown(b)           PORT_DisablePullDown(1, (b))
#define DisableP2nPullDown(b)           PORT_DisablePullDown(2, (b))
#define DisableP3nPullDown(b)           PORT_DisablePullDown(3, (b))
#define DisableP4nPullDown(b)           PORT_DisablePullDown(4, (b))
#define DisableP5nPullDown(b)           PORT_DisablePullDown(5, (b))
#define DisableP6nPullDown(b)           PORT_DisablePullDown(6, (b))
#define DisableP7nPullDown(b)           PORT_DisablePullDown(7, (b))
#define DisableP8nPullDown(b)           PORT_DisablePullDown(8, (b))
#define DisableP9nPullDown(b)           PORT_DisablePullDown(9, (b))
#define DisablePAnPullDown(b)           PORT_DisablePullDown(A, (b))
#define DisablePBnPullDown(b)           PORT_DisablePullDown(B, (b))

#define EnableP0nSchmitt(b)             PORT_EnableSchmitt(0, (b))
#define EnableP1nSchmitt(b)             PORT_EnableSchmitt(1, (b))
#define EnableP2nSchmitt(b)             PORT_EnableSchmitt(2, (b))
#define EnableP3nSchmitt(b)             PORT_EnableSchmitt(3, (b))
#define EnableP4nSchmitt(b)             PORT_EnableSchmitt(4, (b))
#define EnableP5nSchmitt(b)             PORT_EnableSchmitt(5, (b))
#define EnableP6nSchmitt(b)             PORT_EnableSchmitt(6, (b))
#define EnableP7nSchmitt(b)             PORT_EnableSchmitt(7, (b))
#define EnableP8nSchmitt(b)             PORT_EnableSchmitt(8, (b))
#define EnableP9nSchmitt(b)             PORT_EnableSchmitt(9, (b))
#define EnablePAnSchmitt(b)             PORT_EnableSchmitt(A, (b))
#define EnablePBnSchmitt(b)             PORT_EnableSchmitt(B, (b))

#define DisableP0nSchmitt(b)            PORT_DisableSchmitt(0, (b))
#define DisableP1nSchmitt(b)            PORT_DisableSchmitt(1, (b))
#define DisableP2nSchmitt(b)            PORT_DisableSchmitt(2, (b))
#define DisableP3nSchmitt(b)            PORT_DisableSchmitt(3, (b))
#define DisableP4nSchmitt(b)            PORT_DisableSchmitt(4, (b))
#define DisableP5nSchmitt(b)            PORT_DisableSchmitt(5, (b))
#define DisableP6nSchmitt(b)            PORT_DisableSchmitt(6, (b))
#define DisableP7nSchmitt(b)            PORT_DisableSchmitt(7, (b))
#define DisableP8nSchmitt(b)            PORT_DisableSchmitt(8, (b))
#define DisableP9nSchmitt(b)            PORT_DisableSchmitt(9, (b))
#define DisablePAnSchmitt(b)            PORT_DisableSchmitt(A, (b))
#define DisablePBnSchmitt(b)            PORT_DisableSchmitt(B, (b))

#define SetP0nSlewRateFast(b)           PORT_SetSlewRateFast(0, (b))
#define SetP1nSlewRateFast(b)           PORT_SetSlewRateFast(1, (b))
#define SetP2nSlewRateFast(b)           PORT_SetSlewRateFast(2, (b))
#define SetP3nSlewRateFast(b)           PORT_SetSlewRateFast(3, (b))
#define SetP4nSlewRateFast(b)           PORT_SetSlewRateFast(4, (b))
#define SetP5nSlewRateFast(b)           PORT_SetSlewRateFast(5, (b))
#define SetP6nSlewRateFast(b)           PORT_SetSlewRateFast(6, (b))
#define SetP7nSlewRateFast(b)           PORT_SetSlewRateFast(7, (b))
#define SetP8nSlewRateFast(b)           PORT_SetSlewRateFast(8, (b))
#define SetP9nSlewRateFast(b)           PORT_SetSlewRateFast(9, (b))
#define SetPAnSlewRateFast(b)           PORT_SetSlewRateFast(A, (b))
#define SetPBnSlewRateFast(b)           PORT_SetSlewRateFast(B, (b))

#define SetP0nSlewRateNormal(b)         PORT_SetSlewRateNormal(0, (b))
#define SetP1nSlewRateNormal(b)         PORT_SetSlewRateNormal(1, (b))
#define SetP2nSlewRateNormal(b)         PORT_SetSlewRateNormal(2, (b))
#define SetP3nSlewRateNormal(b)         PORT_SetSlewRateNormal(3, (b))
#define SetP4nSlewRateNormal(b)         PORT_SetSlewRateNormal(4, (b))
#define SetP5nSlewRateNormal(b)         PORT_SetSlewRateNormal(5, (b))
#define SetP6nSlewRateNormal(b)         PORT_SetSlewRateNormal(6, (b))
#define SetP7nSlewRateNormal(b)         PORT_SetSlewRateNormal(7, (b))
#define SetP8nSlewRateNormal(b)         PORT_SetSlewRateNormal(8, (b))
#define SetP9nSlewRateNormal(b)         PORT_SetSlewRateNormal(9, (b))
#define SetPAnSlewRateNormal(b)         PORT_SetSlewRateNormal(A, (b))
#define SetPBnSlewRateNormal(b)         PORT_SetSlewRateNormal(B, (b))

