fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define SetP0nDrivingStrong(b)          PORT_SetDrivingStrong(0, (b))
#define SetP1nDrivingStrong(b)          PORT_SetDrivingStrong(1, (b))
#define SetP2nDrivingStrong(b)          PORT_SetDrivingStrong(2, (b))
#define SetP3nDrivingStrong(b)          PORT_SetDrivingStrong(3, (b))
#define SetP4nDrivingStrong(b)          PORT_SetDrivingStrong(4, (b))
#define SetP5nDrivingStrong(b)          PORT_SetDrivingStrong(5, (b))
#define SetP6nDrivingStrong(b)          PORT_SetDrivingStrong(6, (b))
#define SetP7nDrivingStrong(b)          PORT_SetDrivingStrong(7, (b))
#define SetP8nDrivingStrong(b)          PORT_SetDrivingStrong(8, (b))
#define SetP9nDrivingStrong(b)          PORT_SetDrivingStrong(9, (b))
#define SetPAnDrivingStrong(b)          PORT_SetDrivingStrong(A, (b))
#define SetPBnDrivingStrong(b)          PORT_SetDrivingStrong(B, (b))

#define SetP0nDrivingNormal(b)          PORT_SetDrivingNormal(0, (b))
#define SetP1nDrivingNormal(b)          PORT_SetDrivingNormal(1, (b))
#define SetP2nDrivingNormal(b)          PORT_SetDrivingNormal(2, (b))
#define SetP3nDrivingNormal(b)          PORT_SetDrivingNormal(3, (b))
#define SetP4nDrivingNormal(b)          PORT_SetDrivingNormal(4, (b))
#define SetP5nDrivingNormal(b)          PORT_SetDrivingNormal(5, (b))
#define SetP6nDrivingNormal(b)          PORT_SetDrivingNormal(6, (b))
#define SetP7nDrivingNormal(b)          PORT_SetDrivingNormal(7, (b))
#define SetP8nDrivingNormal(b)          PORT_SetDrivingNormal(8, (b))
#define SetP9nDrivingNormal(b)          PORT_SetDrivingNormal(9, (b))
#define SetPAnDrivingNormal(b)          PORT_SetDrivingNormal(A, (b))
#define SetPBnDrivingNormal(b)          PORT_SetDrivingNormal(B, (b))

#define SetP0nAnalogInput(b)            PORT_SetAnalogInput(0, (b))
#define SetP1nAnalogInput(b)            PORT_SetAnalogInput(1, (b))
#define SetP2nAnalogInput(b)            PORT_SetAnalogInput(2, (b))
#define SetP3nAnalogInput(b)            PORT_SetAnalogInput(3, (b))
#define SetP4nAnalogInput(b)            PORT_SetAnalogInput(4, (b))
#define SetP5nAnalogInput(b)            PORT_SetAnalogInput(5, (b))
#define SetP6nAnalogInput(b)            PORT_SetAnalogInput(6, (b))
#define SetP7nAnalogInput(b)            PORT_SetAnalogInput(7, (b))
#define SetP8nAnalogInput(b)            PORT_SetAnalogInput(8, (b))
#define SetP9nAnalogInput(b)            PORT_SetAnalogInput(9, (b))
#define SetPAnAnalogInput(b)            PORT_SetAnalogInput(A, (b))
#define SetPBnAnalogInput(b)            PORT_SetAnalogInput(B, (b))

#define SetP0nDigitalInput(b)           PORT_SetDigitalInput(0, (b))
#define SetP1nDigitalInput(b)           PORT_SetDigitalInput(1, (b))
#define SetP2nDigitalInput(b)           PORT_SetDigitalInput(2, (b))
#define SetP3nDigitalInput(b)           PORT_SetDigitalInput(3, (b))
#define SetP4nDigitalInput(b)           PORT_SetDigitalInput(4, (b))
#define SetP5nDigitalInput(b)           PORT_SetDigitalInput(5, (b))
#define SetP6nDigitalInput(b)           PORT_SetDigitalInput(6, (b))
#define SetP7nDigitalInput(b)           PORT_SetDigitalInput(7, (b))
#define SetP8nDigitalInput(b)           PORT_SetDigitalInput(8, (b))
#define SetP9nDigitalInput(b)           PORT_SetDigitalInput(9, (b))
#define SetPAnDigitalInput(b)           PORT_SetDigitalInput(A, (b))
#define SetPBnDigitalInput(b)           PORT_SetDigitalInput(B, (b))

/////////////////////////////////////////////////

#define EnableGlobalInt()               (EA = 1)
#define DisableGlobalInt()              (EA = 0)

#define INT0_EnableInt()                (EX0 = 1)
#define INT0_DisableInt()               (EX0 = 0)

#define INT1_EnableInt()                (EX1 = 1)
#define INT1_DisableInt()               (EX1 = 0)

#define INTCLKO_EX2_MSK                 BIT4
#define INT2_EnableInt()                SET_REG_BIT(INTCLKO, INTCLKO_EX2_MSK)
#define INT2_DisableInt()               CLR_REG_BIT(INTCLKO, INTCLKO_EX2_MSK)

#define INTCLKO_EX3_MSK                 BIT5
#define INT3_EnableInt()                SET_REG_BIT(INTCLKO, INTCLKO_EX3_MSK)
#define INT3_DisableInt()               CLR_REG_BIT(INTCLKO, INTCLKO_EX3_MSK)

#define INTCLKO_EX4_MSK                 BIT6
#define INT4_EnableInt()                SET_REG_BIT(INTCLKO, INTCLKO_EX4_MSK)
#define INT4_DisableInt()               CLR_REG_BIT(INTCLKO, INTCLKO_EX4_MSK)

#define TIMER0_EnableInt()              (ET0 = 1)
#define TIMER0_DisableInt()             (ET0 = 0)

#define TIMER1_EnableInt()              (ET1 = 1)
#define TIMER1_DisableInt()             (ET1 = 0)

#define IE2_ET2_MSK                     BIT2
#define TIMER2_EnableInt()              SET_REG_BIT(IE2, IE2_ET2_MSK)
#define TIMER2_DisableInt()             CLR_REG_BIT(IE2, IE2_ET2_MSK)

#define IE2_ET3_MSK                     BIT5
#define TIMER3_EnableInt()              SET_REG_BIT(IE2, IE2_ET3_MSK)
#define TIMER3_DisableInt()             CLR_REG_BIT(IE2, IE2_ET3_MSK)

#define IE2_ET4_MSK                     BIT6
#define TIMER4_EnableInt()              SET_REG_BIT(IE2, IE2_ET4_MSK)
#define TIMER4_DisableInt()             CLR_REG_BIT(IE2, IE2_ET4_MSK)

#define T6T5CFG_ET5_MSK                 BIT0
#define TIMER5_EnableInt()              SET_REG_BIT(T6T5CFG, T6T5CFG_ET5_MSK)
#define TIMER5_DisableInt()             CLR_REG_BIT(T6T5CFG, T6T5CFG_ET5_MSK)

#define T6T5CFG_ET6_MSK                 BIT4
#define TIMER6_EnableInt()              SET_REG_BIT(T6T5CFG, T6T5CFG_ET6_MSK)
#define TIMER6_DisableInt()             CLR_REG_BIT(T6T5CFG, T6T5CFG_ET6_MSK)

#define T8T7CFG_ET7_MSK                 BIT0
#define TIMER7_EnableInt()              SET_REG_BIT(T8T7CFG, T8T7CFG_ET7_MSK)
#define TIMER7_DisableInt()             CLR_REG_BIT(T8T7CFG, T8T7CFG_ET7_MSK)

#define T8T7CFG_ET8_MSK                 BIT4
#define TIMER8_EnableInt()              SET_REG_BIT(T8T7CFG, T8T7CFG_ET8_MSK)
#define TIMER8_DisableInt()             CLR_REG_BIT(T8T7CFG, T8T7CFG_ET8_MSK)

#define T10T9CFG_ET9_MSK                BIT0
#define TIMER9_EnableInt()              SET_REG_BIT(T10T9CFG, T10T9CFG_ET9_MSK)
#define TIMER9_DisableInt()             CLR_REG_BIT(T10T9CFG, T10T9CFG_ET9_MSK)

#define T10T9CFG_ET10_MSK               BIT4
#define TIMER10_EnableInt()             SET_REG_BIT(T10T9CFG, T10T9CFG_ET10_MSK)
#define TIMER10_DisableInt()            CLR_REG_BIT(T10T9CFG, T10T9CFG_ET10_MSK)

#define T11CR_ET11I_MSK                 BIT1
#define TIMER11_EnableInt()             SET_REG_BIT(T11CR, T11CR_ET11I_MSK)
#define TIMER11_DisableInt()            CLR_REG_BIT(T11CR, T11CR_ET11I_MSK)

