fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define T18T17CFG_ET17_MSK              BIT0
#define TIMER17_EnableInt()             SET_REG_BIT(T18T17CFG, T18T17CFG_ET17_MSK)
#define TIMER17_DisableInt()            CLR_REG_BIT(T18T17CFG, T18T17CFG_ET17_MSK)

#define T18T17CFG_ET18_MSK              BIT4
#define TIMER18_EnableInt()             SET_REG_BIT(T18T17CFG, T18T17CFG_ET18_MSK)
#define TIMER18_DisableInt()            CLR_REG_BIT(T18T17CFG, T18T17CFG_ET18_MSK)

#define UART1_EnableInt()               (ES = 1)
#define UART1_DisableInt()              (ES = 0)

#define IE2_ES2_MSK                     BIT0
#define UART2_EnableInt()               SET_REG_BIT(IE2, IE2_ES2_MSK)
#define UART2_DisableInt()              CLR_REG_BIT(IE2, IE2_ES2_MSK)

#define IE2_ES3_MSK                     BIT3
#define UART3_EnableInt()               SET_REG_BIT(IE2, IE2_ES3_MSK)
#define UART3_DisableInt()              CLR_REG_BIT(IE2, IE2_ES3_MSK)

#define IE2_ES4_MSK                     BIT4
#define UART4_EnableInt()               SET_REG_BIT(IE2, IE2_ES4_MSK)
#define UART4_DisableInt()              CLR_REG_BIT(IE2, IE2_ES4_MSK)

#define S5INTR_ES5_MSK                  BIT4
#define UART5_EnableInt()               SET_REG_BIT(S5INTR, S5INTR_ES5_MSK)
#define UART5_DisableInt()              CLR_REG_BIT(S5INTR, S5INTR_ES5_MSK)

#define S6INTR_ES6_MSK                  BIT4
#define UART6_EnableInt()               SET_REG_BIT(S6INTR, S6INTR_ES6_MSK)
#define UART6_DisableInt()              CLR_REG_BIT(S6INTR, S6INTR_ES6_MSK)

#define S7INTR_ES7_MSK                  BIT4
#define UART7_EnableInt()               SET_REG_BIT(S7INTR, S7INTR_ES7_MSK)
#define UART7_DisableInt()              CLR_REG_BIT(S7INTR, S7INTR_ES7_MSK)

#define S8INTR_ES8_MSK                  BIT4
#define UART8_EnableInt()               SET_REG_BIT(S8INTR, S8INTR_ES8_MSK)
#define UART8_DisableInt()              CLR_REG_BIT(S8INTR, S8INTR_ES8_MSK)

#define LVD_EnableInt()                 (ELVD = 1)
#define LVD_DisableInt()                (ELVD = 0)

#define ADC1_EnableInt()                (EADC = 1)
#define ADC1_DisableInt()               (EADC = 0)

#define ADC2INTR_EADC2_MSK              BIT0
#define ADC2_EnableInt()                SET_REG_BIT(ADC2INTR, ADC2INTR_EADC2_MSK)
#define ADC2_DisableInt()               CLR_REG_BIT(ADC2INTR, ADC2INTR_EADC2_MSK)

#define DAC1CR_EDAC_MSK                 BIT1
#define DAC1_EnableInt()                SET_REG_BIT(DAC1_CR, DAC1CR_EDAC_MSK)
#define DAC1_DisableInt()               CLR_REG_BIT(DAC1_CR, DAC1CR_EDAC_MSK)

#define DAC2CR_EDAC_MSK                 BIT1
#define DAC2_EnableInt()                SET_REG_BIT(DAC2_CR, DAC2CR_EDAC_MSK)
#define DAC2_DisableInt()               CLR_REG_BIT(DAC2_CR, DAC2CR_EDAC_MSK)

#define IE2_ESPI_MSK                    BIT1
#define SPI1_EnableInt()                SET_REG_BIT(IE2, IE2_ESPI_MSK)
#define SPI1_DisableInt()               CLR_REG_BIT(IE2, IE2_ESPI_MSK)

#define SPI2INTR_ESPI2_MSK              BIT0
#define SPI2_EnableInt()                SET_REG_BIT(SPI2INTR, SPI2INTR_ESPI2_MSK)
#define SPI2_DisableInt()               CLR_REG_BIT(SPI2INTR, SPI2INTR_ESPI2_MSK)

#define SPI3INTR_ESPI3_MSK              BIT0
#define SPI3_EnableInt()                SET_REG_BIT(SPI3INTR, SPI3INTR_ESPI3_MSK)
#define SPI3_DisableInt()               CLR_REG_BIT(SPI3INTR, SPI3INTR_ESPI3_MSK)

#define IE2_EUSB_MSK                    BIT7
#define USB_EnableInt()                 SET_REG_BIT(IE2, IE2_EUSB_MSK)
#define USB_DisableInt()                CLR_REG_BIT(IE2, IE2_EUSB_MSK)

#define CMP1CR1_PIE_MSK                 BIT5
#define CMP1CR1_NIE_MSK                 BIT4
#define CMP1_EnablePosedgeInt()         SET_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_PIE_MSK)
#define CMP1_EnableNegedgeInt()         SET_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_NIE_MSK)
#define CMP1_EnableEdgeInt()            SET_REG_BIT(CMP1_6P6N_CR1, (CMP1CR1_PIE_MSK | CMP1CR1_NIE_MSK))
#define CMP1_DisableInt()               CLR_REG_BIT(CMP1_6P6N_CR1, (CMP1CR1_PIE_MSK | CMP1CR1_NIE_MSK))

#define CMP2CR1_PIE_MSK                 BIT5
#define CMP2CR1_NIE_MSK                 BIT4
#define CMP2_EnablePosedgeInt()         SET_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_PIE_MSK)
#define CMP2_EnableNegedgeInt()         SET_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_NIE_MSK)
#define CMP2_EnableEdgeInt()            SET_REG_BIT(CMP2_6P6N_CR1, (CMP2CR1_PIE_MSK | CMP2CR1_NIE_MSK))
#define CMP2_DisableInt()               CLR_REG_BIT(CMP2_6P6N_CR1, (CMP2CR1_PIE_MSK | CMP2CR1_NIE_MSK))

#define CMP3CR1_PIE_MSK                 BIT5
#define CMP3CR1_NIE_MSK                 BIT4
#define CMP3_EnablePosedgeInt()         SET_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_PIE_MSK)
#define CMP3_EnableNegedgeInt()         SET_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_NIE_MSK)
#define CMP3_EnableEdgeInt()            SET_REG_BIT(CMP3_6P6N_CR1, (CMP3CR1_PIE_MSK | CMP3CR1_NIE_MSK))
#define CMP3_DisableInt()               CLR_REG_BIT(CMP3_6P6N_CR1, (CMP3CR1_PIE_MSK | CMP3CR1_NIE_MSK))

#define CMP4CR1_PIE_MSK                 BIT5
#define CMP4CR1_NIE_MSK                 BIT4
#define CMP4_EnablePosedgeInt()         SET_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_PIE_MSK)
#define CMP4_EnableNegedgeInt()         SET_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_NIE_MSK)
#define CMP4_EnableEdgeInt()            SET_REG_BIT(CMP4_6P6N_CR1, (CMP4CR1_PIE_MSK | CMP4CR1_NIE_MSK))
#define CMP4_DisableInt()               CLR_REG_BIT(CMP4_6P6N_CR1, (CMP4CR1_PIE_MSK | CMP4CR1_NIE_MSK))

#define RTCIEN_ALARM_MSK                BIT7
#define RTCIEN_DAY_MSK                  BIT6
#define RTCIEN_HOUR_MSK                 BIT5
#define RTCIEN_MIN_MSK                  BIT4
#define RTCIEN_SEC_MSK                  BIT3
#define RTCIEN_SEC2_MSK                 BIT2
#define RTCIEN_SEC8_MSK                 BIT1
#define RTCIEN_SEC32_MSK                BIT0
#define RTC_EnableAlarmInt()            SET_REG_BIT(RTCIEN, RTCIEN_ALARM_MSK)
#define RTC_EnableDayInt()              SET_REG_BIT(RTCIEN, RTCIEN_DAY_MSK)
#define RTC_EnableHourInt()             SET_REG_BIT(RTCIEN, RTCIEN_HOUR_MSK)
#define RTC_EnableMinuteInt()           SET_REG_BIT(RTCIEN, RTCIEN_MIN_MSK)
#define RTC_EnableSecondInt()           SET_REG_BIT(RTCIEN, RTCIEN_SEC_MSK)
#define RTC_EnableSecondD2Int()         SET_REG_BIT(RTCIEN, RTCIEN_SEC2_MSK)
#define RTC_EnableSecondD8Int()         SET_REG_BIT(RTCIEN, RTCIEN_SEC8_MSK)
#define RTC_EnableSecondD32Int()        SET_REG_BIT(RTCIEN, RTCIEN_SEC32_MSK)
#define RTC_DisableAlarmInt()           CLR_REG_BIT(RTCIEN, RTCIEN_ALARM_MSK)
#define RTC_DisableDayInt()             CLR_REG_BIT(RTCIEN, RTCIEN_DAY_MSK)
#define RTC_DisableHourInt()            CLR_REG_BIT(RTCIEN, RTCIEN_HOUR_MSK)
#define RTC_DisableMinuteInt()          CLR_REG_BIT(RTCIEN, RTCIEN_MIN_MSK)
#define RTC_DisableSecondInt()          CLR_REG_BIT(RTCIEN, RTCIEN_SEC_MSK)
#define RTC_DisableSecondD2Int()        CLR_REG_BIT(RTCIEN, RTCIEN_SEC2_MSK)
#define RTC_DisableSecondD8Int()        CLR_REG_BIT(RTCIEN, RTCIEN_SEC8_MSK)
#define RTC_DisableSecondD32Int()       CLR_REG_BIT(RTCIEN, RTCIEN_SEC32_MSK)

#define LCMIFIE_MSK                     BIT7
#define LCM_EnableInt()                 SET_REG_BIT(LCMIFCFG, LCMIFIE_MSK)
#define LCM_DisableInt()                CLR_REG_BIT(LCMIFCFG, LCMIFIE_MSK)

#define I2CMSCR_EMSI_MSK                BIT7
#define I2C1_EnableMasterInt()          SET_REG_BIT(I2CMSCR, I2CMSCR_EMSI_MSK)
#define I2C1_DisableMasterInt()         CLR_REG_BIT(I2CMSCR, I2CMSCR_EMSI_MSK)

#define I2CSLCR_ESTAI_MSK               BIT6
#define I2CSLCR_ERXI_MSK                BIT5
#define I2CSLCR_ETXI_MSK                BIT4
#define I2CSLCR_ESTOI_MSK               BIT3
#define I2C1_EnableSlaveSTAInt()        SET_REG_BIT(I2CSLCR, I2CSLCR_ESTAI_MSK)
#define I2C1_EnableSlaveSTOInt()        SET_REG_BIT(I2CSLCR, I2CSLCR_ESTOI_MSK)
#define I2C1_EnableSlaveRXInt()         SET_REG_BIT(I2CSLCR, I2CSLCR_ERXI_MSK)
#define I2C1_EnableSlaveTXInt()         SET_REG_BIT(I2CSLCR, I2CSLCR_ETXI_MSK)
#define I2C1_EnableSlaveAllInt()        SET_REG_BIT(I2CSLCR, I2CSLCR_ESTAI_MSK | I2CSLCR_ESTOI_MSK | I2CSLCR_ERXI_MSK | I2CSLCR_ETXI_MSK)
#define I2C1_DisableSlaveSTAInt()       CLR_REG_BIT(I2CSLCR, I2CSLCR_ESTAI_MSK)
#define I2C1_DisableSlaveSTOInt()       CLR_REG_BIT(I2CSLCR, I2CSLCR_ESTOI_MSK)
#define I2C1_DisableSlaveRXInt()        CLR_REG_BIT(I2CSLCR, I2CSLCR_ERXI_MSK)
#define I2C1_DisableSlaveTXInt()        CLR_REG_BIT(I2CSLCR, I2CSLCR_ETXI_MSK)
#define I2C1_DisableSlaveAllInt()       CLR_REG_BIT(I2CSLCR, I2CSLCR_ESTAI_MSK | I2CSLCR_ESTOI_MSK | I2CSLCR_ERXI_MSK | I2CSLCR_ETXI_MSK)

#define I2C2MSCR_EMSI_MSK               BIT7
#define I2C2_EnableMasterInt()          SET_REG_BIT(I2C2MSCR, I2C2MSCR_EMSI_MSK)
#define I2C2_DisableMasterInt()         CLR_REG_BIT(I2C2MSCR, I2C2MSCR_EMSI_MSK)

#define I2C2SLCR_ESTAI_MSK              BIT6
#define I2C2SLCR_ERXI_MSK               BIT5
#define I2C2SLCR_ETXI_MSK               BIT4
#define I2C2SLCR_ESTOI_MSK              BIT3
#define I2C2_EnableSlaveSTAInt()        SET_REG_BIT(I2C2SLCR, I2C2SLCR_ESTAI_MSK)
#define I2C2_EnableSlaveSTOInt()        SET_REG_BIT(I2C2SLCR, I2C2SLCR_ESTOI_MSK)
#define I2C2_EnableSlaveRXInt()         SET_REG_BIT(I2C2SLCR, I2C2SLCR_ERXI_MSK)
#define I2C2_EnableSlaveTXInt()         SET_REG_BIT(I2C2SLCR, I2C2SLCR_ETXI_MSK)
#define I2C2_EnableSlaveAllInt()        SET_REG_BIT(I2C2SLCR, I2C2SLCR_ESTAI_MSK | I2C2SLCR_ESTOI_MSK | I2C2SLCR_ERXI_MSK | I2C2SLCR_ETXI_MSK)
#define I2C2_DisableSlaveSTAInt()       CLR_REG_BIT(I2C2SLCR, I2C2SLCR_ESTAI_MSK)
#define I2C2_DisableSlaveSTOInt()       CLR_REG_BIT(I2C2SLCR, I2C2SLCR_ESTOI_MSK)
#define I2C2_DisableSlaveRXInt()        CLR_REG_BIT(I2C2SLCR, I2C2SLCR_ERXI_MSK)
#define I2C2_DisableSlaveTXInt()        CLR_REG_BIT(I2C2SLCR, I2C2SLCR_ETXI_MSK)
#define I2C2_DisableSlaveAllInt()       CLR_REG_BIT(I2C2SLCR, I2C2SLCR_ESTAI_MSK | I2C2SLCR_ESTOI_MSK | I2C2SLCR_ERXI_MSK | I2C2SLCR_ETXI_MSK)

#define PWMAIER_BIE_MSK                 BIT7
#define PWMAIER_TIE_MSK                 BIT6
#define PWMAIER_COMIE_MSK               BIT5
#define PWMAIER_CC4IE_MSK               BIT4
#define PWMAIER_CC3IE_MSK               BIT3
#define PWMAIER_CC2IE_MSK               BIT2
#define PWMAIER_CC1IE_MSK               BIT1
#define PWMAIER_UIE_MSK                 BIT0
#define PWMA_EnableBreakInt()           SET_REG_BIT(PWMA_IER, PWMAIER_BIE_MSK)
#define PWMA_EnableTriggerInt()         SET_REG_BIT(PWMA_IER, PWMAIER_TIE_MSK)
#define PWMA_EnableCOMInt()             SET_REG_BIT(PWMA_IER, PWMAIER_COMIE_MSK)
#define PWMA_EnableCC4Int()             SET_REG_BIT(PWMA_IER, PWMAIER_CC4IE_MSK)
#define PWMA_EnableCC3Int()             SET_REG_BIT(PWMA_IER, PWMAIER_CC3IE_MSK)
#define PWMA_EnableCC2Int()             SET_REG_BIT(PWMA_IER, PWMAIER_CC2IE_MSK)
#define PWMA_EnableCC1Int()             SET_REG_BIT(PWMA_IER, PWMAIER_CC1IE_MSK)
#define PWMA_EnableUpdateInt()          SET_REG_BIT(PWMA_IER, PWMAIER_UIE_MSK)
#define PWMA_DisableBreakInt()          CLR_REG_BIT(PWMA_IER, PWMAIER_BIE_MSK)
#define PWMA_DisableTriggerInt()        CLR_REG_BIT(PWMA_IER, PWMAIER_TIE_MSK)
#define PWMA_DisableCOMInt()            CLR_REG_BIT(PWMA_IER, PWMAIER_COMIE_MSK)
#define PWMA_DisableCC4Int()            CLR_REG_BIT(PWMA_IER, PWMAIER_CC4IE_MSK)
#define PWMA_DisableCC3Int()            CLR_REG_BIT(PWMA_IER, PWMAIER_CC3IE_MSK)
#define PWMA_DisableCC2Int()            CLR_REG_BIT(PWMA_IER, PWMAIER_CC2IE_MSK)
#define PWMA_DisableCC1Int()            CLR_REG_BIT(PWMA_IER, PWMAIER_CC1IE_MSK)
#define PWMA_DisableUpdateInt()         CLR_REG_BIT(PWMA_IER, PWMAIER_UIE_MSK)

#define HSPWMA_EnableBreakInt()         SET_HSPWMA_BIT(PWMA_IER, PWMAIER_BIE_MSK)
#define HSPWMA_EnableTriggerInt()       SET_HSPWMA_BIT(PWMA_IER, PWMAIER_TIE_MSK)
#define HSPWMA_EnableCOMInt()           SET_HSPWMA_BIT(PWMA_IER, PWMAIER_COMIE_MSK)
#define HSPWMA_EnableCC4Int()           SET_HSPWMA_BIT(PWMA_IER, PWMAIER_CC4IE_MSK)
#define HSPWMA_EnableCC3Int()           SET_HSPWMA_BIT(PWMA_IER, PWMAIER_CC3IE_MSK)
#define HSPWMA_EnableCC2Int()           SET_HSPWMA_BIT(PWMA_IER, PWMAIER_CC2IE_MSK)
#define HSPWMA_EnableCC1Int()           SET_HSPWMA_BIT(PWMA_IER, PWMAIER_CC1IE_MSK)
#define HSPWMA_EnableUpdateInt()        SET_HSPWMA_BIT(PWMA_IER, PWMAIER_UIE_MSK)
#define HSPWMA_DisableBreakInt()        CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_BIE_MSK)
#define HSPWMA_DisableTriggerInt()      CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_TIE_MSK)
#define HSPWMA_DisableCOMInt()          CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_COMIE_MSK)
#define HSPWMA_DisableCC4Int()          CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_CC4IE_MSK)
#define HSPWMA_DisableCC3Int()          CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_CC3IE_MSK)
#define HSPWMA_DisableCC2Int()          CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_CC2IE_MSK)
#define HSPWMA_DisableCC1Int()          CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_CC1IE_MSK)
#define HSPWMA_DisableUpdateInt()       CLR_HSPWMA_BIT(PWMA_IER, PWMAIER_UIE_MSK)

#define PWMBIER_BIE_MSK                 BIT7
#define PWMBIER_TIE_MSK                 BIT6
#define PWMBIER_COMIE_MSK               BIT5
#define PWMBIER_CC8IE_MSK               BIT4
#define PWMBIER_CC7IE_MSK               BIT3
#define PWMBIER_CC6IE_MSK               BIT2
#define PWMBIER_CC5IE_MSK               BIT1
#define PWMBIER_UIE_MSK                 BIT0
#define PWMB_EnableBreakInt()           SET_REG_BIT(PWMB_IER, PWMBIER_BIE_MSK)
#define PWMB_EnableTriggerInt()         SET_REG_BIT(PWMB_IER, PWMBIER_TIE_MSK)
#define PWMB_EnableCOMInt()             SET_REG_BIT(PWMB_IER, PWMBIER_COMIE_MSK)
#define PWMB_EnableCC8Int()             SET_REG_BIT(PWMB_IER, PWMBIER_CC8IE_MSK)
#define PWMB_EnableCC7Int()             SET_REG_BIT(PWMB_IER, PWMBIER_CC7IE_MSK)
#define PWMB_EnableCC6Int()             SET_REG_BIT(PWMB_IER, PWMBIER_CC6IE_MSK)
#define PWMB_EnableCC5Int()             SET_REG_BIT(PWMB_IER, PWMBIER_CC5IE_MSK)
#define PWMB_EnableUpdateInt()          SET_REG_BIT(PWMB_IER, PWMBIER_UIE_MSK)
#define PWMB_DisableBreakInt()          CLR_REG_BIT(PWMB_IER, PWMBIER_BIE_MSK)
#define PWMB_DisableTriggerInt()        CLR_REG_BIT(PWMB_IER, PWMBIER_TIE_MSK)
#define PWMB_DisableCOMInt()            CLR_REG_BIT(PWMB_IER, PWMBIER_COMIE_MSK)
#define PWMB_DisableCC8Int()            CLR_REG_BIT(PWMB_IER, PWMBIER_CC8IE_MSK)
#define PWMB_DisableCC7Int()            CLR_REG_BIT(PWMB_IER, PWMBIER_CC7IE_MSK)
#define PWMB_DisableCC6Int()            CLR_REG_BIT(PWMB_IER, PWMBIER_CC6IE_MSK)
#define PWMB_DisableCC5Int()            CLR_REG_BIT(PWMB_IER, PWMBIER_CC5IE_MSK)
#define PWMB_DisableUpdateInt()         CLR_REG_BIT(PWMB_IER, PWMBIER_UIE_MSK)

#define HSPWMB_EnableBreakInt()         SET_HSPWMB_BIT(PWMB_IER, PWMBIER_BIE_MSK)
#define HSPWMB_EnableTriggerInt()       SET_HSPWMB_BIT(PWMB_IER, PWMBIER_TIE_MSK)
#define HSPWMB_EnableCOMInt()           SET_HSPWMB_BIT(PWMB_IER, PWMBIER_COMIE_MSK)
#define HSPWMB_EnableCC8Int()           SET_HSPWMB_BIT(PWMB_IER, PWMBIER_CC8IE_MSK)
#define HSPWMB_EnableCC7Int()           SET_HSPWMB_BIT(PWMB_IER, PWMBIER_CC7IE_MSK)
#define HSPWMB_EnableCC6Int()           SET_HSPWMB_BIT(PWMB_IER, PWMBIER_CC6IE_MSK)
#define HSPWMB_EnableCC5Int()           SET_HSPWMB_BIT(PWMB_IER, PWMBIER_CC5IE_MSK)
#define HSPWMB_EnableUpdateInt()        SET_HSPWMB_BIT(PWMB_IER, PWMBIER_UIE_MSK)
#define HSPWMB_DisableBreakInt()        CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_BIE_MSK)
#define HSPWMB_DisableTriggerInt()      CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_TIE_MSK)
#define HSPWMB_DisableCOMInt()          CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_COMIE_MSK)
#define HSPWMB_DisableCC8Int()          CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_CC8IE_MSK)
#define HSPWMB_DisableCC7Int()          CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_CC7IE_MSK)
#define HSPWMB_DisableCC6Int()          CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_CC6IE_MSK)
#define HSPWMB_DisableCC5Int()          CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_CC5IE_MSK)
#define HSPWMB_DisableUpdateInt()       CLR_HSPWMB_BIT(PWMB_IER, PWMBIER_UIE_MSK)

#define PWMCIER_BIE_MSK                 BIT7
#define PWMCIER_TIE_MSK                 BIT6
#define PWMCIER_COMIE_MSK               BIT5
#define PWMCIER_CC4IE_MSK               BIT4
#define PWMCIER_CC3IE_MSK               BIT3
#define PWMCIER_CC2IE_MSK               BIT2
#define PWMCIER_CC1IE_MSK               BIT1
#define PWMCIER_UIE_MSK                 BIT0
#define PWMC_EnableBreakInt()           SET_REG_BIT(PWMC_IER, PWMCIER_BIE_MSK)
#define PWMC_EnableTriggerInt()         SET_REG_BIT(PWMC_IER, PWMCIER_TIE_MSK)
#define PWMC_EnableCOMInt()             SET_REG_BIT(PWMC_IER, PWMCIER_COMIE_MSK)
#define PWMC_EnableCC4Int()             SET_REG_BIT(PWMC_IER, PWMCIER_CC4IE_MSK)
#define PWMC_EnableCC3Int()             SET_REG_BIT(PWMC_IER, PWMCIER_CC3IE_MSK)
#define PWMC_EnableCC2Int()             SET_REG_BIT(PWMC_IER, PWMCIER_CC2IE_MSK)
#define PWMC_EnableCC1Int()             SET_REG_BIT(PWMC_IER, PWMCIER_CC1IE_MSK)
#define PWMC_EnableUpdateInt()          SET_REG_BIT(PWMC_IER, PWMCIER_UIE_MSK)
#define PWMC_DisableBreakInt()          CLR_REG_BIT(PWMC_IER, PWMCIER_BIE_MSK)
#define PWMC_DisableTriggerInt()        CLR_REG_BIT(PWMC_IER, PWMCIER_TIE_MSK)
#define PWMC_DisableCOMInt()            CLR_REG_BIT(PWMC_IER, PWMCIER_COMIE_MSK)
#define PWMC_DisableCC4Int()            CLR_REG_BIT(PWMC_IER, PWMCIER_CC4IE_MSK)
#define PWMC_DisableCC3Int()            CLR_REG_BIT(PWMC_IER, PWMCIER_CC3IE_MSK)
#define PWMC_DisableCC2Int()            CLR_REG_BIT(PWMC_IER, PWMCIER_CC2IE_MSK)
#define PWMC_DisableCC1Int()            CLR_REG_BIT(PWMC_IER, PWMCIER_CC1IE_MSK)
#define PWMC_DisableUpdateInt()         CLR_REG_BIT(PWMC_IER, PWMCIER_UIE_MSK)

#define HSPWMC_EnableBreakInt()         SET_HSPWMC_BIT(PWMC_IER, PWMCIER_BIE_MSK)
#define HSPWMC_EnableTriggerInt()       SET_HSPWMC_BIT(PWMC_IER, PWMCIER_TIE_MSK)
#define HSPWMC_EnableCOMInt()           SET_HSPWMC_BIT(PWMC_IER, PWMCIER_COMIE_MSK)
#define HSPWMC_EnableCC4Int()           SET_HSPWMC_BIT(PWMC_IER, PWMCIER_CC4IE_MSK)
#define HSPWMC_EnableCC3Int()           SET_HSPWMC_BIT(PWMC_IER, PWMCIER_CC3IE_MSK)
#define HSPWMC_EnableCC2Int()           SET_HSPWMC_BIT(PWMC_IER, PWMCIER_CC2IE_MSK)
#define HSPWMC_EnableCC1Int()           SET_HSPWMC_BIT(PWMC_IER, PWMCIER_CC1IE_MSK)
#define HSPWMC_EnableUpdateInt()        SET_HSPWMC_BIT(PWMC_IER, PWMCIER_UIE_MSK)
#define HSPWMC_DisableBreakInt()        CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_BIE_MSK)
#define HSPWMC_DisableTriggerInt()      CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_TIE_MSK)
#define HSPWMC_DisableCOMInt()          CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_COMIE_MSK)
#define HSPWMC_DisableCC4Int()          CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_CC4IE_MSK)
#define HSPWMC_DisableCC3Int()          CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_CC3IE_MSK)
#define HSPWMC_DisableCC2Int()          CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_CC2IE_MSK)
#define HSPWMC_DisableCC1Int()          CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_CC1IE_MSK)
#define HSPWMC_DisableUpdateInt()       CLR_HSPWMC_BIT(PWMC_IER, PWMCIER_UIE_MSK)

