fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMDIER_BIE_MSK                 BIT7
#define PWMDIER_TIE_MSK                 BIT6
#define PWMDIER_COMIE_MSK               BIT5
#define PWMDIER_CC8IE_MSK               BIT4
#define PWMDIER_CC7IE_MSK               BIT3
#define PWMDIER_CC6IE_MSK               BIT2
#define PWMDIER_CC5IE_MSK               BIT1
#define PWMDIER_UIE_MSK                 BIT0
#define PWMD_EnableBreakInt()           SET_REG_BIT(PWMD_IER, PWMDIER_BIE_MSK)
#define PWMD_EnableTriggerInt()         SET_REG_BIT(PWMD_IER, PWMDIER_TIE_MSK)
#define PWMD_EnableCOMInt()             SET_REG_BIT(PWMD_IER, PWMDIER_COMIE_MSK)
#define PWMD_EnableCC8Int()             SET_REG_BIT(PWMD_IER, PWMDIER_CC8IE_MSK)
#define PWMD_EnableCC7Int()             SET_REG_BIT(PWMD_IER, PWMDIER_CC7IE_MSK)
#define PWMD_EnableCC6Int()             SET_REG_BIT(PWMD_IER, PWMDIER_CC6IE_MSK)
#define PWMD_EnableCC5Int()             SET_REG_BIT(PWMD_IER, PWMDIER_CC5IE_MSK)
#define PWMD_EnableUpdateInt()          SET_REG_BIT(PWMD_IER, PWMDIER_UIE_MSK)
#define PWMD_DisableBreakInt()          CLR_REG_BIT(PWMD_IER, PWMDIER_BIE_MSK)
#define PWMD_DisableTriggerInt()        CLR_REG_BIT(PWMD_IER, PWMDIER_TIE_MSK)
#define PWMD_DisableCOMInt()            CLR_REG_BIT(PWMD_IER, PWMDIER_COMIE_MSK)
#define PWMD_DisableCC8Int()            CLR_REG_BIT(PWMD_IER, PWMDIER_CC8IE_MSK)
#define PWMD_DisableCC7Int()            CLR_REG_BIT(PWMD_IER, PWMDIER_CC7IE_MSK)
#define PWMD_DisableCC6Int()            CLR_REG_BIT(PWMD_IER, PWMDIER_CC6IE_MSK)
#define PWMD_DisableCC5Int()            CLR_REG_BIT(PWMD_IER, PWMDIER_CC5IE_MSK)
#define PWMD_DisableUpdateInt()         CLR_REG_BIT(PWMD_IER, PWMDIER_UIE_MSK)

#define HSPWMD_EnableBreakInt()         SET_HSPWMD_BIT(PWMD_IER, PWMDIER_BIE_MSK)
#define HSPWMD_EnableTriggerInt()       SET_HSPWMD_BIT(PWMD_IER, PWMDIER_TIE_MSK)
#define HSPWMD_EnableCOMInt()           SET_HSPWMD_BIT(PWMD_IER, PWMDIER_COMIE_MSK)
#define HSPWMD_EnableCC8Int()           SET_HSPWMD_BIT(PWMD_IER, PWMDIER_CC8IE_MSK)
#define HSPWMD_EnableCC7Int()           SET_HSPWMD_BIT(PWMD_IER, PWMDIER_CC7IE_MSK)
#define HSPWMD_EnableCC6Int()           SET_HSPWMD_BIT(PWMD_IER, PWMDIER_CC6IE_MSK)
#define HSPWMD_EnableCC5Int()           SET_HSPWMD_BIT(PWMD_IER, PWMDIER_CC5IE_MSK)
#define HSPWMD_EnableUpdateInt()        SET_HSPWMD_BIT(PWMD_IER, PWMDIER_UIE_MSK)
#define HSPWMD_DisableBreakInt()        CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_BIE_MSK)
#define HSPWMD_DisableTriggerInt()      CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_TIE_MSK)
#define HSPWMD_DisableCOMInt()          CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_COMIE_MSK)
#define HSPWMD_DisableCC8Int()          CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_CC8IE_MSK)
#define HSPWMD_DisableCC7Int()          CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_CC7IE_MSK)
#define HSPWMD_DisableCC6Int()          CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_CC6IE_MSK)
#define HSPWMD_DisableCC5Int()          CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_CC5IE_MSK)
#define HSPWMD_DisableUpdateInt()       CLR_HSPWMD_BIT(PWMD_IER, PWMDIER_UIE_MSK)

#define PWMEIER_BIE_MSK                 BIT7
#define PWMEIER_TIE_MSK                 BIT6
#define PWMEIER_COMIE_MSK               BIT5
#define PWMEIER_CC4IE_MSK               BIT4
#define PWMEIER_CC3IE_MSK               BIT3
#define PWMEIER_CC2IE_MSK               BIT2
#define PWMEIER_CC1IE_MSK               BIT1
#define PWMEIER_UIE_MSK                 BIT0
#define PWME_EnableBreakInt()           SET_REG_BIT(PWME_IER, PWMEIER_BIE_MSK)
#define PWME_EnableTriggerInt()         SET_REG_BIT(PWME_IER, PWMEIER_TIE_MSK)
#define PWME_EnableCOMInt()             SET_REG_BIT(PWME_IER, PWMEIER_COMIE_MSK)
#define PWME_EnableCC4Int()             SET_REG_BIT(PWME_IER, PWMEIER_CC4IE_MSK)
#define PWME_EnableCC3Int()             SET_REG_BIT(PWME_IER, PWMEIER_CC3IE_MSK)
#define PWME_EnableCC2Int()             SET_REG_BIT(PWME_IER, PWMEIER_CC2IE_MSK)
#define PWME_EnableCC1Int()             SET_REG_BIT(PWME_IER, PWMEIER_CC1IE_MSK)
#define PWME_EnableUpdateInt()          SET_REG_BIT(PWME_IER, PWMEIER_UIE_MSK)
#define PWME_DisableBreakInt()          CLR_REG_BIT(PWME_IER, PWMEIER_BIE_MSK)
#define PWME_DisableTriggerInt()        CLR_REG_BIT(PWME_IER, PWMEIER_TIE_MSK)
#define PWME_DisableCOMInt()            CLR_REG_BIT(PWME_IER, PWMEIER_COMIE_MSK)
#define PWME_DisableCC4Int()            CLR_REG_BIT(PWME_IER, PWMEIER_CC4IE_MSK)
#define PWME_DisableCC3Int()            CLR_REG_BIT(PWME_IER, PWMEIER_CC3IE_MSK)
#define PWME_DisableCC2Int()            CLR_REG_BIT(PWME_IER, PWMEIER_CC2IE_MSK)
#define PWME_DisableCC1Int()            CLR_REG_BIT(PWME_IER, PWMEIER_CC1IE_MSK)
#define PWME_DisableUpdateInt()         CLR_REG_BIT(PWME_IER, PWMEIER_UIE_MSK)

#define HSPWME_EnableBreakInt()         SET_HSPWME_BIT(PWME_IER, PWMEIER_BIE_MSK)
#define HSPWME_EnableTriggerInt()       SET_HSPWME_BIT(PWME_IER, PWMEIER_TIE_MSK)
#define HSPWME_EnableCOMInt()           SET_HSPWME_BIT(PWME_IER, PWMEIER_COMIE_MSK)
#define HSPWME_EnableCC4Int()           SET_HSPWME_BIT(PWME_IER, PWMEIER_CC4IE_MSK)
#define HSPWME_EnableCC3Int()           SET_HSPWME_BIT(PWME_IER, PWMEIER_CC3IE_MSK)
#define HSPWME_EnableCC2Int()           SET_HSPWME_BIT(PWME_IER, PWMEIER_CC2IE_MSK)
#define HSPWME_EnableCC1Int()           SET_HSPWME_BIT(PWME_IER, PWMEIER_CC1IE_MSK)
#define HSPWME_EnableUpdateInt()        SET_HSPWME_BIT(PWME_IER, PWMEIER_UIE_MSK)
#define HSPWME_DisableBreakInt()        CLR_HSPWME_BIT(PWME_IER, PWMEIER_BIE_MSK)
#define HSPWME_DisableTriggerInt()      CLR_HSPWME_BIT(PWME_IER, PWMEIER_TIE_MSK)
#define HSPWME_DisableCOMInt()          CLR_HSPWME_BIT(PWME_IER, PWMEIER_COMIE_MSK)
#define HSPWME_DisableCC4Int()          CLR_HSPWME_BIT(PWME_IER, PWMEIER_CC4IE_MSK)
#define HSPWME_DisableCC3Int()          CLR_HSPWME_BIT(PWME_IER, PWMEIER_CC3IE_MSK)
#define HSPWME_DisableCC2Int()          CLR_HSPWME_BIT(PWME_IER, PWMEIER_CC2IE_MSK)
#define HSPWME_DisableCC1Int()          CLR_HSPWME_BIT(PWME_IER, PWMEIER_CC1IE_MSK)
#define HSPWME_DisableUpdateInt()       CLR_HSPWME_BIT(PWME_IER, PWMEIER_UIE_MSK)

#define PWMFIER_BIE_MSK                 BIT7
#define PWMFIER_TIE_MSK                 BIT6
#define PWMFIER_COMIE_MSK               BIT5
#define PWMFIER_CC8IE_MSK               BIT4
#define PWMFIER_CC7IE_MSK               BIT3
#define PWMFIER_CC6IE_MSK               BIT2
#define PWMFIER_CC5IE_MSK               BIT1
#define PWMFIER_UIE_MSK                 BIT0
#define PWMF_EnableBreakInt()           SET_REG_BIT(PWMF_IER, PWMFIER_BIE_MSK)
#define PWMF_EnableTriggerInt()         SET_REG_BIT(PWMF_IER, PWMFIER_TIE_MSK)
#define PWMF_EnableCOMInt()             SET_REG_BIT(PWMF_IER, PWMFIER_COMIE_MSK)
#define PWMF_EnableCC8Int()             SET_REG_BIT(PWMF_IER, PWMFIER_CC8IE_MSK)
#define PWMF_EnableCC7Int()             SET_REG_BIT(PWMF_IER, PWMFIER_CC7IE_MSK)
#define PWMF_EnableCC6Int()             SET_REG_BIT(PWMF_IER, PWMFIER_CC6IE_MSK)
#define PWMF_EnableCC5Int()             SET_REG_BIT(PWMF_IER, PWMFIER_CC5IE_MSK)
#define PWMF_EnableUpdateInt()          SET_REG_BIT(PWMF_IER, PWMFIER_UIE_MSK)
#define PWMF_DisableBreakInt()          CLR_REG_BIT(PWMF_IER, PWMFIER_BIE_MSK)
#define PWMF_DisableTriggerInt()        CLR_REG_BIT(PWMF_IER, PWMFIER_TIE_MSK)
#define PWMF_DisableCOMInt()            CLR_REG_BIT(PWMF_IER, PWMFIER_COMIE_MSK)
#define PWMF_DisableCC8Int()            CLR_REG_BIT(PWMF_IER, PWMFIER_CC8IE_MSK)
#define PWMF_DisableCC7Int()            CLR_REG_BIT(PWMF_IER, PWMFIER_CC7IE_MSK)
#define PWMF_DisableCC6Int()            CLR_REG_BIT(PWMF_IER, PWMFIER_CC6IE_MSK)
#define PWMF_DisableCC5Int()            CLR_REG_BIT(PWMF_IER, PWMFIER_CC5IE_MSK)
#define PWMF_DisableUpdateInt()         CLR_REG_BIT(PWMF_IER, PWMFIER_UIE_MSK)

#define HSPWMF_EnableBreakInt()         SET_HSPWMF_BIT(PWMF_IER, PWMFIER_BIE_MSK)
#define HSPWMF_EnableTriggerInt()       SET_HSPWMF_BIT(PWMF_IER, PWMFIER_TIE_MSK)
#define HSPWMF_EnableCOMInt()           SET_HSPWMF_BIT(PWMF_IER, PWMFIER_COMIE_MSK)
#define HSPWMF_EnableCC8Int()           SET_HSPWMF_BIT(PWMF_IER, PWMFIER_CC8IE_MSK)
#define HSPWMF_EnableCC7Int()           SET_HSPWMF_BIT(PWMF_IER, PWMFIER_CC7IE_MSK)
#define HSPWMF_EnableCC6Int()           SET_HSPWMF_BIT(PWMF_IER, PWMFIER_CC6IE_MSK)
#define HSPWMF_EnableCC5Int()           SET_HSPWMF_BIT(PWMF_IER, PWMFIER_CC5IE_MSK)
#define HSPWMF_EnableUpdateInt()        SET_HSPWMF_BIT(PWMF_IER, PWMFIER_UIE_MSK)
#define HSPWMF_DisableBreakInt()        CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_BIE_MSK)
#define HSPWMF_DisableTriggerInt()      CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_TIE_MSK)
#define HSPWMF_DisableCOMInt()          CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_COMIE_MSK)
#define HSPWMF_DisableCC8Int()          CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_CC8IE_MSK)
#define HSPWMF_DisableCC7Int()          CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_CC7IE_MSK)
#define HSPWMF_DisableCC6Int()          CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_CC6IE_MSK)
#define HSPWMF_DisableCC5Int()          CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_CC5IE_MSK)
#define HSPWMF_DisableUpdateInt()       CLR_HSPWMF_BIT(PWMF_IER, PWMFIER_UIE_MSK)

#define PORT_EnableInt(p, b)            SET_REG_BIT(P##p##INTE, (b))
#define PORT_DisableInt(p, b)           CLR_REG_BIT(P##p##INTE, (b))

#define EnableP0nInt(b)                 PORT_EnableInt(0, (b))
#define EnableP1nInt(b)                 PORT_EnableInt(1, (b))
#define EnableP2nInt(b)                 PORT_EnableInt(2, (b))
#define EnableP3nInt(b)                 PORT_EnableInt(3, (b))
#define EnableP4nInt(b)                 PORT_EnableInt(4, (b))
#define EnableP5nInt(b)                 PORT_EnableInt(5, (b))
#define EnableP6nInt(b)                 PORT_EnableInt(6, (b))
#define EnableP7nInt(b)                 PORT_EnableInt(7, (b))
#define EnableP8nInt(b)                 PORT_EnableInt(8, (b))
#define EnableP9nInt(b)                 PORT_EnableInt(9, (b))
#define EnablePAnInt(b)                 PORT_EnableInt(A, (b))
#define EnablePBnInt(b)                 PORT_EnableInt(B, (b))

