fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DisableP0nInt(b)                PORT_DisableInt(0, (b))
#define DisableP1nInt(b)                PORT_DisableInt(1, (b))
#define DisableP2nInt(b)                PORT_DisableInt(2, (b))
#define DisableP3nInt(b)                PORT_DisableInt(3, (b))
#define DisableP4nInt(b)                PORT_DisableInt(4, (b))
#define DisableP5nInt(b)                PORT_DisableInt(5, (b))
#define DisableP6nInt(b)                PORT_DisableInt(6, (b))
#define DisableP7nInt(b)                PORT_DisableInt(7, (b))
#define DisableP8nInt(b)                PORT_DisableInt(8, (b))
#define DisableP9nInt(b)                PORT_DisableInt(9, (b))
#define DisablePAnInt(b)                PORT_DisableInt(A, (b))
#define DisablePBnInt(b)                PORT_DisableInt(B, (b))

#define UR1TOCR_ENTOI_MSK               BIT6
#define UART1_EnableTimeoutInt()        SET_REG_BIT(UR1TOCR, UR1TOCR_ENTOI_MSK)
#define UART1_DisableTimeoutInt()       CLR_REG_BIT(UR1TOCR, UR1TOCR_ENTOI_MSK)

#define UR2TOCR_ENTOI_MSK               BIT6
#define UART2_EnableTimeoutInt()        SET_REG_BIT(UR2TOCR, UR2TOCR_ENTOI_MSK)
#define UART2_DisableTimeoutInt()       CLR_REG_BIT(UR2TOCR, UR2TOCR_ENTOI_MSK)

#define UR3TOCR_ENTOI_MSK               BIT6
#define UART3_EnableTimeoutInt()        SET_REG_BIT(UR3TOCR, UR3TOCR_ENTOI_MSK)
#define UART3_DisableTimeoutInt()       CLR_REG_BIT(UR3TOCR, UR3TOCR_ENTOI_MSK)

#define UR4TOCR_ENTOI_MSK               BIT6
#define UART4_EnableTimeoutInt()        SET_REG_BIT(UR4TOCR, UR4TOCR_ENTOI_MSK)
#define UART4_DisableTimeoutInt()       CLR_REG_BIT(UR4TOCR, UR4TOCR_ENTOI_MSK)

#define UR5TOCR_ENTOI_MSK               BIT6
#define UART5_EnableTimeoutInt()        SET_REG_BIT(UR5TOCR, UR5TOCR_ENTOI_MSK)
#define UART5_DisableTimeoutInt()       CLR_REG_BIT(UR5TOCR, UR5TOCR_ENTOI_MSK)

#define UR6TOCR_ENTOI_MSK               BIT6
#define UART6_EnableTimeoutInt()        SET_REG_BIT(UR6TOCR, UR6TOCR_ENTOI_MSK)
#define UART6_DisableTimeoutInt()       CLR_REG_BIT(UR6TOCR, UR6TOCR_ENTOI_MSK)

#define UR7TOCR_ENTOI_MSK               BIT6
#define UART7_EnableTimeoutInt()        SET_REG_BIT(UR7TOCR, UR7TOCR_ENTOI_MSK)
#define UART7_DisableTimeoutInt()       CLR_REG_BIT(UR7TOCR, UR7TOCR_ENTOI_MSK)

#define UR8TOCR_ENTOI_MSK               BIT6
#define UART8_EnableTimeoutInt()        SET_REG_BIT(UR8TOCR, UR8TOCR_ENTOI_MSK)
#define UART8_DisableTimeoutInt()       CLR_REG_BIT(UR8TOCR, UR8TOCR_ENTOI_MSK)

#define SPITOCR_ENTOI_MSK               BIT6
#define SPI1_EnableTimeoutInt()         SET_REG_BIT(SPITOCR, SPITOCR_ENTOI_MSK)
#define SPI1_DisableTimeoutInt()        CLR_REG_BIT(SPITOCR, SPITOCR_ENTOI_MSK)

#define SPI2TOCR_ENTOI_MSK              BIT6
#define SPI2_EnableTimeoutInt()         SET_REG_BIT(SPI2TOCR, SPI2TOCR_ENTOI_MSK)
#define SPI2_DisableTimeoutInt()        CLR_REG_BIT(SPI2TOCR, SPI2TOCR_ENTOI_MSK)

#define SPI3TOCR_ENTOI_MSK              BIT6
#define SPI3_EnableTimeoutInt()         SET_REG_BIT(SPI3TOCR, SPI3TOCR_ENTOI_MSK)
#define SPI3_DisableTimeoutInt()        CLR_REG_BIT(SPI3TOCR, SPI3TOCR_ENTOI_MSK)

#define I2CTOCR_ENTOI_MSK               BIT6
#define I2C1_EnableTimeoutInt()         SET_REG_BIT(I2CTOCR, I2CTOCR_ENTOI_MSK)
#define I2C1_DisableTimeoutInt()        CLR_REG_BIT(I2CTOCR, I2CTOCR_ENTOI_MSK)

#define I2C2TOCR_ENTOI_MSK              BIT6
#define I2C2_EnableTimeoutInt()         SET_REG_BIT(I2C2TOCR, I2C2TOCR_ENTOI_MSK)
#define I2C2_DisableTimeoutInt()        CLR_REG_BIT(I2C2TOCR, I2C2TOCR_ENTOI_MSK)

#define I2SCR_TXEIE_MSK                 BIT7
#define I2SCR_RXNEIE_MSK                BIT6
#define I2SCR_ERRIE_MSK                 BIT5
#define I2S1_EnableTXEInt()             SET_REG_BIT(I2SCR, I2SCR_TXEIE_MSK)
#define I2S1_EnableRXNEInt()            SET_REG_BIT(I2SCR, I2SCR_RXNEIE_MSK)
#define I2S1_EnableErrorInt()           SET_REG_BIT(I2SCR, I2SCR_ERRIE_MSK)
#define I2S1_DisableTXEInt()            CLR_REG_BIT(I2SCR, I2SCR_TXEIE_MSK)
#define I2S1_DisableRXNEInt()           CLR_REG_BIT(I2SCR, I2SCR_RXNEIE_MSK)
#define I2S1_DisableErrorInt()          CLR_REG_BIT(I2SCR, I2SCR_ERRIE_MSK)

#define I2S2CR_TXEIE_MSK                BIT7
#define I2S2CR_RXNEIE_MSK               BIT6
#define I2S2CR_ERRIE_MSK                BIT5
#define I2S2_EnableTXEInt()             SET_REG_BIT(I2S2CR, I2S2CR_TXEIE_MSK)
#define I2S2_EnableRXNEInt()            SET_REG_BIT(I2S2CR, I2S2CR_RXNEIE_MSK)
#define I2S2_EnableErrorInt()           SET_REG_BIT(I2S2CR, I2S2CR_ERRIE_MSK)
#define I2S2_DisableTXEInt()            CLR_REG_BIT(I2S2CR, I2S2CR_TXEIE_MSK)
#define I2S2_DisableRXNEInt()           CLR_REG_BIT(I2S2CR, I2S2CR_RXNEIE_MSK)
#define I2S2_DisableErrorInt()          CLR_REG_BIT(I2S2CR, I2S2CR_ERRIE_MSK)

#define QSPICR3_SMIE_MSK                BIT3
#define QSPICR3_FTIE_MSK                BIT2
#define QSPICR3_TCIE_MSK                BIT1
#define QSPICR3_TEIE_MSK                BIT0
#define QSPI_EnableMatchInt()           SET_REG_BIT(QSPI_CR3, QSPICR3_SMIE_MSK)
#define QSPI_EnableFIFOInt()            SET_REG_BIT(QSPI_CR3, QSPICR3_FTIE_MSK)
#define QSPI_EnableTransferInt()        SET_REG_BIT(QSPI_CR3, QSPICR3_TCIE_MSK)
#define QSPI_EnableErrorInt()           SET_REG_BIT(QSPI_CR3, QSPICR3_TEIE_MSK)
#define QSPI_DisableMatchInt()          CLR_REG_BIT(QSPI_CR3, QSPICR3_SMIE_MSK)
#define QSPI_DisableFIFOInt()           CLR_REG_BIT(QSPI_CR3, QSPICR3_FTIE_MSK)
#define QSPI_DisableTransferInt()       CLR_REG_BIT(QSPI_CR3, QSPICR3_TCIE_MSK)
#define QSPI_DisableErrorInt()          CLR_REG_BIT(QSPI_CR3, QSPICR3_TEIE_MSK)

#define DMAM2MCFG_M2MIE_MSK             BIT7
#define DMAADCCFG_ADCIE_MSK             BIT7
#define DMAADC2CFG_ADC2IE_MSK           BIT7
#define DMADAC1CFG_DAC1IE_MSK           BIT7
#define DMADAC2CFG_DAC2IE_MSK           BIT7
#define DMASPICFG_SPIIE_MSK             BIT7
#define DMASPI2CFG_SPI2IE_MSK           BIT7
#define DMASPI3CFG_SPI3IE_MSK           BIT7
#define DMAQSPICFG_QSPIIE_MSK           BIT7
#define DMALCMCFG_LCMIE_MSK             BIT7
#define DMAUR1TCFG_UR1TIE_MSK           BIT7
#define DMAUR1RCFG_UR1RIE_MSK           BIT7
#define DMAUR2TCFG_UR2TIE_MSK           BIT7
#define DMAUR2RCFG_UR2RIE_MSK           BIT7
#define DMAUR3TCFG_UR3TIE_MSK           BIT7
#define DMAUR3RCFG_UR3RIE_MSK           BIT7
#define DMAUR4TCFG_UR4TIE_MSK           BIT7
#define DMAUR4RCFG_UR4RIE_MSK           BIT7
#define DMAUR5TCFG_UR5TIE_MSK           BIT7
#define DMAUR5RCFG_UR5RIE_MSK           BIT7
#define DMAUR6TCFG_UR6TIE_MSK           BIT7
#define DMAUR6RCFG_UR6RIE_MSK           BIT7
#define DMAUR7TCFG_UR7TIE_MSK           BIT7
#define DMAUR7RCFG_UR7RIE_MSK           BIT7
#define DMAUR8TCFG_UR8TIE_MSK           BIT7
#define DMAUR8RCFG_UR8RIE_MSK           BIT7
#define DMAI2CTCFG_I2CTIE_MSK           BIT7
#define DMAI2CRCFG_I2CRIE_MSK           BIT7
#define DMAI2C2TCFG_I2C2TIE_MSK         BIT7
#define DMAI2C2RCFG_I2C2RIE_MSK         BIT7
#define DMAI2STCFG_I2STIE_MSK           BIT7
#define DMAI2SRCFG_I2SRIE_MSK           BIT7
#define DMAI2S2TCFG_I2S2TIE_MSK         BIT7
#define DMAI2S2RCFG_I2S2RIE_MSK         BIT7
#define DMAPWMATCFG_PWMATIE_MSK         BIT7
#define DMAPWMARCFG_PWMARIE_MSK         BIT7
#define DMAPWMCTCFG_PWMCTIE_MSK         BIT7
#define DMAPWMCRCFG_PWMCRIE_MSK         BIT7
#define DMAPWMETCFG_PWMETIE_MSK         BIT7
#define DMAPWMERCFG_PWMERIE_MSK         BIT7
#define DMACAN1TCFG_CAN1TIE_MSK         BIT7
#define DMACAN1RCFG_CAN1RIE_MSK         BIT7
#define DMACAN2TCFG_CAN2TIE_MSK         BIT7
#define DMACAN2RCFG_CAN2RIE_MSK         BIT7
#define DMA_M2M_EnableInt()             SET_REG_BIT(DMA_M2M_CFG,   DMAM2MCFG_M2MIE_MSK)
#define DMA_ADC1_EnableInt()            SET_REG_BIT(DMA_ADC_CFG,   DMAADCCFG_ADCIE_MSK)
#define DMA_ADC2_EnableInt()            SET_REG_BIT(DMA_ADC2_CFG,  DMAADC2CFG_ADC2IE_MSK)
#define DMA_DAC1_EnableInt()            SET_REG_BIT(DMA_DAC1_CFG,  DMADAC1CFG_DAC1IE_MSK)
#define DMA_DAC2_EnableInt()            SET_REG_BIT(DMA_DAC2_CFG,  DMADAC2CFG_DAC2IE_MSK)
#define DMA_SPI1_EnableInt()            SET_REG_BIT(DMA_SPI_CFG,   DMASPICFG_SPIIE_MSK)
#define DMA_SPI2_EnableInt()            SET_REG_BIT(DMA_SPI2_CFG,  DMASPI2CFG_SPI2IE_MSK)
#define DMA_SPI3_EnableInt()            SET_REG_BIT(DMA_SPI3_CFG,  DMASPI3CFG_SPI3IE_MSK)
#define DMA_QSPI_EnableInt()            SET_REG_BIT(DMA_QSPI_CFG,  DMAQSPICFG_QSPIIE_MSK)
#define DMA_LCM_EnableInt()             SET_REG_BIT(DMA_LCM_CFG,   DMALCMCFG_LCMIE_MSK)
#define DMA_UART1_EnableTxInt()         SET_REG_BIT(DMA_UR1T_CFG,  DMAUR1TCFG_UR1TIE_MSK)
#define DMA_UART1_EnableRxInt()         SET_REG_BIT(DMA_UR1R_CFG,  DMAUR1RCFG_UR1RIE_MSK)
#define DMA_UART2_EnableTxInt()         SET_REG_BIT(DMA_UR2T_CFG,  DMAUR2TCFG_UR2TIE_MSK)
#define DMA_UART2_EnableRxInt()         SET_REG_BIT(DMA_UR2R_CFG,  DMAUR2RCFG_UR2RIE_MSK)
#define DMA_UART3_EnableTxInt()         SET_REG_BIT(DMA_UR3T_CFG,  DMAUR3TCFG_UR3TIE_MSK)
#define DMA_UART3_EnableRxInt()         SET_REG_BIT(DMA_UR3R_CFG,  DMAUR3RCFG_UR3RIE_MSK)
#define DMA_UART4_EnableTxInt()         SET_REG_BIT(DMA_UR4T_CFG,  DMAUR4TCFG_UR4TIE_MSK)
#define DMA_UART4_EnableRxInt()         SET_REG_BIT(DMA_UR4R_CFG,  DMAUR4RCFG_UR4RIE_MSK)
#define DMA_UART5_EnableTxInt()         SET_REG_BIT(DMA_UR5T_CFG,  DMAUR5TCFG_UR5TIE_MSK)
#define DMA_UART5_EnableRxInt()         SET_REG_BIT(DMA_UR5R_CFG,  DMAUR5RCFG_UR5RIE_MSK)
#define DMA_UART6_EnableTxInt()         SET_REG_BIT(DMA_UR6T_CFG,  DMAUR6TCFG_UR6TIE_MSK)
#define DMA_UART6_EnableRxInt()         SET_REG_BIT(DMA_UR6R_CFG,  DMAUR6RCFG_UR6RIE_MSK)
#define DMA_UART7_EnableTxInt()         SET_REG_BIT(DMA_UR7T_CFG,  DMAUR7TCFG_UR7TIE_MSK)
#define DMA_UART7_EnableRxInt()         SET_REG_BIT(DMA_UR7R_CFG,  DMAUR7RCFG_UR7RIE_MSK)
#define DMA_UART8_EnableTxInt()         SET_REG_BIT(DMA_UR8T_CFG,  DMAUR8TCFG_UR8TIE_MSK)
#define DMA_UART8_EnableRxInt()         SET_REG_BIT(DMA_UR8R_CFG,  DMAUR8RCFG_UR8RIE_MSK)
#define DMA_I2C1_EnableTxInt()          SET_REG_BIT(DMA_I2CT_CFG,  DMAI2CTCFG_I2CTIE_MSK)
#define DMA_I2C1_EnableRxInt()          SET_REG_BIT(DMA_I2CR_CFG,  DMAI2CRCFG_I2CRIE_MSK)
#define DMA_I2C2_EnableTxInt()          SET_REG_BIT(DMA_I2C2T_CFG, DMAI2C2TCFG_I2C2TIE_MSK)
#define DMA_I2C2_EnableRxInt()          SET_REG_BIT(DMA_I2C2R_CFG, DMAI2C2RCFG_I2C2RIE_MSK)
#define DMA_I2S1_EnableTxInt()          SET_REG_BIT(DMA_I2ST_CFG,  DMAI2STCFG_I2STIE_MSK)
#define DMA_I2S1_EnableRxInt()          SET_REG_BIT(DMA_I2SR_CFG,  DMAI2SRCFG_I2SRIE_MSK)
#define DMA_I2S2_EnableTxInt()          SET_REG_BIT(DMA_I2S2T_CFG, DMAI2S2TCFG_I2S2TIE_MSK)
#define DMA_I2S2_EnableRxInt()          SET_REG_BIT(DMA_I2S2R_CFG, DMAI2S2RCFG_I2S2RIE_MSK)
#define DMA_PWMA_EnableTxInt()          SET_REG_BIT(DMA_PWMAT_CFG, DMAPWMATCFG_PWMATIE_MSK)
#define DMA_PWMA_EnableRxInt()          SET_REG_BIT(DMA_PWMAR_CFG, DMAPWMARCFG_PWMARIE_MSK)
#define DMA_PWMC_EnableTxInt()          SET_REG_BIT(DMA_PWMCT_CFG, DMAPWMCTCFG_PWMCTIE_MSK)
#define DMA_PWMC_EnableRxInt()          SET_REG_BIT(DMA_PWMCR_CFG, DMAPWMCRCFG_PWMCRIE_MSK)
#define DMA_PWME_EnableTxInt()          SET_REG_BIT(DMA_PWMET_CFG, DMAPWMETCFG_PWMETIE_MSK)
#define DMA_PWME_EnableRxInt()          SET_REG_BIT(DMA_PWMER_CFG, DMAPWMERCFG_PWMERIE_MSK)
#define DMA_CAN1_EnableTxInt()          SET_REG_BIT(DMA_CAN1T_CFG, DMACAN1TCFG_CAN1TIE_MSK)
#define DMA_CAN1_EnableRxInt()          SET_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_CAN1RIE_MSK)
#define DMA_CAN2_EnableTxInt()          SET_REG_BIT(DMA_CAN2T_CFG, DMACAN2TCFG_CAN2TIE_MSK)
#define DMA_CAN2_EnableRxInt()          SET_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_CAN2RIE_MSK)
#define DMA_M2M_DisableInt()            CLR_REG_BIT(DMA_M2M_CFG,   DMAM2MCFG_M2MIE_MSK)
#define DMA_ADC1_DisableInt()           CLR_REG_BIT(DMA_ADC_CFG,   DMAADCCFG_ADCIE_MSK)
#define DMA_ADC2_DisableInt()           CLR_REG_BIT(DMA_ADC2_CFG,  DMAADC2CFG_ADC2IE_MSK)
#define DMA_DAC1_DisableInt()           CLR_REG_BIT(DMA_DAC1_CFG,  DMADAC1CFG_DAC1IE_MSK)
#define DMA_DAC2_DisableInt()           CLR_REG_BIT(DMA_DAC2_CFG,  DMADAC2CFG_DAC2IE_MSK)
#define DMA_SPI1_DisableInt()           CLR_REG_BIT(DMA_SPI_CFG,   DMASPICFG_SPIIE_MSK)
#define DMA_SPI2_DisableInt()           CLR_REG_BIT(DMA_SPI2_CFG,  DMASPI2CFG_SPI2IE_MSK)
#define DMA_SPI3_DisableInt()           CLR_REG_BIT(DMA_SPI3_CFG,  DMASPI3CFG_SPI3IE_MSK)
#define DMA_QSPI_DisableInt()           CLR_REG_BIT(DMA_QSPI_CFG,  DMAQSPICFG_QSPIIE_MSK)
#define DMA_LCM_DisableInt()            CLR_REG_BIT(DMA_LCM_CFG,   DMALCMCFG_LCMIE_MSK)
#define DMA_UART1_DisableTxInt()        CLR_REG_BIT(DMA_UR1T_CFG,  DMAUR1TCFG_UR1TIE_MSK)
#define DMA_UART1_DisableRxInt()        CLR_REG_BIT(DMA_UR1R_CFG,  DMAUR1RCFG_UR1RIE_MSK)
#define DMA_UART2_DisableTxInt()        CLR_REG_BIT(DMA_UR2T_CFG,  DMAUR2TCFG_UR2TIE_MSK)
#define DMA_UART2_DisableRxInt()        CLR_REG_BIT(DMA_UR2R_CFG,  DMAUR2RCFG_UR2RIE_MSK)
#define DMA_UART3_DisableTxInt()        CLR_REG_BIT(DMA_UR3T_CFG,  DMAUR3TCFG_UR3TIE_MSK)
#define DMA_UART3_DisableRxInt()        CLR_REG_BIT(DMA_UR3R_CFG,  DMAUR3RCFG_UR3RIE_MSK)
#define DMA_UART4_DisableTxInt()        CLR_REG_BIT(DMA_UR4T_CFG,  DMAUR4TCFG_UR4TIE_MSK)
#define DMA_UART4_DisableRxInt()        CLR_REG_BIT(DMA_UR4R_CFG,  DMAUR4RCFG_UR4RIE_MSK)
#define DMA_UART5_DisableTxInt()        CLR_REG_BIT(DMA_UR5T_CFG,  DMAUR5TCFG_UR5TIE_MSK)
#define DMA_UART5_DisableRxInt()        CLR_REG_BIT(DMA_UR5R_CFG,  DMAUR5RCFG_UR5RIE_MSK)
#define DMA_UART6_DisableTxInt()        CLR_REG_BIT(DMA_UR6T_CFG,  DMAUR6TCFG_UR6TIE_MSK)
#define DMA_UART6_DisableRxInt()        CLR_REG_BIT(DMA_UR6R_CFG,  DMAUR6RCFG_UR6RIE_MSK)
#define DMA_UART7_DisableTxInt()        CLR_REG_BIT(DMA_UR7T_CFG,  DMAUR7TCFG_UR7TIE_MSK)
#define DMA_UART7_DisableRxInt()        CLR_REG_BIT(DMA_UR7R_CFG,  DMAUR7RCFG_UR7RIE_MSK)
#define DMA_UART8_DisableTxInt()        CLR_REG_BIT(DMA_UR8T_CFG,  DMAUR8TCFG_UR8TIE_MSK)
#define DMA_UART8_DisableRxInt()        CLR_REG_BIT(DMA_UR8R_CFG,  DMAUR8RCFG_UR8RIE_MSK)
#define DMA_I2C1_DisableTxInt()         CLR_REG_BIT(DMA_I2CT_CFG,  DMAI2CTCFG_I2CTIE_MSK)
#define DMA_I2C1_DisableRxInt()         CLR_REG_BIT(DMA_I2CR_CFG,  DMAI2CRCFG_I2CRIE_MSK)
#define DMA_I2C2_DisableTxInt()         CLR_REG_BIT(DMA_I2C2T_CFG, DMAI2C2TCFG_I2C2TIE_MSK)
#define DMA_I2C2_DisableRxInt()         CLR_REG_BIT(DMA_I2C2R_CFG, DMAI2C2RCFG_I2C2RIE_MSK)
#define DMA_I2S1_DisableTxInt()         CLR_REG_BIT(DMA_I2ST_CFG,  DMAI2STCFG_I2STIE_MSK)
#define DMA_I2S1_DisableRxInt()         CLR_REG_BIT(DMA_I2SR_CFG,  DMAI2SRCFG_I2SRIE_MSK)
#define DMA_I2S2_DisableTxInt()         CLR_REG_BIT(DMA_I2S2T_CFG, DMAI2S2TCFG_I2S2TIE_MSK)
#define DMA_I2S2_DisableRxInt()         CLR_REG_BIT(DMA_I2S2R_CFG, DMAI2S2RCFG_I2S2RIE_MSK)
#define DMA_PWMA_DisableTxInt()         CLR_REG_BIT(DMA_PWMAT_CFG, DMAPWMATCFG_PWMATIE_MSK)
#define DMA_PWMA_DisableRxInt()         CLR_REG_BIT(DMA_PWMAR_CFG, DMAPWMARCFG_PWMARIE_MSK)
#define DMA_PWMC_DisableTxInt()         CLR_REG_BIT(DMA_PWMCT_CFG, DMAPWMCTCFG_PWMCTIE_MSK)
#define DMA_PWMC_DisableRxInt()         CLR_REG_BIT(DMA_PWMCR_CFG, DMAPWMCRCFG_PWMCRIE_MSK)
#define DMA_PWME_DisableTxInt()         CLR_REG_BIT(DMA_PWMET_CFG, DMAPWMETCFG_PWMETIE_MSK)
#define DMA_PWME_DisableRxInt()         CLR_REG_BIT(DMA_PWMER_CFG, DMAPWMERCFG_PWMERIE_MSK)
#define DMA_CAN1_DisableTxInt()         CLR_REG_BIT(DMA_CAN1T_CFG, DMACAN1TCFG_CAN1TIE_MSK)
#define DMA_CAN1_DisableRxInt()         CLR_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_CAN1RIE_MSK)
#define DMA_CAN2_DisableTxInt()         CLR_REG_BIT(DMA_CAN2T_CFG, DMACAN2TCFG_CAN2TIE_MSK)
#define DMA_CAN2_DisableRxInt()         CLR_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_CAN2RIE_MSK)

#define INT0_FallingRisingInt()         (IT0 = 0)
#define INT0_FallingInt()               (IT0 = 1)

#define INT0_CheckFlag()                (IE0)
#define INT0_ClearFlag()                (IE0 = 0)

#define INT1_FallingRisingInt()         (IT1 = 0)
#define INT1_FallingInt()               (IT1 = 1)

