fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define INT1_CheckFlag()                (IE1)
#define INT1_ClearFlag()                (IE1 = 0)

#define AUXINTIF_INT2IF_MSK             BIT4
#define INT2_CheckFlag()                READ_REG_BIT(AUXINTIF, AUXINTIF_INT2IF_MSK)
#define INT2_ClearFlag()                CLR_REG_BIT(AUXINTIF, AUXINTIF_INT2IF_MSK)

#define AUXINTIF_INT3IF_MSK             BIT5
#define INT3_CheckFlag()                READ_REG_BIT(AUXINTIF, AUXINTIF_INT3IF_MSK)
#define INT3_ClearFlag()                CLR_REG_BIT(AUXINTIF, AUXINTIF_INT3IF_MSK)

#define AUXINTIF_INT4IF_MSK             BIT6
#define INT4_CheckFlag()                READ_REG_BIT(AUXINTIF, AUXINTIF_INT4IF_MSK)
#define INT4_ClearFlag()                CLR_REG_BIT(AUXINTIF, AUXINTIF_INT4IF_MSK)

#define TIMER0_CheckFlag()              (TF0)
#define TIMER0_ClearFlag()              (TF0 = 0)

#define TIMER1_CheckFlag()              (TF1)
#define TIMER1_ClearFlag()              (TF1 = 0)

#define AUXINTIF_T2IF_MSK               BIT0
#define TIMER2_CheckFlag()              READ_REG_BIT(AUXINTIF, AUXINTIF_T2IF_MSK)
#define TIMER2_ClearFlag()              CLR_REG_BIT(AUXINTIF, AUXINTIF_T2IF_MSK)

#define AUXINTIF_T3IF_MSK               BIT1
#define TIMER3_CheckFlag()              READ_REG_BIT(AUXINTIF, AUXINTIF_T3IF_MSK)
#define TIMER3_ClearFlag()              CLR_REG_BIT(AUXINTIF, AUXINTIF_T3IF_MSK)

#define AUXINTIF_T4IF_MSK               BIT2
#define TIMER4_CheckFlag()              READ_REG_BIT(AUXINTIF, AUXINTIF_T4IF_MSK)
#define TIMER4_ClearFlag()              CLR_REG_BIT(AUXINTIF, AUXINTIF_T4IF_MSK)

#define T6T5CFG_T5IF_MSK                BIT3
#define TIMER5_CheckFlag()              READ_REG_BIT(T6T5CFG, T6T5CFG_T5IF_MSK)
#define TIMER5_ClearFlag()              CLR_REG_BIT(T6T5CFG, T6T5CFG_T5IF_MSK)

#define T6T5CFG_T6IF_MSK                BIT7
#define TIMER6_CheckFlag()              READ_REG_BIT(T6T5CFG, T6T5CFG_T6IF_MSK)
#define TIMER6_ClearFlag()              CLR_REG_BIT(T6T5CFG, T6T5CFG_T6IF_MSK)

#define T8T7CFG_T7IF_MSK                BIT3
#define TIMER7_CheckFlag()              READ_REG_BIT(T8T7CFG, T8T7CFG_T7IF_MSK)
#define TIMER7_ClearFlag()              CLR_REG_BIT(T8T7CFG, T8T7CFG_T7IF_MSK)

#define T8T7CFG_T8IF_MSK                BIT7
#define TIMER8_CheckFlag()              READ_REG_BIT(T8T7CFG, T8T7CFG_T8IF_MSK)
#define TIMER8_ClearFlag()              CLR_REG_BIT(T8T7CFG, T8T7CFG_T8IF_MSK)

#define T10T9CFG_T9IF_MSK               BIT3
#define TIMER9_CheckFlag()              READ_REG_BIT(T10T9CFG, T10T9CFG_T9IF_MSK)
#define TIMER9_ClearFlag()              CLR_REG_BIT(T10T9CFG, T10T9CFG_T9IF_MSK)

#define T10T9CFG_T10IF_MSK              BIT7
#define TIMER10_CheckFlag()             READ_REG_BIT(T10T9CFG, T10T9CFG_T10IF_MSK)
#define TIMER10_ClearFlag()             CLR_REG_BIT(T10T9CFG, T10T9CFG_T10IF_MSK)

#define T11CR_T11IF_MSK                 BIT0
#define TIMER11_CheckFlag()             READ_REG_BIT(T11CR, T11CR_T11IF_MSK)
#define TIMER11_ClearFlag()             CLR_REG_BIT(T11CR, T11CR_T11IF_MSK)

#define T18T17CFG_T17IF_MSK             BIT3
#define TIMER17_CheckFlag()             READ_REG_BIT(T18T17CFG, T18T17CFG_T17IF_MSK)
#define TIMER17_ClearFlag()             CLR_REG_BIT(T18T17CFG, T18T17CFG_T17IF_MSK)

#define T18T17CFG_T18IF_MSK             BIT7
#define TIMER18_CheckFlag()             READ_REG_BIT(T18T17CFG, T18T17CFG_T18IF_MSK)
#define TIMER18_ClearFlag()             CLR_REG_BIT(T18T17CFG, T18T17CFG_T18IF_MSK)

#define UART1_CheckRxFlag()             (RI)
#define UART1_CheckTxFlag()             (TI)
#define UART1_ClearRxFlag()             (RI = 0)
#define UART1_ClearTxFlag()             (TI = 0)
#define UART1_SetRxFlag()               (RI = 1)
#define UART1_SetTxFlag()               (TI = 1)

#define S2CON_S2TI_MSK                  BIT1
#define S2CON_S2RI_MSK                  BIT0
#define UART2_CheckRxFlag()             READ_REG_BIT(S2CON, S2CON_S2RI_MSK)
#define UART2_CheckTxFlag()             READ_REG_BIT(S2CON, S2CON_S2TI_MSK)
#define UART2_ClearRxFlag()             CLR_REG_BIT(S2CON, S2CON_S2RI_MSK)
#define UART2_ClearTxFlag()             CLR_REG_BIT(S2CON, S2CON_S2TI_MSK)
#define UART2_SetRxFlag()               SET_REG_BIT(S2CON, S2CON_S2RI_MSK)
#define UART2_SetTxFlag()               SET_REG_BIT(S2CON, S2CON_S2TI_MSK)

#define S3CON_S3TI_MSK                  BIT1
#define S3CON_S3RI_MSK                  BIT0
#define UART3_CheckRxFlag()             READ_REG_BIT(S3CON, S3CON_S3RI_MSK)
#define UART3_CheckTxFlag()             READ_REG_BIT(S3CON, S3CON_S3TI_MSK)
#define UART3_ClearRxFlag()             CLR_REG_BIT(S3CON, S3CON_S3RI_MSK)
#define UART3_ClearTxFlag()             CLR_REG_BIT(S3CON, S3CON_S3TI_MSK)
#define UART3_SetRxFlag()               SET_REG_BIT(S3CON, S3CON_S3RI_MSK)
#define UART3_SetTxFlag()               SET_REG_BIT(S3CON, S3CON_S3TI_MSK)

#define S4CON_S4TI_MSK                  BIT1
#define S4CON_S4RI_MSK                  BIT0
#define UART4_CheckRxFlag()             READ_REG_BIT(S4CON, S4CON_S4RI_MSK)
#define UART4_CheckTxFlag()             READ_REG_BIT(S4CON, S4CON_S4TI_MSK)
#define UART4_ClearRxFlag()             CLR_REG_BIT(S4CON, S4CON_S4RI_MSK)
#define UART4_ClearTxFlag()             CLR_REG_BIT(S4CON, S4CON_S4TI_MSK)
#define UART4_SetRxFlag()               SET_REG_BIT(S4CON, S4CON_S4RI_MSK)
#define UART4_SetTxFlag()               SET_REG_BIT(S4CON, S4CON_S4TI_MSK)

#define S5CON_S5TI_MSK                  BIT1
#define S5CON_S5RI_MSK                  BIT0
#define UART5_CheckRxFlag()             READ_REG_BIT(S5CON, S5CON_S5RI_MSK)
#define UART5_CheckTxFlag()             READ_REG_BIT(S5CON, S5CON_S5TI_MSK)
#define UART5_ClearRxFlag()             CLR_REG_BIT(S5CON, S5CON_S5RI_MSK)
#define UART5_ClearTxFlag()             CLR_REG_BIT(S5CON, S5CON_S5TI_MSK)
#define UART5_SetRxFlag()               SET_REG_BIT(S5CON, S5CON_S5RI_MSK)
#define UART5_SetTxFlag()               SET_REG_BIT(S5CON, S5CON_S5TI_MSK)

#define S6CON_S6TI_MSK                  BIT1
#define S6CON_S6RI_MSK                  BIT0
#define UART6_CheckRxFlag()             READ_REG_BIT(S6CON, S6CON_S6RI_MSK)
#define UART6_CheckTxFlag()             READ_REG_BIT(S6CON, S6CON_S6TI_MSK)
#define UART6_ClearRxFlag()             CLR_REG_BIT(S6CON, S6CON_S6RI_MSK)
#define UART6_ClearTxFlag()             CLR_REG_BIT(S6CON, S6CON_S6TI_MSK)
#define UART6_SetRxFlag()               SET_REG_BIT(S6CON, S6CON_S6RI_MSK)
#define UART6_SetTxFlag()               SET_REG_BIT(S6CON, S6CON_S6TI_MSK)

#define S7CON_S7TI_MSK                  BIT1
#define S7CON_S7RI_MSK                  BIT0
#define UART7_CheckRxFlag()             READ_REG_BIT(S7CON, S7CON_S7RI_MSK)
#define UART7_CheckTxFlag()             READ_REG_BIT(S7CON, S7CON_S7TI_MSK)
#define UART7_ClearRxFlag()             CLR_REG_BIT(S7CON, S7CON_S7RI_MSK)
#define UART7_ClearTxFlag()             CLR_REG_BIT(S7CON, S7CON_S7TI_MSK)
#define UART7_SetRxFlag()               SET_REG_BIT(S7CON, S7CON_S7RI_MSK)
#define UART7_SetTxFlag()               SET_REG_BIT(S7CON, S7CON_S7TI_MSK)

#define S8CON_S8TI_MSK                  BIT1
#define S8CON_S8RI_MSK                  BIT0
#define UART8_CheckRxFlag()             READ_REG_BIT(S8CON, S8CON_S8RI_MSK)
#define UART8_CheckTxFlag()             READ_REG_BIT(S8CON, S8CON_S8TI_MSK)
#define UART8_ClearRxFlag()             CLR_REG_BIT(S8CON, S8CON_S8RI_MSK)
#define UART8_ClearTxFlag()             CLR_REG_BIT(S8CON, S8CON_S8TI_MSK)
#define UART8_SetRxFlag()               SET_REG_BIT(S8CON, S8CON_S8RI_MSK)
#define UART8_SetTxFlag()               SET_REG_BIT(S8CON, S8CON_S8TI_MSK)

#define PCON_LVDF_MSK                   BIT5
#define LVD_CheckFlag()                 READ_REG_BIT(PCON, PCON_LVDF_MSK)
#define LVD_ClearFlag()                 CLR_REG_BIT(PCON, PCON_LVDF_MSK)

#define ADCCONTR_ADCFLAG_MSK            BIT5
#define ADC1_CheckFlag()                READ_REG_BIT(ADC_CONTR, ADCCONTR_ADCFLAG_MSK)
#define ADC1_ClearFlag()                CLR_REG_BIT(ADC_CONTR, ADCCONTR_ADCFLAG_MSK)

#define ADC2CONTR_ADC2FLAG_MSK          BIT5
#define ADC2_CheckFlag()                READ_REG_BIT(ADC2_CONTR, ADC2CONTR_ADC2FLAG_MSK)
#define ADC2_ClearFlag()                CLR_REG_BIT(ADC2_CONTR, ADC2CONTR_ADC2FLAG_MSK)

