fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DAC1STA_DAC1IF_MSK              BIT0
#define DAC1_CheckFlag()                READ_REG_BIT(DAC1_STA, DAC1STA_DAC1IF_MSK)
#define DAC1_ClearFlag()                CLR_REG_BIT(DAC1_STA, DAC1STA_DAC1IF_MSK)

#define DAC2STA_DAC2IF_MSK              BIT0
#define DAC2_CheckFlag()                READ_REG_BIT(DAC2_STA, DAC2STA_DAC2IF_MSK)
#define DAC2_ClearFlag()                CLR_REG_BIT(DAC2_STA, DAC2STA_DAC2IF_MSK)

#define SPSTAT_SPIF_MSK                 BIT7
#define SPSTAT_WCOL_MSK                 BIT6
#define SPI1_CheckFlag()                READ_REG_BIT(SPSTAT, SPSTAT_SPIF_MSK)
#define SPI1_ClearFlag()                SET_REG_BIT(SPSTAT, SPSTAT_SPIF_MSK | SPSTAT_WCOL_MSK)

#define SPI2STAT_SP2IF_MSK              BIT7
#define SPI2STAT_WCOL2_MSK              BIT6
#define SPI2_CheckFlag()                READ_REG_BIT(SPI2STAT, SPI2STAT_SP2IF_MSK)
#define SPI2_ClearFlag()                SET_REG_BIT(SPI2STAT, SPI2STAT_SP2IF_MSK | SPI2STAT_WCOL2_MSK)

#define SPI3STAT_SP3IF_MSK              BIT7
#define SPI3STAT_WCOL3_MSK              BIT6
#define SPI3_CheckFlag()                READ_REG_BIT(SPI3STAT, SPI3STAT_SP3IF_MSK)
#define SPI3_ClearFlag()                SET_REG_BIT(SPI3STAT, SPI3STAT_SP3IF_MSK | SPI3STAT_WCOL3_MSK)

#define CMP1CR1_CMPIF_MSK               BIT6
#define CMP1_CheckFlag()                READ_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_CMPIF_MSK)
#define CMP1_ClearFlag()                CLR_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_CMPIF_MSK)

#define CMP2CR1_CMPIF_MSK               BIT6
#define CMP2_CheckFlag()                READ_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_CMPIF_MSK)
#define CMP2_ClearFlag()                CLR_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_CMPIF_MSK)

#define CMP3CR1_CMPIF_MSK               BIT6
#define CMP3_CheckFlag()                READ_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_CMPIF_MSK)
#define CMP3_ClearFlag()                CLR_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_CMPIF_MSK)

#define CMP4CR1_CMPIF_MSK               BIT6
#define CMP4_CheckFlag()                READ_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_CMPIF_MSK)
#define CMP4_ClearFlag()                CLR_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_CMPIF_MSK)

#define RTCIF_ALARM_MSK                 BIT7
#define RTCIF_DAY_MSK                   BIT6
#define RTCIF_HOUR_MSK                  BIT5
#define RTCIF_MIN_MSK                   BIT4
#define RTCIF_SEC_MSK                   BIT3
#define RTCIF_SEC2_MSK                  BIT2
#define RTCIF_SEC8_MSK                  BIT1
#define RTCIF_SEC32_MSK                 BIT0
#define RTC_CheckAlarmFlag()            READ_REG_BIT(RTCIF, RTCIF_ALARM_MSK)
#define RTC_CheckDayFlag()              READ_REG_BIT(RTCIF, RTCIF_DAY_MSK)
#define RTC_CheckHourFlag()             READ_REG_BIT(RTCIF, RTCIF_HOUR_MSK)
#define RTC_CheckMinuteFlag()           READ_REG_BIT(RTCIF, RTCIF_MIN_MSK)
#define RTC_CheckSecondFlag()           READ_REG_BIT(RTCIF, RTCIF_SEC_MSK)
#define RTC_CheckSecondD2Flag()         READ_REG_BIT(RTCIF, RTCIF_SEC2_MSK)
#define RTC_CheckSecondD8Flag()         READ_REG_BIT(RTCIF, RTCIF_SEC8_MSK)
#define RTC_CheckSecondD32Flag()        READ_REG_BIT(RTCIF, RTCIF_SEC32_MSK)
#define RTC_ClearAlarmFlag()            CLR_REG_BIT(RTCIF, RTCIF_ALARM_MSK)
#define RTC_ClearDayFlag()              CLR_REG_BIT(RTCIF, RTCIF_DAY_MSK)
#define RTC_ClearHourFlag()             CLR_REG_BIT(RTCIF, RTCIF_HOUR_MSK)
#define RTC_ClearMinuteFlag()           CLR_REG_BIT(RTCIF, RTCIF_MIN_MSK)
#define RTC_ClearSecondFlag()           CLR_REG_BIT(RTCIF, RTCIF_SEC_MSK)
#define RTC_ClearSecondD2Flag()         CLR_REG_BIT(RTCIF, RTCIF_SEC2_MSK)
#define RTC_ClearSecondD8Flag()         CLR_REG_BIT(RTCIF, RTCIF_SEC8_MSK)
#define RTC_ClearSecondD32Flag()        CLR_REG_BIT(RTCIF, RTCIF_SEC32_MSK)

#define LCMIFIF_MSK                     BIT0
#define LCM_CheckFlag()                 READ_REG_BIT(LCMIFSTA, LCMIFIF_MSK)
#define LCM_ClearFlag()                 CLR_REG_BIT(LCMIFSTA, LCMIFIF_MSK)

#define I2CMSST_MSIF_MSK                BIT6
#define I2C1_CheckMasterFlag()          READ_REG_BIT(I2CMSST, I2CMSST_MSIF_MSK)
#define I2C1_ClearMasterFlag()          CLR_REG_BIT(I2CMSST, I2CMSST_MSIF_MSK)

#define I2C2MSST_MSIF_MSK               BIT6
#define I2C2_CheckMasterFlag()          READ_REG_BIT(I2C2MSST, I2C2MSST_MSIF_MSK)
#define I2C2_ClearMasterFlag()          CLR_REG_BIT(I2C2MSST, I2C2MSST_MSIF_MSK)

#define I2CSLST_STAIF_MSK               BIT6
#define I2CSLST_RXIF_MSK                BIT5
#define I2CSLST_TXIF_MSK                BIT4
#define I2CSLST_STOIF_MSK               BIT3
#define I2C1_CheckSlaveSTAFlag()        READ_REG_BIT(I2CSLST, I2CSLST_STAIF_MSK)
#define I2C1_CheckSlaveSTOFlag()        READ_REG_BIT(I2CSLST, I2CSLST_STOIF_MSK)
#define I2C1_CheckSlaveRXFlag()         READ_REG_BIT(I2CSLST, I2CSLST_RXIF_MSK)
#define I2C1_CheckSlaveTXFlag()         READ_REG_BIT(I2CSLST, I2CSLST_TXIF_MSK)
#define I2C1_CheckSlaveAllFlag()        READ_REG_BIT(I2CSLST, I2CSLST_STAIF_MSK | I2CSLST_STOIF_MSK | I2CSLST_RXIF_MSK | I2CSLST_TXIF_MSK)
#define I2C1_ClearSlaveSTAFlag()        CLR_REG_BIT(I2CSLST, I2CSLST_STAIF_MSK)
#define I2C1_ClearSlaveSTOFlag()        CLR_REG_BIT(I2CSLST, I2CSLST_STOIF_MSK)
#define I2C1_ClearSlaveRXFlag()         CLR_REG_BIT(I2CSLST, I2CSLST_RXIF_MSK)
#define I2C1_ClearSlaveTXFlag()         CLR_REG_BIT(I2CSLST, I2CSLST_TXIF_MSK)
#define I2C1_ClearSlaveAllFlag()        CLR_REG_BIT(I2CSLST, I2CSLST_STAIF_MSK | I2CSLST_STOIF_MSK | I2CSLST_RXIF_MSK | I2CSLST_TXIF_MSK)

#define I2C2SLST_STAIF_MSK              BIT6
#define I2C2SLST_RXIF_MSK               BIT5
#define I2C2SLST_TXIF_MSK               BIT4
#define I2C2SLST_STOIF_MSK              BIT3
#define I2C2_CheckSlaveSTAFlag()        READ_REG_BIT(I2C2SLST, I2C2SLST_STAIF_MSK)
#define I2C2_CheckSlaveSTOFlag()        READ_REG_BIT(I2C2SLST, I2C2SLST_STOIF_MSK)
#define I2C2_CheckSlaveRXFlag()         READ_REG_BIT(I2C2SLST, I2C2SLST_RXIF_MSK)
#define I2C2_CheckSlaveTXFlag()         READ_REG_BIT(I2C2SLST, I2C2SLST_TXIF_MSK)
#define I2C2_CheckSlaveAllFlag()        READ_REG_BIT(I2C2SLST, I2C2SLST_STAIF_MSK | I2C2SLST_STOIF_MSK | I2C2SLST_RXIF_MSK | I2C2SLST_TXIF_MSK)
#define I2C2_ClearSlaveSTAFlag()        CLR_REG_BIT(I2C2SLST, I2C2SLST_STAIF_MSK)
#define I2C2_ClearSlaveSTOFlag()        CLR_REG_BIT(I2C2SLST, I2C2SLST_STOIF_MSK)
#define I2C2_ClearSlaveRXFlag()         CLR_REG_BIT(I2C2SLST, I2C2SLST_RXIF_MSK)
#define I2C2_ClearSlaveTXFlag()         CLR_REG_BIT(I2C2SLST, I2C2SLST_TXIF_MSK)
#define I2C2_ClearSlaveAllFlag()        CLR_REG_BIT(I2C2SLST, I2C2SLST_STAIF_MSK | I2C2SLST_STOIF_MSK | I2C2SLST_RXIF_MSK | I2C2SLST_TXIF_MSK)

#define PWMASR1_BIF_MSK                 BIT7
#define PWMASR1_TIF_MSK                 BIT6
#define PWMASR1_COMIF_MSK               BIT5
#define PWMASR3_CC6IF_MSK               BIT1
#define PWMASR3_CC5IF_MSK               BIT0
#define PWMASR1_CC4IF_MSK               BIT4
#define PWMASR1_CC3IF_MSK               BIT3
#define PWMASR1_CC2IF_MSK               BIT2
#define PWMASR1_CC1IF_MSK               BIT1
#define PWMASR1_UIF_MSK                 BIT0
#define PWMA_CheckBreakFlag()           READ_REG_BIT(PWMA_SR1, PWMASR1_BIF_MSK)
#define PWMA_CheckTriggerFlag()         READ_REG_BIT(PWMA_SR1, PWMASR1_TIF_MSK)
#define PWMA_CheckCOMFlag()             READ_REG_BIT(PWMA_SR1, PWMASR1_COMIF_MSK)
#define PWMA_CheckCC6Flag()             READ_REG_BIT(PWMA_SR3, PWMASR3_CC6IF_MSK)
#define PWMA_CheckCC5Flag()             READ_REG_BIT(PWMA_SR3, PWMASR3_CC5IF_MSK)
#define PWMA_CheckCC4Flag()             READ_REG_BIT(PWMA_SR1, PWMASR1_CC4IF_MSK)
#define PWMA_CheckCC3Flag()             READ_REG_BIT(PWMA_SR1, PWMASR1_CC3IF_MSK)
#define PWMA_CheckCC2Flag()             READ_REG_BIT(PWMA_SR1, PWMASR1_CC2IF_MSK)
#define PWMA_CheckCC1Flag()             READ_REG_BIT(PWMA_SR1, PWMASR1_CC1IF_MSK)
#define PWMA_CheckUpdateFlag()          READ_REG_BIT(PWMA_SR1, PWMASR1_UIF_MSK)
#define PWMA_ClearBreakFlag()           CLR_REG_BIT(PWMA_SR1, PWMASR1_BIF_MSK)
#define PWMA_ClearTriggerFlag()         CLR_REG_BIT(PWMA_SR1, PWMASR1_TIF_MSK)
#define PWMA_ClearCOMFlag()             CLR_REG_BIT(PWMA_SR1, PWMASR1_COMIF_MSK)
#define PWMA_ClearCC6Flag()             CLR_REG_BIT(PWMA_SR3, PWMASR3_CC6IF_MSK)
#define PWMA_ClearCC5Flag()             CLR_REG_BIT(PWMA_SR3, PWMASR3_CC5IF_MSK)
#define PWMA_ClearCC4Flag()             CLR_REG_BIT(PWMA_SR1, PWMASR1_CC4IF_MSK)
#define PWMA_ClearCC3Flag()             CLR_REG_BIT(PWMA_SR1, PWMASR1_CC3IF_MSK)
#define PWMA_ClearCC2Flag()             CLR_REG_BIT(PWMA_SR1, PWMASR1_CC2IF_MSK)
#define PWMA_ClearCC1Flag()             CLR_REG_BIT(PWMA_SR1, PWMASR1_CC1IF_MSK)
#define PWMA_ClearUpdateFlag()          CLR_REG_BIT(PWMA_SR1, PWMASR1_UIF_MSK)

