fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMA_CheckBreakFlag()         READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_BIF_MSK)
#define HSPWMA_CheckTriggerFlag()       READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_TIF_MSK)
#define HSPWMA_CheckCOMFlag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_COMIF_MSK)
#define HSPWMA_CheckCC6Flag()           READ_HSPWMA_BIT(PWMA_SR3, PWMASR3_CC6IF_MSK)
#define HSPWMA_CheckCC5Flag()           READ_HSPWMA_BIT(PWMA_SR3, PWMASR3_CC5IF_MSK)
#define HSPWMA_CheckCC4Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC4IF_MSK)
#define HSPWMA_CheckCC3Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC3IF_MSK)
#define HSPWMA_CheckCC2Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC2IF_MSK)
#define HSPWMA_CheckCC1Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC1IF_MSK)
#define HSPWMA_CheckUpdateFlag()        READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_UIF_MSK)
#define HSPWMA_ClearBreakFlag()         CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_BIF_MSK)
#define HSPWMA_ClearTriggerFlag()       CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_TIF_MSK)
#define HSPWMA_ClearCOMFlag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_COMIF_MSK)
#define HSPWMA_ClearCC6Flag()           CLR_HSPWMA_BIT(PWMA_SR3, PWMASR3_CC6IF_MSK)
#define HSPWMA_ClearCC5Flag()           CLR_HSPWMA_BIT(PWMA_SR3, PWMASR3_CC5IF_MSK)
#define HSPWMA_ClearCC4Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC4IF_MSK)
#define HSPWMA_ClearCC3Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC3IF_MSK)
#define HSPWMA_ClearCC2Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC2IF_MSK)
#define HSPWMA_ClearCC1Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC1IF_MSK)
#define HSPWMA_ClearUpdateFlag()        CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_UIF_MSK)

#define PWMBSR1_BIF_MSK                 BIT7
#define PWMBSR1_TIF_MSK                 BIT6
#define PWMBSR1_COMIF_MSK               BIT5
#define PWMBSR1_CC8IF_MSK               BIT4
#define PWMBSR1_CC7IF_MSK               BIT3
#define PWMBSR1_CC6IF_MSK               BIT2
#define PWMBSR1_CC5IF_MSK               BIT1
#define PWMBSR1_UIF_MSK                 BIT0
#define PWMB_CheckBreakFlag()           READ_REG_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define PWMB_CheckTriggerFlag()         READ_REG_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define PWMB_CheckCOMFlag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define PWMB_CheckCC8Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define PWMB_CheckCC7Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define PWMB_CheckCC6Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define PWMB_CheckCC5Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define PWMB_CheckUpdateFlag()          READ_REG_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)
#define PWMB_ClearBreakFlag()           CLR_REG_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define PWMB_ClearTriggerFlag()         CLR_REG_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define PWMB_ClearCOMFlag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define PWMB_ClearCC8Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define PWMB_ClearCC7Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define PWMB_ClearCC6Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define PWMB_ClearCC5Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define PWMB_ClearUpdateFlag()          CLR_REG_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)

#define HSPWMB_CheckBreakFlag()         READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define HSPWMB_CheckTriggerFlag()       READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define HSPWMB_CheckCOMFlag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define HSPWMB_CheckCC8Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define HSPWMB_CheckCC7Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define HSPWMB_CheckCC6Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define HSPWMB_CheckCC5Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define HSPWMB_CheckUpdateFlag()        READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)
#define HSPWMB_ClearBreakFlag()         CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define HSPWMB_ClearTriggerFlag()       CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define HSPWMB_ClearCOMFlag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define HSPWMB_ClearCC8Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define HSPWMB_ClearCC7Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define HSPWMB_ClearCC6Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define HSPWMB_ClearCC5Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define HSPWMB_ClearUpdateFlag()        CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)

#define PWMCSR1_BIF_MSK                 BIT7
#define PWMCSR1_TIF_MSK                 BIT6
#define PWMCSR1_COMIF_MSK               BIT5
#define PWMCSR3_CC6IF_MSK               BIT1
#define PWMCSR3_CC5IF_MSK               BIT0
#define PWMCSR1_CC4IF_MSK               BIT4
#define PWMCSR1_CC3IF_MSK               BIT3
#define PWMCSR1_CC2IF_MSK               BIT2
#define PWMCSR1_CC1IF_MSK               BIT1
#define PWMCSR1_UIF_MSK                 BIT0
#define PWMC_CheckBreakFlag()           READ_REG_BIT(PWMC_SR1, PWMCSR1_BIF_MSK)
#define PWMC_CheckTriggerFlag()         READ_REG_BIT(PWMC_SR1, PWMCSR1_TIF_MSK)
#define PWMC_CheckCOMFlag()             READ_REG_BIT(PWMC_SR1, PWMCSR1_COMIF_MSK)
#define PWMC_CheckCC6Flag()             READ_REG_BIT(PWMC_SR3, PWMCSR3_CC6IF_MSK)
#define PWMC_CheckCC5Flag()             READ_REG_BIT(PWMC_SR3, PWMCSR3_CC5IF_MSK)
#define PWMC_CheckCC4Flag()             READ_REG_BIT(PWMC_SR1, PWMCSR1_CC4IF_MSK)
#define PWMC_CheckCC3Flag()             READ_REG_BIT(PWMC_SR1, PWMCSR1_CC3IF_MSK)
#define PWMC_CheckCC2Flag()             READ_REG_BIT(PWMC_SR1, PWMCSR1_CC2IF_MSK)
#define PWMC_CheckCC1Flag()             READ_REG_BIT(PWMC_SR1, PWMCSR1_CC1IF_MSK)
#define PWMC_CheckUpdateFlag()          READ_REG_BIT(PWMC_SR1, PWMCSR1_UIF_MSK)
#define PWMC_ClearBreakFlag()           CLR_REG_BIT(PWMC_SR1, PWMCSR1_BIF_MSK)
#define PWMC_ClearTriggerFlag()         CLR_REG_BIT(PWMC_SR1, PWMCSR1_TIF_MSK)
#define PWMC_ClearCOMFlag()             CLR_REG_BIT(PWMC_SR1, PWMCSR1_COMIF_MSK)
#define PWMC_ClearCC6Flag()             CLR_REG_BIT(PWMC_SR3, PWMCSR3_CC6IF_MSK)
#define PWMC_ClearCC5Flag()             CLR_REG_BIT(PWMC_SR3, PWMCSR3_CC5IF_MSK)
#define PWMC_ClearCC4Flag()             CLR_REG_BIT(PWMC_SR1, PWMCSR1_CC4IF_MSK)
#define PWMC_ClearCC3Flag()             CLR_REG_BIT(PWMC_SR1, PWMCSR1_CC3IF_MSK)
#define PWMC_ClearCC2Flag()             CLR_REG_BIT(PWMC_SR1, PWMCSR1_CC2IF_MSK)
#define PWMC_ClearCC1Flag()             CLR_REG_BIT(PWMC_SR1, PWMCSR1_CC1IF_MSK)
#define PWMC_ClearUpdateFlag()          CLR_REG_BIT(PWMC_SR1, PWMCSR1_UIF_MSK)

#define HSPWMC_CheckBreakFlag()         READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_BIF_MSK)
#define HSPWMC_CheckTriggerFlag()       READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_TIF_MSK)
#define HSPWMC_CheckCOMFlag()           READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_COMIF_MSK)
#define HSPWMC_CheckCC6Flag()           READ_HSPWMC_BIT(PWMC_SR3, PWMCSR3_CC6IF_MSK)
#define HSPWMC_CheckCC5Flag()           READ_HSPWMC_BIT(PWMC_SR3, PWMCSR3_CC5IF_MSK)
#define HSPWMC_CheckCC4Flag()           READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC4IF_MSK)
#define HSPWMC_CheckCC3Flag()           READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC3IF_MSK)
#define HSPWMC_CheckCC2Flag()           READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC2IF_MSK)
#define HSPWMC_CheckCC1Flag()           READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC1IF_MSK)
#define HSPWMC_CheckUpdateFlag()        READ_HSPWMC_BIT(PWMC_SR1, PWMCSR1_UIF_MSK)
#define HSPWMC_ClearBreakFlag()         CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_BIF_MSK)
#define HSPWMC_ClearTriggerFlag()       CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_TIF_MSK)
#define HSPWMC_ClearCOMFlag()           CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_COMIF_MSK)
#define HSPWMC_ClearCC6Flag()           CLR_HSPWMC_BIT(PWMC_SR3, PWMCSR3_CC6IF_MSK)
#define HSPWMC_ClearCC5Flag()           CLR_HSPWMC_BIT(PWMC_SR3, PWMCSR3_CC5IF_MSK)
#define HSPWMC_ClearCC4Flag()           CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC4IF_MSK)
#define HSPWMC_ClearCC3Flag()           CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC3IF_MSK)
#define HSPWMC_ClearCC2Flag()           CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC2IF_MSK)
#define HSPWMC_ClearCC1Flag()           CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_CC1IF_MSK)
#define HSPWMC_ClearUpdateFlag()        CLR_HSPWMC_BIT(PWMC_SR1, PWMCSR1_UIF_MSK)

#define PWMDSR1_BIF_MSK                 BIT7
#define PWMDSR1_TIF_MSK                 BIT6
#define PWMDSR1_COMIF_MSK               BIT5
#define PWMDSR1_CC8IF_MSK               BIT4
#define PWMDSR1_CC7IF_MSK               BIT3
#define PWMDSR1_CC6IF_MSK               BIT2
#define PWMDSR1_CC5IF_MSK               BIT1
#define PWMDSR1_UIF_MSK                 BIT0
#define PWMD_CheckBreakFlag()           READ_REG_BIT(PWMD_SR1, PWMDSR1_BIF_MSK)
#define PWMD_CheckTriggerFlag()         READ_REG_BIT(PWMD_SR1, PWMDSR1_TIF_MSK)
#define PWMD_CheckCOMFlag()             READ_REG_BIT(PWMD_SR1, PWMDSR1_COMIF_MSK)
#define PWMD_CheckCC8Flag()             READ_REG_BIT(PWMD_SR1, PWMDSR1_CC8IF_MSK)
#define PWMD_CheckCC7Flag()             READ_REG_BIT(PWMD_SR1, PWMDSR1_CC7IF_MSK)
#define PWMD_CheckCC6Flag()             READ_REG_BIT(PWMD_SR1, PWMDSR1_CC6IF_MSK)
#define PWMD_CheckCC5Flag()             READ_REG_BIT(PWMD_SR1, PWMDSR1_CC5IF_MSK)
#define PWMD_CheckUpdateFlag()          READ_REG_BIT(PWMD_SR1, PWMDSR1_UIF_MSK)
#define PWMD_ClearBreakFlag()           CLR_REG_BIT(PWMD_SR1, PWMDSR1_BIF_MSK)
#define PWMD_ClearTriggerFlag()         CLR_REG_BIT(PWMD_SR1, PWMDSR1_TIF_MSK)
#define PWMD_ClearCOMFlag()             CLR_REG_BIT(PWMD_SR1, PWMDSR1_COMIF_MSK)
#define PWMD_ClearCC8Flag()             CLR_REG_BIT(PWMD_SR1, PWMDSR1_CC8IF_MSK)
#define PWMD_ClearCC7Flag()             CLR_REG_BIT(PWMD_SR1, PWMDSR1_CC7IF_MSK)
#define PWMD_ClearCC6Flag()             CLR_REG_BIT(PWMD_SR1, PWMDSR1_CC6IF_MSK)
#define PWMD_ClearCC5Flag()             CLR_REG_BIT(PWMD_SR1, PWMDSR1_CC5IF_MSK)
#define PWMD_ClearUpdateFlag()          CLR_REG_BIT(PWMD_SR1, PWMDSR1_UIF_MSK)

#define HSPWMD_CheckBreakFlag()         READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_BIF_MSK)
#define HSPWMD_CheckTriggerFlag()       READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_TIF_MSK)
#define HSPWMD_CheckCOMFlag()           READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_COMIF_MSK)
#define HSPWMD_CheckCC8Flag()           READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC8IF_MSK)
#define HSPWMD_CheckCC7Flag()           READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC7IF_MSK)
#define HSPWMD_CheckCC6Flag()           READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC6IF_MSK)
#define HSPWMD_CheckCC5Flag()           READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC5IF_MSK)
#define HSPWMD_CheckUpdateFlag()        READ_HSPWMD_BIT(PWMD_SR1, PWMDSR1_UIF_MSK)
#define HSPWMD_ClearBreakFlag()         CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_BIF_MSK)
#define HSPWMD_ClearTriggerFlag()       CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_TIF_MSK)
#define HSPWMD_ClearCOMFlag()           CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_COMIF_MSK)
#define HSPWMD_ClearCC8Flag()           CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC8IF_MSK)
#define HSPWMD_ClearCC7Flag()           CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC7IF_MSK)
#define HSPWMD_ClearCC6Flag()           CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC6IF_MSK)
#define HSPWMD_ClearCC5Flag()           CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_CC5IF_MSK)
#define HSPWMD_ClearUpdateFlag()        CLR_HSPWMD_BIT(PWMD_SR1, PWMDSR1_UIF_MSK)

#define PWMESR1_BIF_MSK                 BIT7
#define PWMESR1_TIF_MSK                 BIT6
#define PWMESR1_COMIF_MSK               BIT5
#define PWMESR3_CC6IF_MSK               BIT1
#define PWMESR3_CC5IF_MSK               BIT0
#define PWMESR1_CC4IF_MSK               BIT4
#define PWMESR1_CC3IF_MSK               BIT3
#define PWMESR1_CC2IF_MSK               BIT2
#define PWMESR1_CC1IF_MSK               BIT1
#define PWMESR1_UIF_MSK                 BIT0
#define PWME_CheckBreakFlag()           READ_REG_BIT(PWME_SR1, PWMESR1_BIF_MSK)
#define PWME_CheckTriggerFlag()         READ_REG_BIT(PWME_SR1, PWMESR1_TIF_MSK)
#define PWME_CheckCOMFlag()             READ_REG_BIT(PWME_SR1, PWMESR1_COMIF_MSK)
#define PWME_CheckCC6Flag()             READ_REG_BIT(PWME_SR3, PWMESR3_CC6IF_MSK)
#define PWME_CheckCC5Flag()             READ_REG_BIT(PWME_SR3, PWMESR3_CC5IF_MSK)
#define PWME_CheckCC4Flag()             READ_REG_BIT(PWME_SR1, PWMESR1_CC4IF_MSK)
#define PWME_CheckCC3Flag()             READ_REG_BIT(PWME_SR1, PWMESR1_CC3IF_MSK)
#define PWME_CheckCC2Flag()             READ_REG_BIT(PWME_SR1, PWMESR1_CC2IF_MSK)
#define PWME_CheckCC1Flag()             READ_REG_BIT(PWME_SR1, PWMESR1_CC1IF_MSK)
#define PWME_CheckUpdateFlag()          READ_REG_BIT(PWME_SR1, PWMESR1_UIF_MSK)
#define PWME_ClearBreakFlag()           CLR_REG_BIT(PWME_SR1, PWMESR1_BIF_MSK)
#define PWME_ClearTriggerFlag()         CLR_REG_BIT(PWME_SR1, PWMESR1_TIF_MSK)
#define PWME_ClearCOMFlag()             CLR_REG_BIT(PWME_SR1, PWMESR1_COMIF_MSK)
#define PWME_ClearCC6Flag()             CLR_REG_BIT(PWME_SR3, PWMESR3_CC6IF_MSK)
#define PWME_ClearCC5Flag()             CLR_REG_BIT(PWME_SR3, PWMESR3_CC5IF_MSK)
#define PWME_ClearCC4Flag()             CLR_REG_BIT(PWME_SR1, PWMESR1_CC4IF_MSK)
#define PWME_ClearCC3Flag()             CLR_REG_BIT(PWME_SR1, PWMESR1_CC3IF_MSK)
#define PWME_ClearCC2Flag()             CLR_REG_BIT(PWME_SR1, PWMESR1_CC2IF_MSK)
#define PWME_ClearCC1Flag()             CLR_REG_BIT(PWME_SR1, PWMESR1_CC1IF_MSK)
#define PWME_ClearUpdateFlag()          CLR_REG_BIT(PWME_SR1, PWMESR1_UIF_MSK)

#define HSPWME_CheckBreakFlag()         READ_HSPWME_BIT(PWME_SR1, PWMESR1_BIF_MSK)
#define HSPWME_CheckTriggerFlag()       READ_HSPWME_BIT(PWME_SR1, PWMESR1_TIF_MSK)
#define HSPWME_CheckCOMFlag()           READ_HSPWME_BIT(PWME_SR1, PWMESR1_COMIF_MSK)
#define HSPWME_CheckCC6Flag()           READ_HSPWME_BIT(PWME_SR3, PWMESR3_CC6IF_MSK)
#define HSPWME_CheckCC5Flag()           READ_HSPWME_BIT(PWME_SR3, PWMESR3_CC5IF_MSK)
#define HSPWME_CheckCC4Flag()           READ_HSPWME_BIT(PWME_SR1, PWMESR1_CC4IF_MSK)
#define HSPWME_CheckCC3Flag()           READ_HSPWME_BIT(PWME_SR1, PWMESR1_CC3IF_MSK)
#define HSPWME_CheckCC2Flag()           READ_HSPWME_BIT(PWME_SR1, PWMESR1_CC2IF_MSK)
#define HSPWME_CheckCC1Flag()           READ_HSPWME_BIT(PWME_SR1, PWMESR1_CC1IF_MSK)
#define HSPWME_CheckUpdateFlag()        READ_HSPWME_BIT(PWME_SR1, PWMESR1_UIF_MSK)
#define HSPWME_ClearBreakFlag()         CLR_HSPWME_BIT(PWME_SR1, PWMESR1_BIF_MSK)
#define HSPWME_ClearTriggerFlag()       CLR_HSPWME_BIT(PWME_SR1, PWMESR1_TIF_MSK)
#define HSPWME_ClearCOMFlag()           CLR_HSPWME_BIT(PWME_SR1, PWMESR1_COMIF_MSK)
#define HSPWME_ClearCC6Flag()           CLR_HSPWME_BIT(PWME_SR3, PWMESR3_CC6IF_MSK)
#define HSPWME_ClearCC5Flag()           CLR_HSPWME_BIT(PWME_SR3, PWMESR3_CC5IF_MSK)
#define HSPWME_ClearCC4Flag()           CLR_HSPWME_BIT(PWME_SR1, PWMESR1_CC4IF_MSK)
#define HSPWME_ClearCC3Flag()           CLR_HSPWME_BIT(PWME_SR1, PWMESR1_CC3IF_MSK)
#define HSPWME_ClearCC2Flag()           CLR_HSPWME_BIT(PWME_SR1, PWMESR1_CC2IF_MSK)
#define HSPWME_ClearCC1Flag()           CLR_HSPWME_BIT(PWME_SR1, PWMESR1_CC1IF_MSK)
#define HSPWME_ClearUpdateFlag()        CLR_HSPWME_BIT(PWME_SR1, PWMESR1_UIF_MSK)

