fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMFSR1_BIF_MSK                 BIT7
#define PWMFSR1_TIF_MSK                 BIT6
#define PWMFSR1_COMIF_MSK               BIT5
#define PWMFSR1_CC8IF_MSK               BIT4
#define PWMFSR1_CC7IF_MSK               BIT3
#define PWMFSR1_CC6IF_MSK               BIT2
#define PWMFSR1_CC5IF_MSK               BIT1
#define PWMFSR1_UIF_MSK                 BIT0
#define PWMF_CheckBreakFlag()           READ_REG_BIT(PWMF_SR1, PWMFSR1_BIF_MSK)
#define PWMF_CheckTriggerFlag()         READ_REG_BIT(PWMF_SR1, PWMFSR1_TIF_MSK)
#define PWMF_CheckCOMFlag()             READ_REG_BIT(PWMF_SR1, PWMFSR1_COMIF_MSK)
#define PWMF_CheckCC8Flag()             READ_REG_BIT(PWMF_SR1, PWMFSR1_CC8IF_MSK)
#define PWMF_CheckCC7Flag()             READ_REG_BIT(PWMF_SR1, PWMFSR1_CC7IF_MSK)
#define PWMF_CheckCC6Flag()             READ_REG_BIT(PWMF_SR1, PWMFSR1_CC6IF_MSK)
#define PWMF_CheckCC5Flag()             READ_REG_BIT(PWMF_SR1, PWMFSR1_CC5IF_MSK)
#define PWMF_CheckUpdateFlag()          READ_REG_BIT(PWMF_SR1, PWMFSR1_UIF_MSK)
#define PWMF_ClearBreakFlag()           CLR_REG_BIT(PWMF_SR1, PWMFSR1_BIF_MSK)
#define PWMF_ClearTriggerFlag()         CLR_REG_BIT(PWMF_SR1, PWMFSR1_TIF_MSK)
#define PWMF_ClearCOMFlag()             CLR_REG_BIT(PWMF_SR1, PWMFSR1_COMIF_MSK)
#define PWMF_ClearCC8Flag()             CLR_REG_BIT(PWMF_SR1, PWMFSR1_CC8IF_MSK)
#define PWMF_ClearCC7Flag()             CLR_REG_BIT(PWMF_SR1, PWMFSR1_CC7IF_MSK)
#define PWMF_ClearCC6Flag()             CLR_REG_BIT(PWMF_SR1, PWMFSR1_CC6IF_MSK)
#define PWMF_ClearCC5Flag()             CLR_REG_BIT(PWMF_SR1, PWMFSR1_CC5IF_MSK)
#define PWMF_ClearUpdateFlag()          CLR_REG_BIT(PWMF_SR1, PWMFSR1_UIF_MSK)

#define HSPWMF_CheckBreakFlag()         READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_BIF_MSK)
#define HSPWMF_CheckTriggerFlag()       READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_TIF_MSK)
#define HSPWMF_CheckCOMFlag()           READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_COMIF_MSK)
#define HSPWMF_CheckCC8Flag()           READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC8IF_MSK)
#define HSPWMF_CheckCC7Flag()           READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC7IF_MSK)
#define HSPWMF_CheckCC6Flag()           READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC6IF_MSK)
#define HSPWMF_CheckCC5Flag()           READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC5IF_MSK)
#define HSPWMF_CheckUpdateFlag()        READ_HSPWMF_BIT(PWMF_SR1, PWMFSR1_UIF_MSK)
#define HSPWMF_ClearBreakFlag()         CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_BIF_MSK)
#define HSPWMF_ClearTriggerFlag()       CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_TIF_MSK)
#define HSPWMF_ClearCOMFlag()           CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_COMIF_MSK)
#define HSPWMF_ClearCC8Flag()           CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC8IF_MSK)
#define HSPWMF_ClearCC7Flag()           CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC7IF_MSK)
#define HSPWMF_ClearCC6Flag()           CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC6IF_MSK)
#define HSPWMF_ClearCC5Flag()           CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_CC5IF_MSK)
#define HSPWMF_ClearUpdateFlag()        CLR_HSPWMF_BIT(PWMF_SR1, PWMFSR1_UIF_MSK)

#define PWMASR2_CC4OF_MSK               BIT4
#define PWMASR2_CC3OF_MSK               BIT3
#define PWMASR2_CC2OF_MSK               BIT2
#define PWMASR2_CC1OF_MSK               BIT1
#define PWMA_CheckCC4OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define PWMA_CheckCC3OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define PWMA_CheckCC2OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define PWMA_CheckCC1OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)
#define PWMA_ClearCC4OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define PWMA_ClearCC3OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define PWMA_ClearCC2OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define PWMA_ClearCC1OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)

#define HSPWMA_CheckCC4OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define HSPWMA_CheckCC3OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define HSPWMA_CheckCC2OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define HSPWMA_CheckCC1OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)
#define HSPWMA_ClearCC4OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define HSPWMA_ClearCC3OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define HSPWMA_ClearCC2OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define HSPWMA_ClearCC1OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)

#define PWMBSR2_CC8OF_MSK               BIT4
#define PWMBSR2_CC7OF_MSK               BIT3
#define PWMBSR2_CC6OF_MSK               BIT2
#define PWMBSR2_CC5OF_MSK               BIT1
#define PWMB_CheckCC8OverFlag()         READ_REG_BIT(PWMB_SR2, PWMBSR2_CC8OF_MSK)
#define PWMB_CheckCC7OverFlag()         READ_REG_BIT(PWMB_SR2, PWMBSR2_CC7OF_MSK)
#define PWMB_CheckCC6OverFlag()         READ_REG_BIT(PWMB_SR2, PWMBSR2_CC6OF_MSK)
#define PWMB_CheckCC5OverFlag()         READ_REG_BIT(PWMB_SR2, PWMBSR2_CC5OF_MSK)
#define PWMB_ClearCC8OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMBSR2_CC8OF_MSK)
#define PWMB_ClearCC7OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMBSR2_CC7OF_MSK)
#define PWMB_ClearCC6OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMBSR2_CC6OF_MSK)
#define PWMB_ClearCC5OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMBSR2_CC5OF_MSK)

#define HSPWMB_CheckCC8OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC8OF_MSK)
#define HSPWMB_CheckCC7OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC7OF_MSK)
#define HSPWMB_CheckCC6OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC6OF_MSK)
#define HSPWMB_CheckCC5OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC5OF_MSK)
#define HSPWMB_ClearCC8OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC8OF_MSK)
#define HSPWMB_ClearCC7OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC7OF_MSK)
#define HSPWMB_ClearCC6OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC6OF_MSK)
#define HSPWMB_ClearCC5OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMBSR2_CC5OF_MSK)

#define PWMCSR2_CC4OF_MSK               BIT4
#define PWMCSR2_CC3OF_MSK               BIT3
#define PWMCSR2_CC2OF_MSK               BIT2
#define PWMCSR2_CC1OF_MSK               BIT1
#define PWMC_CheckCC4OverFlag()         READ_REG_BIT(PWMC_SR2, PWMCSR2_CC4OF_MSK)
#define PWMC_CheckCC3OverFlag()         READ_REG_BIT(PWMC_SR2, PWMCSR2_CC3OF_MSK)
#define PWMC_CheckCC2OverFlag()         READ_REG_BIT(PWMC_SR2, PWMCSR2_CC2OF_MSK)
#define PWMC_CheckCC1OverFlag()         READ_REG_BIT(PWMC_SR2, PWMCSR2_CC1OF_MSK)
#define PWMC_ClearCC4OverFlag()         CLR_REG_BIT(PWMC_SR2, PWMCSR2_CC4OF_MSK)
#define PWMC_ClearCC3OverFlag()         CLR_REG_BIT(PWMC_SR2, PWMCSR2_CC3OF_MSK)
#define PWMC_ClearCC2OverFlag()         CLR_REG_BIT(PWMC_SR2, PWMCSR2_CC2OF_MSK)
#define PWMC_ClearCC1OverFlag()         CLR_REG_BIT(PWMC_SR2, PWMCSR2_CC1OF_MSK)

#define HSPWMC_CheckCC4OverFlag()       READ_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC4OF_MSK)
#define HSPWMC_CheckCC3OverFlag()       READ_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC3OF_MSK)
#define HSPWMC_CheckCC2OverFlag()       READ_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC2OF_MSK)
#define HSPWMC_CheckCC1OverFlag()       READ_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC1OF_MSK)
#define HSPWMC_ClearCC4OverFlag()       CLR_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC4OF_MSK)
#define HSPWMC_ClearCC3OverFlag()       CLR_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC3OF_MSK)
#define HSPWMC_ClearCC2OverFlag()       CLR_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC2OF_MSK)
#define HSPWMC_ClearCC1OverFlag()       CLR_HSPWMC_BIT(PWMC_SR2, PWMCSR2_CC1OF_MSK)

