fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMDSR2_CC8OF_MSK               BIT4
#define PWMDSR2_CC7OF_MSK               BIT3
#define PWMDSR2_CC6OF_MSK               BIT2
#define PWMDSR2_CC5OF_MSK               BIT1
#define PWMD_CheckCC8OverFlag()         READ_REG_BIT(PWMD_SR2, PWMDSR2_CC8OF_MSK)
#define PWMD_CheckCC7OverFlag()         READ_REG_BIT(PWMD_SR2, PWMDSR2_CC7OF_MSK)
#define PWMD_CheckCC6OverFlag()         READ_REG_BIT(PWMD_SR2, PWMDSR2_CC6OF_MSK)
#define PWMD_CheckCC5OverFlag()         READ_REG_BIT(PWMD_SR2, PWMDSR2_CC5OF_MSK)
#define PWMD_ClearCC8OverFlag()         CLR_REG_BIT(PWMD_SR2, PWMDSR2_CC8OF_MSK)
#define PWMD_ClearCC7OverFlag()         CLR_REG_BIT(PWMD_SR2, PWMDSR2_CC7OF_MSK)
#define PWMD_ClearCC6OverFlag()         CLR_REG_BIT(PWMD_SR2, PWMDSR2_CC6OF_MSK)
#define PWMD_ClearCC5OverFlag()         CLR_REG_BIT(PWMD_SR2, PWMDSR2_CC5OF_MSK)

#define HSPWMD_CheckCC8OverFlag()       READ_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC8OF_MSK)
#define HSPWMD_CheckCC7OverFlag()       READ_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC7OF_MSK)
#define HSPWMD_CheckCC6OverFlag()       READ_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC6OF_MSK)
#define HSPWMD_CheckCC5OverFlag()       READ_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC5OF_MSK)
#define HSPWMD_ClearCC8OverFlag()       CLR_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC8OF_MSK)
#define HSPWMD_ClearCC7OverFlag()       CLR_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC7OF_MSK)
#define HSPWMD_ClearCC6OverFlag()       CLR_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC6OF_MSK)
#define HSPWMD_ClearCC5OverFlag()       CLR_HSPWMD_BIT(PWMD_SR2, PWMDSR2_CC5OF_MSK)

#define PWMESR2_CC4OF_MSK               BIT4
#define PWMESR2_CC3OF_MSK               BIT3
#define PWMESR2_CC2OF_MSK               BIT2
#define PWMESR2_CC1OF_MSK               BIT1
#define PWME_CheckCC4OverFlag()         READ_REG_BIT(PWME_SR2, PWMESR2_CC4OF_MSK)
#define PWME_CheckCC3OverFlag()         READ_REG_BIT(PWME_SR2, PWMESR2_CC3OF_MSK)
#define PWME_CheckCC2OverFlag()         READ_REG_BIT(PWME_SR2, PWMESR2_CC2OF_MSK)
#define PWME_CheckCC1OverFlag()         READ_REG_BIT(PWME_SR2, PWMESR2_CC1OF_MSK)
#define PWME_ClearCC4OverFlag()         CLR_REG_BIT(PWME_SR2, PWMESR2_CC4OF_MSK)
#define PWME_ClearCC3OverFlag()         CLR_REG_BIT(PWME_SR2, PWMESR2_CC3OF_MSK)
#define PWME_ClearCC2OverFlag()         CLR_REG_BIT(PWME_SR2, PWMESR2_CC2OF_MSK)
#define PWME_ClearCC1OverFlag()         CLR_REG_BIT(PWME_SR2, PWMESR2_CC1OF_MSK)

#define HSPWME_CheckCC4OverFlag()       READ_HSPWME_BIT(PWME_SR2, PWMESR2_CC4OF_MSK)
#define HSPWME_CheckCC3OverFlag()       READ_HSPWME_BIT(PWME_SR2, PWMESR2_CC3OF_MSK)
#define HSPWME_CheckCC2OverFlag()       READ_HSPWME_BIT(PWME_SR2, PWMESR2_CC2OF_MSK)
#define HSPWME_CheckCC1OverFlag()       READ_HSPWME_BIT(PWME_SR2, PWMESR2_CC1OF_MSK)
#define HSPWME_ClearCC4OverFlag()       CLR_HSPWME_BIT(PWME_SR2, PWMESR2_CC4OF_MSK)
#define HSPWME_ClearCC3OverFlag()       CLR_HSPWME_BIT(PWME_SR2, PWMESR2_CC3OF_MSK)
#define HSPWME_ClearCC2OverFlag()       CLR_HSPWME_BIT(PWME_SR2, PWMESR2_CC2OF_MSK)
#define HSPWME_ClearCC1OverFlag()       CLR_HSPWME_BIT(PWME_SR2, PWMESR2_CC1OF_MSK)

#define PWMFSR2_CC8OF_MSK               BIT4
#define PWMFSR2_CC7OF_MSK               BIT3
#define PWMFSR2_CC6OF_MSK               BIT2
#define PWMFSR2_CC5OF_MSK               BIT1
#define PWMF_CheckCC8OverFlag()         READ_REG_BIT(PWMF_SR2, PWMFSR2_CC8OF_MSK)
#define PWMF_CheckCC7OverFlag()         READ_REG_BIT(PWMF_SR2, PWMFSR2_CC7OF_MSK)
#define PWMF_CheckCC6OverFlag()         READ_REG_BIT(PWMF_SR2, PWMFSR2_CC6OF_MSK)
#define PWMF_CheckCC5OverFlag()         READ_REG_BIT(PWMF_SR2, PWMFSR2_CC5OF_MSK)
#define PWMF_ClearCC8OverFlag()         CLR_REG_BIT(PWMF_SR2, PWMFSR2_CC8OF_MSK)
#define PWMF_ClearCC7OverFlag()         CLR_REG_BIT(PWMF_SR2, PWMFSR2_CC7OF_MSK)
#define PWMF_ClearCC6OverFlag()         CLR_REG_BIT(PWMF_SR2, PWMFSR2_CC6OF_MSK)
#define PWMF_ClearCC5OverFlag()         CLR_REG_BIT(PWMF_SR2, PWMFSR2_CC5OF_MSK)

#define HSPWMF_CheckCC8OverFlag()       READ_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC8OF_MSK)
#define HSPWMF_CheckCC7OverFlag()       READ_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC7OF_MSK)
#define HSPWMF_CheckCC6OverFlag()       READ_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC6OF_MSK)
#define HSPWMF_CheckCC5OverFlag()       READ_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC5OF_MSK)
#define HSPWMF_ClearCC8OverFlag()       CLR_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC8OF_MSK)
#define HSPWMF_ClearCC7OverFlag()       CLR_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC7OF_MSK)
#define HSPWMF_ClearCC6OverFlag()       CLR_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC6OF_MSK)
#define HSPWMF_ClearCC5OverFlag()       CLR_HSPWMF_BIT(PWMF_SR2, PWMFSR2_CC5OF_MSK)

#define PORT_CheckFlag(p, b)            READ_REG_BIT(P##p##INTF, (b))
#define PORT_ClearFlag(p, b)            CLR_REG_BIT(P##p##INTF, (b))

#define CheckP0nFlag(b)                 PORT_CheckFlag(0, (b))
#define CheckP1nFlag(b)                 PORT_CheckFlag(1, (b))
#define CheckP2nFlag(b)                 PORT_CheckFlag(2, (b))
#define CheckP3nFlag(b)                 PORT_CheckFlag(3, (b))
#define CheckP4nFlag(b)                 PORT_CheckFlag(4, (b))
#define CheckP5nFlag(b)                 PORT_CheckFlag(5, (b))
#define CheckP6nFlag(b)                 PORT_CheckFlag(6, (b))
#define CheckP7nFlag(b)                 PORT_CheckFlag(7, (b))
#define CheckP8nFlag(b)                 PORT_CheckFlag(8, (b))
#define CheckP9nFlag(b)                 PORT_CheckFlag(9, (b))
#define CheckPAnFlag(b)                 PORT_CheckFlag(A, (b))
#define CheckPBnFlag(b)                 PORT_CheckFlag(B, (b))
#define ClearP0nFlag(b)                 PORT_ClearFlag(0, (b))
#define ClearP1nFlag(b)                 PORT_ClearFlag(1, (b))
#define ClearP2nFlag(b)                 PORT_ClearFlag(2, (b))
#define ClearP3nFlag(b)                 PORT_ClearFlag(3, (b))
#define ClearP4nFlag(b)                 PORT_ClearFlag(4, (b))
#define ClearP5nFlag(b)                 PORT_ClearFlag(5, (b))
#define ClearP6nFlag(b)                 PORT_ClearFlag(6, (b))
#define ClearP7nFlag(b)                 PORT_ClearFlag(7, (b))
#define ClearP8nFlag(b)                 PORT_ClearFlag(8, (b))
#define ClearP9nFlag(b)                 PORT_ClearFlag(9, (b))
#define ClearPAnFlag(b)                 PORT_ClearFlag(A, (b))
#define ClearPBnFlag(b)                 PORT_ClearFlag(B, (b))

#define UR1TOSR_TOIF_MSK                BIT0
#define UR2TOSR_TOIF_MSK                BIT0
#define UR3TOSR_TOIF_MSK                BIT0
#define UR4TOSR_TOIF_MSK                BIT0
#define UR5TOSR_TOIF_MSK                BIT0
#define UR6TOSR_TOIF_MSK                BIT0
#define UR7TOSR_TOIF_MSK                BIT0
#define UR8TOSR_TOIF_MSK                BIT0
#define SPITOSR_TOIF_MSK                BIT0
#define SPI2TOSR_TOIF_MSK               BIT0
#define SPI3TOSR_TOIF_MSK               BIT0
#define I2CTOSR_TOIF_MSK                BIT0
#define I2C2TOSR_TOIF_MSK               BIT0
#define UART1_CheckTimeoutFlag()        READ_REG_BIT(UR1TOSR, UR1TOSR_TOIF_MSK)
#define UART2_CheckTimeoutFlag()        READ_REG_BIT(UR2TOSR, UR2TOSR_TOIF_MSK)
#define UART3_CheckTimeoutFlag()        READ_REG_BIT(UR3TOSR, UR3TOSR_TOIF_MSK)
#define UART4_CheckTimeoutFlag()        READ_REG_BIT(UR4TOSR, UR4TOSR_TOIF_MSK)
#define UART5_CheckTimeoutFlag()        READ_REG_BIT(UR5TOSR, UR5TOSR_TOIF_MSK)
#define UART6_CheckTimeoutFlag()        READ_REG_BIT(UR6TOSR, UR6TOSR_TOIF_MSK)
#define UART7_CheckTimeoutFlag()        READ_REG_BIT(UR7TOSR, UR7TOSR_TOIF_MSK)
#define UART8_CheckTimeoutFlag()        READ_REG_BIT(UR8TOSR, UR8TOSR_TOIF_MSK)
#define SPI1_CheckTimeoutFlag()         READ_REG_BIT(SPITOSR, SPITOSR_TOIF_MSK)
#define SPI2_CheckTimeoutFlag()         READ_REG_BIT(SPI2TOSR, SPI2TOSR_TOIF_MSK)
#define SPI3_CheckTimeoutFlag()         READ_REG_BIT(SPI3TOSR, SPI3TOSR_TOIF_MSK)
#define I2C1_CheckTimeoutFlag()         READ_REG_BIT(I2CTOSR, I2CTOSR_TOIF_MSK)
#define I2C2_CheckTimeoutFlag()         READ_REG_BIT(I2C2TOSR, I2C2TOSR_TOIF_MSK)

#define UR1TOSR_CTOIF_MSK               BIT7
#define UR2TOSR_CTOIF_MSK               BIT7
#define UR3TOSR_CTOIF_MSK               BIT7
#define UR4TOSR_CTOIF_MSK               BIT7
#define UR5TOSR_CTOIF_MSK               BIT7
#define UR6TOSR_CTOIF_MSK               BIT7
#define UR7TOSR_CTOIF_MSK               BIT7
#define UR8TOSR_CTOIF_MSK               BIT7
#define SPITOSR_CTOIF_MSK               BIT7
#define SPI2TOSR_CTOIF_MSK              BIT7
#define SPI3TOSR_CTOIF_MSK              BIT7
#define I2CTOSR_CTOIF_MSK               BIT7
#define I2C2TOSR_CTOIF_MSK              BIT7
#define UART1_ClearTimeoutFlag()        SET_REG_BIT(UR1TOSR, UR1TOSR_CTOIF_MSK)
#define UART2_ClearTimeoutFlag()        SET_REG_BIT(UR2TOSR, UR2TOSR_CTOIF_MSK)
#define UART3_ClearTimeoutFlag()        SET_REG_BIT(UR3TOSR, UR3TOSR_CTOIF_MSK)
#define UART4_ClearTimeoutFlag()        SET_REG_BIT(UR4TOSR, UR4TOSR_CTOIF_MSK)
#define UART5_ClearTimeoutFlag()        SET_REG_BIT(UR5TOSR, UR5TOSR_CTOIF_MSK)
#define UART6_ClearTimeoutFlag()        SET_REG_BIT(UR6TOSR, UR6TOSR_CTOIF_MSK)
#define UART7_ClearTimeoutFlag()        SET_REG_BIT(UR7TOSR, UR7TOSR_CTOIF_MSK)
#define UART8_ClearTimeoutFlag()        SET_REG_BIT(UR8TOSR, UR8TOSR_CTOIF_MSK)
#define SPI1_ClearTimeoutFlag()         SET_REG_BIT(SPITOSR, SPITOSR_CTOIF_MSK)
#define SPI2_ClearTimeoutFlag()         SET_REG_BIT(SPI2TOSR, SPI2TOSR_CTOIF_MSK)
#define SPI3_ClearTimeoutFlag()         SET_REG_BIT(SPI3TOSR, SPI3TOSR_CTOIF_MSK)
#define I2C1_ClearTimeoutFlag()         SET_REG_BIT(I2CTOSR, I2CTOSR_CTOIF_MSK)
#define I2C2_ClearTimeoutFlag()         SET_REG_BIT(I2C2TOSR, I2C2TOSR_CTOIF_MSK)

#define I2SSR_TXE_MSK                   BIT1
#define I2SSR_RXNE_MSK                  BIT0
#define I2S1_CheckTXEFlag()             READ_REG_BIT(I2SSR, I2SSR_TXE_MSK)
#define I2S1_CheckRXNEFlag()            READ_REG_BIT(I2SSR, I2SSR_RXNE_MSK)
#define I2S1_ClearTXEFlag()             CLR_REG_BIT(I2SSR, I2SSR_TXE_MSK)
#define I2S1_ClearRXNEFlag()            CLR_REG_BIT(I2SSR, I2SSR_RXNE_MSK)

#define I2S2SR_TXE_MSK                  BIT1
#define I2S2SR_RXNE_MSK                 BIT0
#define I2S2_CheckTXEFlag()             READ_REG_BIT(I2S2SR, I2S2SR_TXE_MSK)
#define I2S2_CheckRXNEFlag()            READ_REG_BIT(I2S2SR, I2S2SR_RXNE_MSK)
#define I2S2_ClearTXEFlag()             CLR_REG_BIT(I2S2SR, I2S2SR_TXE_MSK)
#define I2S2_ClearRXNEFlag()            CLR_REG_BIT(I2S2SR, I2S2SR_RXNE_MSK)

