fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define QSPISR1_TOF_MSK                 BIT4
#define QSPISR1_SMF_MSK                 BIT3
#define QSPISR1_FTF_MSK                 BIT2
#define QSPISR1_TCF_MSK                 BIT1
#define QSPISR1_TEF_MSK                 BIT0
#define QSPI_CheckTimeout()             READ_REG_BIT(QSPI_SR1, QSPISR1_TOF_MSK)
#define QSPI_CheckMatch()               READ_REG_BIT(QSPI_SR1, QSPISR1_SMF_MSK)
#define QSPI_CheckFIFO()                READ_REG_BIT(QSPI_SR1, QSPISR1_FTF_MSK)
#define QSPI_CheckTransfer()            READ_REG_BIT(QSPI_SR1, QSPISR1_TCF_MSK)
#define QSPI_CheckError()               READ_REG_BIT(QSPI_SR1, QSPISR1_TEF_MSK)

#define QSPIFCR_CTOF_MSK                BIT4
#define QSPIFCR_CSMF_MSK                BIT3
#define QSPIFCR_CTCF_MSK                BIT1
#define QSPIFCR_CTEF_MSK                BIT0
#define QSPI_ClearTimeout()             SET_REG_BIT(QSPI_FCR, QSPIFCR_CTOF_MSK)
#define QSPI_ClearMatch()               SET_REG_BIT(QSPI_FCR, QSPIFCR_CSMF_MSK)
#define QSPI_ClearTransfer()            SET_REG_BIT(QSPI_FCR, QSPIFCR_CTCF_MSK)
#define QSPI_ClearError()               SET_REG_BIT(QSPI_FCR, QSPIFCR_CTEF_MSK)

#define DMAM2MSTA_M2MIF_MSK             BIT0
#define DMAADCSTA_ADCIF_MSK             BIT0
#define DMAADC2STA_ADC2IF_MSK           BIT0
#define DMADAC1STA_DAC1IF_MSK           BIT0
#define DMADAC2STA_DAC2IF_MSK           BIT0
#define DMASPISTA_SPIIF_MSK             BIT0
#define DMASPI2STA_SPI2IF_MSK           BIT0
#define DMASPI3STA_SPI3IF_MSK           BIT0
#define DMAQSPISTA_QSPIIF_MSK           BIT0
#define DMALCMSTA_LCMIF_MSK             BIT0
#define DMAUR1TSTA_UR1TIF_MSK           BIT0
#define DMAUR1RSTA_UR1RIF_MSK           BIT0
#define DMAUR2TSTA_UR2TIF_MSK           BIT0
#define DMAUR2RSTA_UR2RIF_MSK           BIT0
#define DMAUR3TSTA_UR3TIF_MSK           BIT0
#define DMAUR3RSTA_UR3RIF_MSK           BIT0
#define DMAUR4TSTA_UR4TIF_MSK           BIT0
#define DMAUR4RSTA_UR4RIF_MSK           BIT0
#define DMAUR5TSTA_UR5TIF_MSK           BIT0
#define DMAUR5RSTA_UR5RIF_MSK           BIT0
#define DMAUR6TSTA_UR6TIF_MSK           BIT0
#define DMAUR6RSTA_UR6RIF_MSK           BIT0
#define DMAUR7TSTA_UR7TIF_MSK           BIT0
#define DMAUR7RSTA_UR7RIF_MSK           BIT0
#define DMAUR8TSTA_UR8TIF_MSK           BIT0
#define DMAUR8RSTA_UR8RIF_MSK           BIT0
#define DMAI2CTSTA_I2CTIF_MSK           BIT0
#define DMAI2CRSTA_I2CRIF_MSK           BIT0
#define DMAI2C2TSTA_I2C2TIF_MSK         BIT0
#define DMAI2C2RSTA_I2C2RIF_MSK         BIT0
#define DMAI2STSTA_I2STIF_MSK           BIT0
#define DMAI2SRSTA_I2SRIF_MSK           BIT0
#define DMAI2S2TSTA_I2S2TIF_MSK         BIT0
#define DMAI2S2RSTA_I2S2RIF_MSK         BIT0
#define DMAPWMATSTA_PWMATIF_MSK         BIT0
#define DMAPWMARSTA_PWMARIF_MSK         BIT0
#define DMAPWMCTSTA_PWMCTIF_MSK         BIT0
#define DMAPWMCRSTA_PWMCRIF_MSK         BIT0
#define DMAPWMETSTA_PWMETIF_MSK         BIT0
#define DMAPWMERSTA_PWMERIF_MSK         BIT0
#define DMACAN1TSTA_CAN1TIF_MSK         BIT0
#define DMACAN1RSTA_CAN1RIF_MSK         BIT0
#define DMACAN2TSTA_CAN2TIF_MSK         BIT0
#define DMACAN2RSTA_CAN2RIF_MSK         BIT0
#define DMA_M2M_CheckFlag()             READ_REG_BIT(DMA_M2M_STA,   DMAM2MSTA_M2MIF_MSK)
#define DMA_ADC1_CheckFlag()            READ_REG_BIT(DMA_ADC_STA,   DMAADCSTA_ADCIF_MSK)
#define DMA_ADC2_CheckFlag()            READ_REG_BIT(DMA_ADC2_STA,  DMAADC2STA_ADC2IF_MSK)
#define DMA_DAC1_CheckFlag()            READ_REG_BIT(DMA_DAC1_STA,  DMADAC1STA_DAC1IF_MSK)
#define DMA_DAC2_CheckFlag()            READ_REG_BIT(DMA_DAC2_STA,  DMADAC2STA_DAC2IF_MSK)
#define DMA_SPI1_CheckFlag()            READ_REG_BIT(DMA_SPI_STA,   DMASPISTA_SPIIF_MSK)
#define DMA_SPI2_CheckFlag()            READ_REG_BIT(DMA_SPI2_STA,  DMASPI2STA_SPI2IF_MSK)
#define DMA_SPI3_CheckFlag()            READ_REG_BIT(DMA_SPI3_STA,  DMASPI3STA_SPI3IF_MSK)
#define DMA_QSPI_CheckFlag()            READ_REG_BIT(DMA_QSPI_STA,  DMAQSPISTA_QSPIIF_MSK)
#define DMA_LCM_CheckFlag()             READ_REG_BIT(DMA_LCM_STA,   DMALCMSTA_LCMIF_MSK)
#define DMA_UART1_CheckTxFlag()         READ_REG_BIT(DMA_UR1T_STA,  DMAUR1TSTA_UR1TIF_MSK)
#define DMA_UART1_CheckRxFlag()         READ_REG_BIT(DMA_UR1R_STA,  DMAUR1RSTA_UR1RIF_MSK)
#define DMA_UART2_CheckTxFlag()         READ_REG_BIT(DMA_UR2T_STA,  DMAUR2TSTA_UR2TIF_MSK)
#define DMA_UART2_CheckRxFlag()         READ_REG_BIT(DMA_UR2R_STA,  DMAUR2RSTA_UR2RIF_MSK)
#define DMA_UART3_CheckTxFlag()         READ_REG_BIT(DMA_UR3T_STA,  DMAUR3TSTA_UR3TIF_MSK)
#define DMA_UART3_CheckRxFlag()         READ_REG_BIT(DMA_UR3R_STA,  DMAUR3RSTA_UR3RIF_MSK)
#define DMA_UART4_CheckTxFlag()         READ_REG_BIT(DMA_UR4T_STA,  DMAUR4TSTA_UR4TIF_MSK)
#define DMA_UART4_CheckRxFlag()         READ_REG_BIT(DMA_UR4R_STA,  DMAUR4RSTA_UR4RIF_MSK)
#define DMA_UART5_CheckTxFlag()         READ_REG_BIT(DMA_UR5T_STA,  DMAUR5TSTA_UR5TIF_MSK)
#define DMA_UART5_CheckRxFlag()         READ_REG_BIT(DMA_UR5R_STA,  DMAUR5RSTA_UR5RIF_MSK)
#define DMA_UART6_CheckTxFlag()         READ_REG_BIT(DMA_UR6T_STA,  DMAUR6TSTA_UR6TIF_MSK)
#define DMA_UART6_CheckRxFlag()         READ_REG_BIT(DMA_UR6R_STA,  DMAUR6RSTA_UR6RIF_MSK)
#define DMA_UART7_CheckTxFlag()         READ_REG_BIT(DMA_UR7T_STA,  DMAUR7TSTA_UR7TIF_MSK)
#define DMA_UART7_CheckRxFlag()         READ_REG_BIT(DMA_UR7R_STA,  DMAUR7RSTA_UR7RIF_MSK)
#define DMA_UART8_CheckTxFlag()         READ_REG_BIT(DMA_UR8T_STA,  DMAUR8TSTA_UR8TIF_MSK)
#define DMA_UART8_CheckRxFlag()         READ_REG_BIT(DMA_UR8R_STA,  DMAUR8RSTA_UR8RIF_MSK)
#define DMA_I2C1_CheckTxFlag()          READ_REG_BIT(DMA_I2CT_STA,  DMAI2CTSTA_I2CTIF_MSK)
#define DMA_I2C1_CheckRxFlag()          READ_REG_BIT(DMA_I2CR_STA,  DMAI2CRSTA_I2CRIF_MSK)
#define DMA_I2C2_CheckTxFlag()          READ_REG_BIT(DMA_I2C2T_STA, DMAI2C2TSTA_I2C2TIF_MSK)
#define DMA_I2C2_CheckRxFlag()          READ_REG_BIT(DMA_I2C2R_STA, DMAI2C2RSTA_I2C2RIF_MSK)
#define DMA_I2S1_CheckTxFlag()          READ_REG_BIT(DMA_I2ST_STA,  DMAI2STSTA_I2STIF_MSK)
#define DMA_I2S1_CheckRxFlag()          READ_REG_BIT(DMA_I2SR_STA,  DMAI2SRSTA_I2SRIF_MSK)
#define DMA_I2S2_CheckTxFlag()          READ_REG_BIT(DMA_I2S2T_STA, DMAI2S2TSTA_I2S2TIF_MSK)
#define DMA_I2S2_CheckRxFlag()          READ_REG_BIT(DMA_I2S2R_STA, DMAI2S2RSTA_I2S2RIF_MSK)
#define DMA_PWMA_CheckTxFlag()          READ_REG_BIT(DMA_PWMAT_STA, DMAPWMATSTA_PWMATIF_MSK)
#define DMA_PWMA_CheckRxFlag()          READ_REG_BIT(DMA_PWMAR_STA, DMAPWMARSTA_PWMARIF_MSK)
#define DMA_PWMC_CheckTxFlag()          READ_REG_BIT(DMA_PWMCT_STA, DMAPWMCTSTA_PWMCTIF_MSK)
#define DMA_PWMC_CheckRxFlag()          READ_REG_BIT(DMA_PWMCR_STA, DMAPWMCRSTA_PWMCRIF_MSK)
#define DMA_PWME_CheckTxFlag()          READ_REG_BIT(DMA_PWMET_STA, DMAPWMETSTA_PWMETIF_MSK)
#define DMA_PWME_CheckRxFlag()          READ_REG_BIT(DMA_PWMER_STA, DMAPWMERSTA_PWMERIF_MSK)
#define DMA_CAN1_CheckTxFlag()          READ_REG_BIT(DMA_CAN1T_STA,  DMACAN1TSTA_CAN1TIF_MSK)
#define DMA_CAN1_CheckRxFlag()          READ_REG_BIT(DMA_CAN1R_STA,  DMACAN1RSTA_CAN1RIF_MSK)
#define DMA_CAN2_CheckTxFlag()          READ_REG_BIT(DMA_CAN2T_STA,  DMACAN2TSTA_CAN2TIF_MSK)
#define DMA_CAN2_CheckRxFlag()          READ_REG_BIT(DMA_CAN2R_STA,  DMACAN2RSTA_CAN2RIF_MSK)
#define DMA_M2M_ClearFlag()             CLR_REG_BIT(DMA_M2M_STA,   DMAM2MSTA_M2MIF_MSK)
#define DMA_ADC1_ClearFlag()            CLR_REG_BIT(DMA_ADC_STA,   DMAADCSTA_ADCIF_MSK)
#define DMA_ADC2_ClearFlag()            CLR_REG_BIT(DMA_ADC2_STA,  DMAADC2STA_ADC2IF_MSK)
#define DMA_DAC1_ClearFlag()            CLR_REG_BIT(DMA_DAC1_STA,  DMADAC1STA_DAC1IF_MSK)
#define DMA_DAC2_ClearFlag()            CLR_REG_BIT(DMA_DAC2_STA,  DMADAC2STA_DAC2IF_MSK)
#define DMA_SPI1_ClearFlag()            CLR_REG_BIT(DMA_SPI_STA,   DMASPISTA_SPIIF_MSK)
#define DMA_SPI2_ClearFlag()            CLR_REG_BIT(DMA_SPI2_STA,  DMASPI2STA_SPI2IF_MSK)
#define DMA_SPI3_ClearFlag()            CLR_REG_BIT(DMA_SPI3_STA,  DMASPI3STA_SPI3IF_MSK)
#define DMA_QSPI_ClearFlag()            CLR_REG_BIT(DMA_QSPI_STA,  DMAQSPISTA_QSPIIF_MSK)
#define DMA_LCM_ClearFlag()             CLR_REG_BIT(DMA_LCM_STA,   DMALCMSTA_LCMIF_MSK)
#define DMA_UART1_ClearTxFlag()         CLR_REG_BIT(DMA_UR1T_STA,  DMAUR1TSTA_UR1TIF_MSK)
#define DMA_UART1_ClearRxFlag()         CLR_REG_BIT(DMA_UR1R_STA,  DMAUR1RSTA_UR1RIF_MSK)
#define DMA_UART2_ClearTxFlag()         CLR_REG_BIT(DMA_UR2T_STA,  DMAUR2TSTA_UR2TIF_MSK)
#define DMA_UART2_ClearRxFlag()         CLR_REG_BIT(DMA_UR2R_STA,  DMAUR2RSTA_UR2RIF_MSK)
#define DMA_UART3_ClearTxFlag()         CLR_REG_BIT(DMA_UR3T_STA,  DMAUR3TSTA_UR3TIF_MSK)
#define DMA_UART3_ClearRxFlag()         CLR_REG_BIT(DMA_UR3R_STA,  DMAUR3RSTA_UR3RIF_MSK)
#define DMA_UART4_ClearTxFlag()         CLR_REG_BIT(DMA_UR4T_STA,  DMAUR4TSTA_UR4TIF_MSK)
#define DMA_UART4_ClearRxFlag()         CLR_REG_BIT(DMA_UR4R_STA,  DMAUR4RSTA_UR4RIF_MSK)
#define DMA_UART5_ClearTxFlag()         CLR_REG_BIT(DMA_UR5T_STA,  DMAUR5TSTA_UR5TIF_MSK)
#define DMA_UART5_ClearRxFlag()         CLR_REG_BIT(DMA_UR5R_STA,  DMAUR5RSTA_UR5RIF_MSK)
#define DMA_UART6_ClearTxFlag()         CLR_REG_BIT(DMA_UR6T_STA,  DMAUR6TSTA_UR6TIF_MSK)
#define DMA_UART6_ClearRxFlag()         CLR_REG_BIT(DMA_UR6R_STA,  DMAUR6RSTA_UR6RIF_MSK)
#define DMA_UART7_ClearTxFlag()         CLR_REG_BIT(DMA_UR7T_STA,  DMAUR7TSTA_UR7TIF_MSK)
#define DMA_UART7_ClearRxFlag()         CLR_REG_BIT(DMA_UR7R_STA,  DMAUR7RSTA_UR7RIF_MSK)
#define DMA_UART8_ClearTxFlag()         CLR_REG_BIT(DMA_UR8T_STA,  DMAUR8TSTA_UR8TIF_MSK)
#define DMA_UART8_ClearRxFlag()         CLR_REG_BIT(DMA_UR8R_STA,  DMAUR8RSTA_UR8RIF_MSK)
#define DMA_I2C1_ClearTxFlag()          CLR_REG_BIT(DMA_I2CT_STA,  DMAI2CTSTA_I2CTIF_MSK)
#define DMA_I2C1_ClearRxFlag()          CLR_REG_BIT(DMA_I2CR_STA,  DMAI2CRSTA_I2CRIF_MSK)
#define DMA_I2C2_ClearTxFlag()          CLR_REG_BIT(DMA_I2C2T_STA, DMAI2C2TSTA_I2C2TIF_MSK)
#define DMA_I2C2_ClearRxFlag()          CLR_REG_BIT(DMA_I2C2R_STA, DMAI2C2RSTA_I2C2RIF_MSK)
#define DMA_I2S1_ClearTxFlag()          CLR_REG_BIT(DMA_I2ST_STA,  DMAI2STSTA_I2STIF_MSK)
#define DMA_I2S1_ClearRxFlag()          CLR_REG_BIT(DMA_I2SR_STA,  DMAI2SRSTA_I2SRIF_MSK)
#define DMA_I2S2_ClearTxFlag()          CLR_REG_BIT(DMA_I2S2T_STA, DMAI2S2TSTA_I2S2TIF_MSK)
#define DMA_I2S2_ClearRxFlag()          CLR_REG_BIT(DMA_I2S2R_STA, DMAI2S2RSTA_I2S2RIF_MSK)
#define DMA_PWMA_ClearTxFlag()          CLR_REG_BIT(DMA_PWMAT_STA, DMAPWMATSTA_PWMATIF_MSK)
#define DMA_PWMA_ClearRxFlag()          CLR_REG_BIT(DMA_PWMAR_STA, DMAPWMARSTA_PWMARIF_MSK)
#define DMA_PWMC_ClearTxFlag()          CLR_REG_BIT(DMA_PWMCT_STA, DMAPWMCTSTA_PWMCTIF_MSK)
#define DMA_PWMC_ClearRxFlag()          CLR_REG_BIT(DMA_PWMCR_STA, DMAPWMCRSTA_PWMCRIF_MSK)
#define DMA_PWME_ClearTxFlag()          CLR_REG_BIT(DMA_PWMET_STA, DMAPWMETSTA_PWMETIF_MSK)
#define DMA_PWME_ClearRxFlag()          CLR_REG_BIT(DMA_PWMER_STA, DMAPWMERSTA_PWMERIF_MSK)
#define DMA_CAN1_ClearTxFlag()          CLR_REG_BIT(DMA_CAN1T_STA, DMACAN1TSTA_CAN1TIF_MSK)
#define DMA_CAN1_ClearRxFlag()          CLR_REG_BIT(DMA_CAN1R_STA, DMACAN1RSTA_CAN1RIF_MSK)
#define DMA_CAN2_ClearTxFlag()          CLR_REG_BIT(DMA_CAN2T_STA, DMACAN2TSTA_CAN2TIF_MSK)
#define DMA_CAN2_ClearRxFlag()          CLR_REG_BIT(DMA_CAN2R_STA, DMACAN2RSTA_CAN2RIF_MSK)

