fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define IPH_PX0H_MSK                    BIT0
#define INT0_SetIntPriority(n)          PX0 = ((n) & 1); \
                                        MODIFY_REG(IPH, IPH_PX0H_MSK, ((((n) >> 1) & 1) << 0))

#define IPH_PX1H_MSK                    BIT2
#define INT1_SetIntPriority(n)          PX1 = ((n) & 1); \
                                        MODIFY_REG(IPH, IPH_PX1H_MSK, ((((n) >> 1) & 1) << 2))

#define IP2_PX4_MSK                     BIT4
#define IP2H_PX4H_MSK                   BIT4
#define INT4_SetIntPriority(n)          MODIFY_REG(IP2, IP2_PX4_MSK, (((n) & 1) << 4)); \
                                        MODIFY_REG(IP2H, IP2H_PX4H_MSK, ((((n) >> 1) & 1) << 4))

#define IPH_PT0H_MSK                    BIT1
#define TIMER0_SetIntPriority(n)        PT0 = ((n) & 1); \
                                        MODIFY_REG(IPH, IPH_PT0H_MSK, ((((n) >> 1) & 1) << 1))

#define IPH_PT1H_MSK                    BIT3
#define TIMER1_SetIntPriority(n)        PT1 = ((n) & 1); \
                                        MODIFY_REG(IPH, IPH_PT1H_MSK, ((((n) >> 1) & 1) << 3))

#define T6T5CFG_PT5_MSK                 (BIT2 | BIT1)
#define TIMER5_SetIntPriority(n)        MODIFY_REG(T6T5CFG, T6T5CFG_PT5_MSK, ((n) << 1))

#define T6T5CFG_PT6_MSK                 (BIT6 | BIT5)
#define TIMER6_SetIntPriority(n)        MODIFY_REG(T6T5CFG, T6T5CFG_PT6_MSK, ((n) << 5))

#define T8T7CFG_PT7_MSK                 (BIT2 | BIT1)
#define TIMER7_SetIntPriority(n)        MODIFY_REG(T8T7CFG, T8T7CFG_PT7_MSK, ((n) << 1))

#define T8T7CFG_PT8_MSK                 (BIT6 | BIT5)
#define TIMER8_SetIntPriority(n)        MODIFY_REG(T8T7CFG, T8T7CFG_PT8_MSK, ((n) << 5))

#define T10T9CFG_PT9_MSK                (BIT2 | BIT1)
#define TIMER9_SetIntPriority(n)        MODIFY_REG(T10T9CFG, T10T9CFG_PT9_MSK, ((n) << 1))

#define T10T9CFG_PT10_MSK               (BIT6 | BIT5)
#define TIMER10_SetIntPriority(n)       MODIFY_REG(T10T9CFG, T10T9CFG_PT10_MSK, ((n) << 5))

#define T18T17CFG_PT17_MSK              (BIT2 | BIT1)
#define TIMER17_SetIntPriority(n)       MODIFY_REG(T18T17CFG, T18T17CFG_PT17_MSK, ((n) << 1))

#define T18T17CFG_PT18_MSK              (BIT6 | BIT5)
#define TIMER18_SetIntPriority(n)       MODIFY_REG(T18T17CFG, T18T17CFG_PT18_MSK, ((n) << 5))

#define IPH_PSH_MSK                     BIT4
#define UART1_SetIntPriority(n)         PS = ((n) & 1); \
                                        MODIFY_REG(IPH, IPH_PSH_MSK, ((((n) >> 1) & 1) << 4))

#define IP2_PS2_MSK                     BIT0
#define IP2H_PS2H_MSK                   BIT0
#define UART2_SetIntPriority(n)         MODIFY_REG(IP2, IP2_PS2_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(IP2H, IP2H_PS2H_MSK, ((((n) >> 1) & 1) << 0))

#define IP3_PS3_MSK                     BIT0
#define IP3H_PS3H_MSK                   BIT0
#define UART3_SetIntPriority(n)         MODIFY_REG(IP3, IP3_PS3_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(IP3H, IP3H_PS3H_MSK, ((((n) >> 1) & 1) << 0))

#define IP3_PS4_MSK                     BIT1
#define IP3H_PS4H_MSK                   BIT1
#define UART4_SetIntPriority(n)         MODIFY_REG(IP3, IP3_PS4_MSK, (((n) & 1) << 1)); \
                                        MODIFY_REG(IP3H, IP3H_PS4H_MSK, ((((n) >> 1) & 1) << 1))

#define S5INTR_PS5_MSK                  (BIT5 | BIT4)
#define UART5_SetIntPriority(n)         MODIFY_REG(S5INTR, S5INTR_PS5_MSK, ((n) << 4))

#define S6INTR_PS6_MSK                  (BIT5 | BIT4)
#define UART6_SetIntPriority(n)         MODIFY_REG(S6INTR, S6INTR_PS6_MSK, ((n) << 4))

#define S7INTR_PS7_MSK                  (BIT5 | BIT4)
#define UART7_SetIntPriority(n)         MODIFY_REG(S7INTR, S7INTR_PS7_MSK, ((n) << 4))

#define S8INTR_PS8_MSK                  (BIT5 | BIT4)
#define UART8_SetIntPriority(n)         MODIFY_REG(S8INTR, S8INTR_PS8_MSK, ((n) << 4))

#define IPH_PLVDH_MSK                   BIT6
#define LVD_SetIntPriority(n)           PLVD = ((n) & 1); \
                                        MODIFY_REG(IPH, IPH_PLVDH_MSK, ((((n) >> 1) & 1) << 6))

#define IPH_PADCH_MSK                   BIT5
#define ADC1_SetIntPriority(n)          PADC = ((n) & 1); \
                                        MODIFY_REG(IPH, IPH_PADCH_MSK, ((((n) >> 1) & 1) << 5))

#define ADC2INTR_PADC2_MSK              (BIT2 | BIT1)
#define ADC2_SetIntPriority(n)          MODIFY_REG(ADC2INTR, ADC2INTR_PADC2_MSK, ((n) << 1))

#define DAC1CR1_PDAC1_MSK               (BIT3 | BIT2)
#define DAC1_SetIntPriority(n)          MODIFY_REG(DAC1_CR, DAC1CR1_PDAC1_MSK, ((n) << 2))

#define DAC2CR1_PDAC2_MSK               (BIT3 | BIT2)
#define DAC2_SetIntPriority(n)          MODIFY_REG(DAC2_CR, DAC2CR1_PDAC2_MSK, ((n) << 2))

#define IP2_PSPI_MSK                    BIT1
#define IP2H_PSPIH_MSK                  BIT1
#define SPI1_SetIntPriority(n)          MODIFY_REG(IP2, IP2_PSPI_MSK, (((n) & 1) << 1)); \
                                        MODIFY_REG(IP2H, IP2H_PSPIH_MSK, ((((n) >> 1) & 1) << 1))

#define SPI2INTR_PSPI2_MSK              (BIT5 | BIT4)
#define SPI2_SetIntPriority(n)          MODIFY_REG(SPI2INTR, SPI2INTR_PSPI2_MSK, ((n) << 4))

#define SPI3INTR_PSPI3_MSK              (BIT5 | BIT4)
#define SPI3_SetIntPriority(n)          MODIFY_REG(SPI3INTR, SPI3INTR_PSPI3_MSK, ((n) << 4))

#define IP2_PCMP_MSK                    BIT5
#define IP2H_PCMPH_MSK                  BIT5
#define CMP1_SetIntPriority(n)          MODIFY_REG(IP2, IP2_PCMP_MSK, (((n) & 1) << 5)); \
                                        MODIFY_REG(IP2H, IP2H_PCMPH_MSK, ((((n) >> 1) & 1) << 5))

#define CMP2CR1_PCMP2_MSK               (BIT3 | BIT2)
#define CMP2_SetIntPriority(n)          MODIFY_REG(CMP2_6P6N_CR1, CMP2CR1_PCMP2_MSK, ((n) << 2))

#define CMP3CR1_PCMP3_MSK               (BIT3 | BIT2)
#define CMP3_SetIntPriority(n)          MODIFY_REG(CMP3_6P6N_CR1, CMP3CR1_PCMP3_MSK, ((n) << 2))

#define CMP4CR1_PCMP4_MSK               (BIT3 | BIT2)
#define CMP4_SetIntPriority(n)          MODIFY_REG(CMP4_6P6N_CR1, CMP4CR1_PCMP4_MSK, ((n) << 2))

#define IP3_PRTC_MSK                    BIT2
#define IP3H_PRTCH_MSK                  BIT2
#define RTC_SetIntPriority(n)           MODIFY_REG(IP3, IP3_PRTC_MSK, (((n) & 1) << 2)); \
                                        MODIFY_REG(IP3H, IP3H_PRTCH_MSK, ((((n) >> 1) & 1) << 2))

#define IP2_PI2C_MSK                    BIT6
#define IP2H_PI2CH_MSK                  BIT6
#define I2C1_SetIntPriority(n)          MODIFY_REG(IP2, IP2_PI2C_MSK, (((n) & 1) << 6)); \
                                        MODIFY_REG(IP2H, IP2H_PI2CH_MSK, ((((n) >> 1) & 1) << 6))

#define IP3_PI2C2_MSK                   BIT5
#define IP3H_PI2C2H_MSK                 BIT5
#define I2C2_SetIntPriority(n)          MODIFY_REG(IP3, IP3_PI2C2_MSK, (((n) & 1) << 5)); \
                                        MODIFY_REG(IP3H, IP3H_PI2C2H_MSK, ((((n) >> 1) & 1) << 5))

#define IP3_PI2S_MSK                    BIT3
#define IP3H_PI2SH_MSK                  BIT3
#define I2S1_SetIntPriority(n)          MODIFY_REG(IP3, IP3_PI2S_MSK, (((n) & 1) << 3)); \
                                        MODIFY_REG(IP3H, IP3H_PI2SH_MSK, ((((n) >> 1) & 1) << 3))

#define IP3_PI2S2_MSK                   BIT4
#define IP3H_PI2S2H_MSK                 BIT4
#define I2S2_SetIntPriority(n)          MODIFY_REG(IP3, IP3_PI2S2_MSK, (((n) & 1) << 4)); \
                                        MODIFY_REG(IP3H, IP3H_PI2S2H_MSK, ((((n) >> 1) & 1) << 4))

#define IP2_PUSB_MSK                    BIT7
#define IP2H_PUSBH_MSK                  BIT7
#define USB_SetIntPriority(n)           MODIFY_REG(IP2, IP2_PUSB_MSK, (((n) & 1) << 7)); \
                                        MODIFY_REG(IP2H, IP2H_PUSBH_MSK, ((((n) >> 1) & 1) << 7))

