fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define IP2_PPWMA_MSK                   BIT2
#define IP2H_PPWMAH_MSK                 BIT2
#define PWMA_SetIntPriority(n)          MODIFY_REG(IP2, IP2_PPWMA_MSK, (((n) & 1) << 2)); \
                                        MODIFY_REG(IP2H, IP2H_PPWMAH_MSK, ((((n) >> 1) & 1) << 2))
#define HSPWMA_SetIntPriority(n)        PWMA_SetIntPriority(n)

#define IP2_PPWMB_MSK                   BIT3
#define IP2H_PPWMBH_MSK                 BIT3
#define PWMB_SetIntPriority(n)          MODIFY_REG(IP2, IP2_PPWMB_MSK, (((n) & 1) << 3)); \
                                        MODIFY_REG(IP2H, IP2H_PPWMBH_MSK, ((((n) >> 1) & 1) << 3))
#define HSPWMB_SetIntPriority(n)        PWMB_SetIntPriority(n)

#define IP3_PPWMC_MSK                   BIT6
#define IP3H_PPWMCH_MSK                 BIT6
#define PWMC_SetIntPriority(n)          MODIFY_REG(IP3, IP3_PPWMC_MSK, (((n) & 1) << 6)); \
                                        MODIFY_REG(IP3H, IP3H_PPWMCH_MSK, ((((n) >> 1) & 1) << 6))
#define HSPWMC_SetIntPriority(n)        PWMC_SetIntPriority(n)

#define IP3_PPWMD_MSK                   BIT7
#define IP3H_PPWMDH_MSK                 BIT7
#define PWMD_SetIntPriority(n)          MODIFY_REG(IP3, IP3_PPWMD_MSK, (((n) & 1) << 7)); \
                                        MODIFY_REG(IP3H, IP3H_PPWMDH_MSK, ((((n) >> 1) & 1) << 7))
#define HSPWMD_SetIntPriority(n)        PWMD_SetIntPriority(n)

#define IP4_PPWME_MSK                   BIT0
#define IP4H_PPWMEH_MSK                 BIT0
#define PWME_SetIntPriority(n)          MODIFY_REG(IP4, IP4_PPWME_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(IP4H, IP4H_PPWMEH_MSK, ((((n) >> 1) & 1) << 0))
#define HSPWME_SetIntPriority(n)        PWME_SetIntPriority(n)

#define IP4_PPWMF_MSK                   BIT1
#define IP4H_PPWMFH_MSK                 BIT1
#define PWMF_SetIntPriority(n)          MODIFY_REG(IP4, IP4_PPWMF_MSK, (((n) & 1) << 1)); \
                                        MODIFY_REG(IP4H, IP4H_PPWMFH_MSK, ((((n) >> 1) & 1) << 1))
#define HSPWMF_SetIntPriority(n)        PWMF_SetIntPriority(n)

#define LCMIFIP_MSK                     (BIT5 | BIT4)
#define LCM_SetIntPriority(n)           MODIFY_REG(LCMIFCFG, LCMIFIP_MSK, ((n) << 4))

#define PORT_SetIntPriority(p, n)       MODIFY_REG(PINIPL, BIT(p), (((n) & 0x01) << (p))); \
                                        MODIFY_REG(PINIPH, BIT(p), ((((n) >> 1) & 0x01) << (p)))

#define PORT_SetIntPriority2(p, n)      MODIFY_REG(PIN2IPL, BIT(p), (((n) & 0x01) << (p))); \
                                        MODIFY_REG(PIN2IPH, BIT(p), ((((n) >> 1) & 0x01) << (p)))

#define SetP0IntPriority(n)             PORT_SetIntPriority(0, (n))
#define SetP1IntPriority(n)             PORT_SetIntPriority(1, (n))
#define SetP2IntPriority(n)             PORT_SetIntPriority(2, (n))
#define SetP3IntPriority(n)             PORT_SetIntPriority(3, (n))
#define SetP4IntPriority(n)             PORT_SetIntPriority(4, (n))
#define SetP5IntPriority(n)             PORT_SetIntPriority(5, (n))
#define SetP6IntPriority(n)             PORT_SetIntPriority(6, (n))
#define SetP7IntPriority(n)             PORT_SetIntPriority(7, (n))
#define SetP8IntPriority(n)             PORT_SetIntPriority2(0, (n))
#define SetP9IntPriority(n)             PORT_SetIntPriority2(1, (n))
#define SetPAIntPriority(n)             PORT_SetIntPriority2(2, (n))
#define SetPBIntPriority(n)             PORT_SetIntPriority2(3, (n))

#define QSPIIP_MSK                      (BIT3 | BIT2)
#define QSPI_SetIntPriority(n)          MODIFY_REG(QSPI_DCR1, QSPIIP_MSK, ((n) << 2))

#define DMAM2MCFG_M2MIP_MSK             (BIT3 | BIT2)
#define DMAADCCFG_ADCIP_MSK             (BIT3 | BIT2)
#define DMAADC2CFG_ADC2IP_MSK           (BIT3 | BIT2)
#define DMADAC1CFG_DAC1IP_MSK           (BIT3 | BIT2)
#define DMADAC2CFG_DAC2IP_MSK           (BIT3 | BIT2)
#define DMASPICFG_SPIIP_MSK             (BIT3 | BIT2)
#define DMASPI2CFG_SPI2IP_MSK           (BIT3 | BIT2)
#define DMASPI3CFG_SPI3IP_MSK           (BIT3 | BIT2)
#define DMAQSPICFG_QSPIIP_MSK           (BIT3 | BIT2)
#define DMALCMCFG_LCMIP_MSK             (BIT3 | BIT2)
#define DMAUR1TCFG_UR1TIP_MSK           (BIT3 | BIT2)
#define DMAUR1RCFG_UR1RIP_MSK           (BIT3 | BIT2)
#define DMAUR2TCFG_UR2TIP_MSK           (BIT3 | BIT2)
#define DMAUR2RCFG_UR2RIP_MSK           (BIT3 | BIT2)
#define DMAUR3TCFG_UR3TIP_MSK           (BIT3 | BIT2)
#define DMAUR3RCFG_UR3RIP_MSK           (BIT3 | BIT2)
#define DMAUR4TCFG_UR4TIP_MSK           (BIT3 | BIT2)
#define DMAUR4RCFG_UR4RIP_MSK           (BIT3 | BIT2)
#define DMAUR5TCFG_UR5TIP_MSK           (BIT3 | BIT2)
#define DMAUR5RCFG_UR5RIP_MSK           (BIT3 | BIT2)
#define DMAUR6TCFG_UR6TIP_MSK           (BIT3 | BIT2)
#define DMAUR6RCFG_UR6RIP_MSK           (BIT3 | BIT2)
#define DMAUR7TCFG_UR7TIP_MSK           (BIT3 | BIT2)
#define DMAUR7RCFG_UR7RIP_MSK           (BIT3 | BIT2)
#define DMAUR8TCFG_UR8TIP_MSK           (BIT3 | BIT2)
#define DMAUR8RCFG_UR8RIP_MSK           (BIT3 | BIT2)
#define DMAI2CTCFG_I2CTIP_MSK           (BIT3 | BIT2)
#define DMAI2CRCFG_I2CRIP_MSK           (BIT3 | BIT2)
#define DMAI2C2TCFG_I2C2TIP_MSK         (BIT3 | BIT2)
#define DMAI2C2RCFG_I2C2RIP_MSK         (BIT3 | BIT2)
#define DMAI2STCFG_I2STIP_MSK           (BIT3 | BIT2)
#define DMAI2S2RCFG_I2S2RIP_MSK         (BIT3 | BIT2)
#define DMAI2S2TCFG_I2S2TIP_MSK         (BIT3 | BIT2)
#define DMAI2SRCFG_I2SRIP_MSK           (BIT3 | BIT2)
#define DMAPWMATCFG_PWMATIP_MSK         (BIT3 | BIT2)
#define DMAPWMARCFG_PWMARIP_MSK         (BIT3 | BIT2)
#define DMAPWMCTCFG_PWMCTIP_MSK         (BIT3 | BIT2)
#define DMAPWMCRCFG_PWMCRIP_MSK         (BIT3 | BIT2)
#define DMAPWMETCFG_PWMETIP_MSK         (BIT3 | BIT2)
#define DMAPWMERCFG_PWMERIP_MSK         (BIT3 | BIT2)
#define DMACAN1TCFG_CAN1TIP_MSK         (BIT3 | BIT2)
#define DMACAN1RCFG_CAN1RIP_MSK         (BIT3 | BIT2)
#define DMACAN2TCFG_CAN2TIP_MSK         (BIT3 | BIT2)
#define DMACAN2RCFG_CAN2RIP_MSK         (BIT3 | BIT2)
#define DMA_M2M_SetIntPriority(n)       MODIFY_REG(DMA_M2M_CFG,   DMAM2MCFG_M2MIP_MSK, ((n) << 2))
#define DMA_ADC1_SetIntPriority(n)      MODIFY_REG(DMA_ADC_CFG,   DMAADCCFG_ADCIP_MSK, ((n) << 2))
#define DMA_ADC2_SetIntPriority(n)      MODIFY_REG(DMA_ADC2_CFG,  DMAADC2CFG_ADC2IP_MSK, ((n) << 2))
#define DMA_DAC1_SetIntPriority(n)      MODIFY_REG(DMA_DAC1_CFG,  DMADAC1CFG_DAC1IP_MSK, ((n) << 2))
#define DMA_DAC2_SetIntPriority(n)      MODIFY_REG(DMA_DAC2_CFG,  DMADAC2CFG_DAC2IP_MSK, ((n) << 2))
#define DMA_SPI1_SetIntPriority(n)      MODIFY_REG(DMA_SPI_CFG,   DMASPICFG_SPIIP_MSK, ((n) << 2))
#define DMA_SPI2_SetIntPriority(n)      MODIFY_REG(DMA_SPI2_CFG,  DMASPI2CFG_SPI2IP_MSK, ((n) << 2))
#define DMA_SPI3_SetIntPriority(n)      MODIFY_REG(DMA_SPI3_CFG,  DMASPI3CFG_SPI3IP_MSK, ((n) << 2))
#define DMA_QSPI_SetIntPriority(n)      MODIFY_REG(DMA_QSPI_CFG,  DMAQSPICFG_QSPIIP_MSK, ((n) << 2))
#define DMA_LCM_SetIntPriority(n)       MODIFY_REG(DMA_LCM_CFG,   DMALCMCFG_LCMIP_MSK, ((n) << 2))
#define DMA_UART1_SetTxIntPriority(n)   MODIFY_REG(DMA_UR1T_CFG,  DMAUR1TCFG_UR1TIP_MSK, ((n) << 2))
#define DMA_UART1_SetRxIntPriority(n)   MODIFY_REG(DMA_UR1R_CFG,  DMAUR1RCFG_UR1RIP_MSK, ((n) << 2))
#define DMA_UART2_SetTxIntPriority(n)   MODIFY_REG(DMA_UR2T_CFG,  DMAUR2TCFG_UR2TIP_MSK, ((n) << 2))
#define DMA_UART2_SetRxIntPriority(n)   MODIFY_REG(DMA_UR2R_CFG,  DMAUR2RCFG_UR2RIP_MSK, ((n) << 2))
#define DMA_UART3_SetTxIntPriority(n)   MODIFY_REG(DMA_UR3T_CFG,  DMAUR3TCFG_UR3TIP_MSK, ((n) << 2))
#define DMA_UART3_SetRxIntPriority(n)   MODIFY_REG(DMA_UR3R_CFG,  DMAUR3RCFG_UR3RIP_MSK, ((n) << 2))
#define DMA_UART4_SetTxIntPriority(n)   MODIFY_REG(DMA_UR4T_CFG,  DMAUR4TCFG_UR4TIP_MSK, ((n) << 2))
#define DMA_UART4_SetRxIntPriority(n)   MODIFY_REG(DMA_UR4R_CFG,  DMAUR4RCFG_UR4RIP_MSK, ((n) << 2))
#define DMA_UART5_SetTxIntPriority(n)   MODIFY_REG(DMA_UR5T_CFG,  DMAUR5TCFG_UR5TIP_MSK, ((n) << 2))
#define DMA_UART5_SetRxIntPriority(n)   MODIFY_REG(DMA_UR5R_CFG,  DMAUR5RCFG_UR5RIP_MSK, ((n) << 2))
#define DMA_UART6_SetTxIntPriority(n)   MODIFY_REG(DMA_UR6T_CFG,  DMAUR6TCFG_UR6TIP_MSK, ((n) << 2))
#define DMA_UART6_SetRxIntPriority(n)   MODIFY_REG(DMA_UR6R_CFG,  DMAUR6RCFG_UR6RIP_MSK, ((n) << 2))
#define DMA_UART7_SetTxIntPriority(n)   MODIFY_REG(DMA_UR7T_CFG,  DMAUR7TCFG_UR7TIP_MSK, ((n) << 2))
#define DMA_UART7_SetRxIntPriority(n)   MODIFY_REG(DMA_UR7R_CFG,  DMAUR7RCFG_UR7RIP_MSK, ((n) << 2))
#define DMA_UART8_SetTxIntPriority(n)   MODIFY_REG(DMA_UR8T_CFG,  DMAUR8TCFG_UR8TIP_MSK, ((n) << 2))
#define DMA_UART8_SetRxIntPriority(n)   MODIFY_REG(DMA_UR8R_CFG,  DMAUR8RCFG_UR8RIP_MSK, ((n) << 2))
#define DMA_I2C1_SetTxIntPriority(n)    MODIFY_REG(DMA_I2CT_CFG,  DMAI2CTCFG_I2CTIP_MSK, ((n) << 2))
#define DMA_I2C1_SetRxIntPriority(n)    MODIFY_REG(DMA_I2CR_CFG,  DMAI2CRCFG_I2CRIP_MSK, ((n) << 2))
#define DMA_I2C2_SetTxIntPriority(n)    MODIFY_REG(DMA_I2C2T_CFG, DMAI2C2TCFG_I2C2TIP_MSK, ((n) << 2))
#define DMA_I2C2_SetRxIntPriority(n)    MODIFY_REG(DMA_I2C2R_CFG, DMAI2C2RCFG_I2C2RIP_MSK, ((n) << 2))
#define DMA_I2S1_SetTxIntPriority(n)    MODIFY_REG(DMA_I2ST_CFG,  DMAI2STCFG_I2STIP_MSK, ((n) << 2))
#define DMA_I2S1_SetRxIntPriority(n)    MODIFY_REG(DMA_I2SR_CFG,  DMAI2SRCFG_I2SRIP_MSK, ((n) << 2))
#define DMA_I2S2_SetTxIntPriority(n)    MODIFY_REG(DMA_I2S2T_CFG, DMAI2S2TCFG_I2S2TIP_MSK, ((n) << 2))
#define DMA_I2S2_SetRxIntPriority(n)    MODIFY_REG(DMA_I2S2R_CFG, DMAI2S2RCFG_I2S2RIP_MSK, ((n) << 2))
#define DMA_PWMA_SetTxIntPriority(n)    MODIFY_REG(DMA_PWMAT_CFG, DMAPWMATCFG_PWMATIP_MSK, ((n) << 2))
#define DMA_PWMA_SetRxIntPriority(n)    MODIFY_REG(DMA_PWMAR_CFG, DMAPWMARCFG_PWMARIP_MSK, ((n) << 2))
#define DMA_CAN1_SetTxIntPriority(n)    MODIFY_REG(DMA_CAN1T_CFG, DMACAN1TCFG_CAN1TIP_MSK, ((n) << 2))
#define DMA_CAN1_SetRxIntPriority(n)    MODIFY_REG(DMA_CAN1R_CFG, DMACAN1RCFG_CAN1RIP_MSK, ((n) << 2))
#define DMA_CAN2_SetTxIntPriority(n)    MODIFY_REG(DMA_CAN2T_CFG, DMACAN2TCFG_CAN2TIP_MSK, ((n) << 2))
#define DMA_CAN2_SetRxIntPriority(n)    MODIFY_REG(DMA_CAN2R_CFG, DMACAN2RCFG_CAN2RIP_MSK, ((n) << 2))

/////////////////////////////////////////////////

#define EAXFR_MSK                       BIT7
#define EnableAccessXFR()               SET_REG_BIT(P_SW2, EAXFR_MSK)

#define AccessCodeSpeed(n)              WRITE_REG(WTST, (n))
#define AccessCodeFastest()             AccessCodeSpeed((SYSCLK) <=  32000000 ? 0 : \
                                                        (SYSCLK) <=  64000000 ? 1 : \
                                                        (SYSCLK) <=  90000000 ? 2 : \
                                                        (SYSCLK) <= 120000000 ? 3 : 4)

#define ACCIXRAM_MSK                    (BIT2 | BIT1 | BIT0)
#define AccessIXramSpeed(n)             MODIFY_REG(CKCON, ACCIXRAM_MSK, ((n) << 0))
#define AccessIXramFastest()            AccessIXramSpeed(0)

