fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define ACCEXRAM_MSK                    (BIT2 | BIT1 | BIT0)
#define AccessEXramSpeed(n)             MODIFY_REG(BUS_SPEED, ACCEXRAM_MSK, ((n) << 0))
#define AccessEXramFastest()            AccessEXramSpeed(0)

#define UART1_PS_MSK                    (BIT7 | BIT6)
#define UART1_SwitchP3031()             MODIFY_REG(P_SW1, UART1_PS_MSK, ((0) << 6))
#define UART1_SwitchP3637()             MODIFY_REG(P_SW1, UART1_PS_MSK, ((1) << 6))
#define UART1_SwitchP1617()             MODIFY_REG(P_SW1, UART1_PS_MSK, ((2) << 6))
#define UART1_SwitchP4344()             MODIFY_REG(P_SW1, UART1_PS_MSK, ((3) << 6))

#define UART2_PS_MSK                    (BIT0)
#define UART2_PS2_MSK                   (BIT5)
#define UART2_SwitchP1011()             CLR_REG_BIT(P_SW2, UART2_PS_MSK); CLR_REG_BIT(P_SWX1, UART2_PS2_MSK)
#define UART2_SwitchP4647()             SET_REG_BIT(P_SW2, UART2_PS_MSK); CLR_REG_BIT(P_SWX1, UART2_PS2_MSK)
#define UART2_SwitchP8485()             CLR_REG_BIT(P_SW2, UART2_PS_MSK); SET_REG_BIT(P_SWX1, UART2_PS2_MSK)
#define UART2_SwitchPA0A1()             SET_REG_BIT(P_SW2, UART2_PS_MSK); SET_REG_BIT(P_SWX1, UART2_PS2_MSK)

#define UART3_PS_MSK                    (BIT1)
#define UART3_PS2_MSK                   (BIT6)
#define UART3_SwitchP0001()             CLR_REG_BIT(P_SW2, UART3_PS_MSK); CLR_REG_BIT(P_SWX1, UART3_PS2_MSK)
#define UART3_SwitchP5051()             SET_REG_BIT(P_SW2, UART3_PS_MSK); CLR_REG_BIT(P_SWX1, UART3_PS2_MSK)
#define UART3_SwitchP8687()             CLR_REG_BIT(P_SW2, UART3_PS_MSK); SET_REG_BIT(P_SWX1, UART3_PS2_MSK)
#define UART3_SwitchPB6B7()             SET_REG_BIT(P_SW2, UART3_PS_MSK); SET_REG_BIT(P_SWX1, UART3_PS2_MSK)

#define UART4_PS_MSK                    (BIT2)
#define UART4_PS2_MSK                   (BIT7)
#define UART4_SwitchP0203()             CLR_REG_BIT(P_SW2, UART4_PS_MSK); CLR_REG_BIT(P_SWX1, UART4_PS2_MSK)
#define UART4_SwitchP5253()             SET_REG_BIT(P_SW2, UART4_PS_MSK); CLR_REG_BIT(P_SWX1, UART4_PS2_MSK)
#define UART4_SwitchPA2A3()             CLR_REG_BIT(P_SW2, UART4_PS_MSK); SET_REG_BIT(P_SWX1, UART4_PS2_MSK)
#define UART4_SwitchPC0C1()             SET_REG_BIT(P_SW2, UART4_PS_MSK); SET_REG_BIT(P_SWX1, UART4_PS2_MSK)

#define UART5_PS_MSK                    (BIT1 | BIT0)
#define UART5_SwitchP0405()             MODIFY_REG(P_SWX2, UART5_PS_MSK, ((0) << 0))
#define UART5_SwitchP4041()             MODIFY_REG(P_SWX2, UART5_PS_MSK, ((1) << 0))
#define UART5_SwitchP1415()             MODIFY_REG(P_SWX2, UART5_PS_MSK, ((2) << 0))
#define UART5_SwitchP2021()             MODIFY_REG(P_SWX2, UART5_PS_MSK, ((3) << 0))

#define UART6_PS_MSK                    (BIT3 | BIT2)
#define UART6_SwitchP0607()             MODIFY_REG(P_SWX2, UART6_PS_MSK, ((0) << 2))
#define UART6_SwitchP6263()             MODIFY_REG(P_SWX2, UART6_PS_MSK, ((1) << 2))
#define UART6_SwitchP3233()             MODIFY_REG(P_SWX2, UART6_PS_MSK, ((2) << 2))
#define UART6_SwitchP2627()             MODIFY_REG(P_SWX2, UART6_PS_MSK, ((3) << 2))

#define UART7_PS_MSK                    (BIT5 | BIT4)
#define UART7_SwitchP5051()             MODIFY_REG(P_SWX5, UART7_PS_MSK, ((0) << 4))
#define UART7_SwitchPA4A5()             MODIFY_REG(P_SWX5, UART7_PS_MSK, ((1) << 4))
#define UART7_SwitchP9091()             MODIFY_REG(P_SWX5, UART7_PS_MSK, ((2) << 4))
#define UART7_SwitchP1213()             MODIFY_REG(P_SWX5, UART7_PS_MSK, ((3) << 4))

#define UART8_PS_MSK                    (BIT7 | BIT6)
#define UART8_SwitchP5253()             MODIFY_REG(P_SWX5, UART8_PS_MSK, ((0) << 6))
#define UART8_SwitchPA6A7()             MODIFY_REG(P_SWX5, UART8_PS_MSK, ((1) << 6))
#define UART8_SwitchP9293()             MODIFY_REG(P_SWX5, UART8_PS_MSK, ((2) << 6))
#define UART8_SwitchP6061()             MODIFY_REG(P_SWX5, UART8_PS_MSK, ((3) << 6))

#define I2C_PS_MSK                      (BIT5 | BIT4)
#define I2C1_SwitchP1415()              MODIFY_REG(P_SW2, I2C_PS_MSK, ((0) << 4))
#define I2C1_SwitchP2425()              MODIFY_REG(P_SW2, I2C_PS_MSK, ((1) << 4))
#define I2C1_SwitchP7677()              MODIFY_REG(P_SW2, I2C_PS_MSK, ((2) << 4))
#define I2C1_SwitchP3332()              MODIFY_REG(P_SW2, I2C_PS_MSK, ((3) << 4))

#define I2C2_PS_MSK                     (BIT7 | BIT6)
#define I2C2_SwitchP2627()              MODIFY_REG(P_SWX4, I2C2_PS_MSK, ((0) << 6))
#define I2C2_SwitchP3637()              MODIFY_REG(P_SWX4, I2C2_PS_MSK, ((1) << 6))
#define I2C2_SwitchP1617()              MODIFY_REG(P_SWX4, I2C2_PS_MSK, ((2) << 6))
#define I2C2_SwitchP6061()              MODIFY_REG(P_SWX4, I2C2_PS_MSK, ((3) << 6))

#define SPI_PS_MSK                      (BIT3 | BIT2)
#define SPI1_SwitchP1n()                MODIFY_REG(P_SW1, SPI_PS_MSK, ((0) << 2))
#define SPI1_SwitchP2n()                MODIFY_REG(P_SW1, SPI_PS_MSK, ((1) << 2))
#define SPI1_SwitchP4n()                MODIFY_REG(P_SW1, SPI_PS_MSK, ((2) << 2))
#define SPI1_SwitchP3n()                MODIFY_REG(P_SW1, SPI_PS_MSK, ((3) << 2))

#define SPI2_PS_MSK                      (BIT1 | BIT0)
#define SPI2_SwitchP6n()                MODIFY_REG(P_SWX4, SPI2_PS_MSK, ((0) << 0))
#define SPI2_SwitchP0n()                MODIFY_REG(P_SWX4, SPI2_PS_MSK, ((1) << 0))
#define SPI2_SwitchPBn()                MODIFY_REG(P_SWX4, SPI2_PS_MSK, ((2) << 0))
#define SPI2_SwitchP8n()                MODIFY_REG(P_SWX4, SPI2_PS_MSK, ((3) << 0))

#define SPI3_PS_MSK                      (BIT3 | BIT2)
#define SPI3_SwitchP2n()                MODIFY_REG(P_SWX4, SPI3_PS_MSK, ((0) << 2))
#define SPI3_SwitchP7n()                MODIFY_REG(P_SWX4, SPI3_PS_MSK, ((1) << 2))
#define SPI3_SwitchP8n()                MODIFY_REG(P_SWX4, SPI3_PS_MSK, ((2) << 2))
#define SPI3_SwitchP9n()                MODIFY_REG(P_SWX4, SPI3_PS_MSK, ((3) << 2))

#define USART1_PS_MSK                   (BIT3 | BIT2)
#define USART1_SwitchP1n()              MODIFY_REG(P_SW3, USART1_PS_MSK, ((0) << 2))
#define USART1_SwitchP2n()              MODIFY_REG(P_SW3, USART1_PS_MSK, ((1) << 2))
#define USART1_SwitchP4n()              MODIFY_REG(P_SW3, USART1_PS_MSK, ((2) << 2))
#define USART1_SwitchP6n()              MODIFY_REG(P_SW3, USART1_PS_MSK, ((3) << 2))

#define USART2_PS_MSK                   (BIT5 | BIT4)
#define USART2_SwitchP1n()              MODIFY_REG(P_SW3, USART2_PS_MSK, ((0) << 4))
#define USART2_SwitchP2n()              MODIFY_REG(P_SW3, USART2_PS_MSK, ((1) << 4))
#define USART2_SwitchP4n()              MODIFY_REG(P_SW3, USART2_PS_MSK, ((2) << 4))
#define USART2_SwitchP7n()              MODIFY_REG(P_SW3, USART2_PS_MSK, ((3) << 4))

