fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define USART3_PS_MSK                   (BIT1 | BIT0)
#define USART3_SwitchP6n()              MODIFY_REG(P_SWX3, USART3_PS_MSK, ((0) << 0))
#define USART3_SwitchP0n()              MODIFY_REG(P_SWX3, USART3_PS_MSK, ((1) << 0))
#define USART3_SwitchPBn()              MODIFY_REG(P_SWX3, USART3_PS_MSK, ((2) << 0))
#define USART3_SwitchP9n()              MODIFY_REG(P_SWX3, USART3_PS_MSK, ((3) << 0))

#define USART4_PS_MSK                   (BIT3 | BIT2)
#define USART4_SwitchP6n()              MODIFY_REG(P_SWX3, USART4_PS_MSK, ((0) << 2))
#define USART4_SwitchP0n()              MODIFY_REG(P_SWX3, USART4_PS_MSK, ((1) << 2))
#define USART4_SwitchPBn()              MODIFY_REG(P_SWX3, USART4_PS_MSK, ((2) << 2))
#define USART4_SwitchP7n()              MODIFY_REG(P_SWX3, USART4_PS_MSK, ((3) << 2))

#define USART5_PS_MSK                   (BIT5 | BIT4)
#define USART5_SwitchP2n()              MODIFY_REG(P_SWX3, USART5_PS_MSK, ((0) << 4))
#define USART5_SwitchP7n()              MODIFY_REG(P_SWX3, USART5_PS_MSK, ((1) << 4))
#define USART5_SwitchP8n()              MODIFY_REG(P_SWX3, USART5_PS_MSK, ((2) << 4))
#define USART5_SwitchP9n()              MODIFY_REG(P_SWX3, USART5_PS_MSK, ((3) << 4))

#define USART6_PS_MSK                   (BIT7 | BIT6)
#define USART6_SwitchP2n()              MODIFY_REG(P_SWX3, USART6_PS_MSK, ((0) << 6))
#define USART6_SwitchP7n()              MODIFY_REG(P_SWX3, USART6_PS_MSK, ((1) << 6))
#define USART6_SwitchP8n()              MODIFY_REG(P_SWX3, USART6_PS_MSK, ((2) << 6))
#define USART6_SwitchP9n()              MODIFY_REG(P_SWX3, USART6_PS_MSK, ((3) << 6))

#define USART7_PS_MSK                   (BIT1 | BIT0)
#define USART7_SwitchP5n()              MODIFY_REG(P_SWX6, USART7_PS_MSK, ((0) << 0))
#define USART7_SwitchPAn()              MODIFY_REG(P_SWX6, USART7_PS_MSK, ((1) << 0))
#define USART7_SwitchP7n()              MODIFY_REG(P_SWX6, USART7_PS_MSK, ((2) << 0))

#define USART8_PS_MSK                   (BIT3 | BIT2)
#define USART8_SwitchP5n()              MODIFY_REG(P_SWX6, USART8_PS_MSK, ((0) << 2))
#define USART8_SwitchPAn()              MODIFY_REG(P_SWX6, USART8_PS_MSK, ((1) << 2))
#define USART8_SwitchP7n()              MODIFY_REG(P_SWX6, USART8_PS_MSK, ((2) << 2))
#define USART8_SwitchP6n()              MODIFY_REG(P_SWX6, USART8_PS_MSK, ((3) << 2))

#define I2S_PS_MSK                      (BIT7 | BIT6)
#define I2S1_SwitchP3n()                MODIFY_REG(P_SW3, I2S_PS_MSK, ((0) << 6))
#define I2S1_SwitchP6n()                MODIFY_REG(P_SW3, I2S_PS_MSK, ((1) << 6))
#define I2S1_SwitchP2n()                MODIFY_REG(P_SW3, I2S_PS_MSK, ((2) << 6))
#define I2S1_SwitchP4n()                MODIFY_REG(P_SW3, I2S_PS_MSK, ((3) << 6))

#define I2S2_PS_MSK                     (BIT3 | BIT2)
#define I2S2_SwitchP5n()                MODIFY_REG(P_SWX5, I2S2_PS_MSK, ((0) << 2))
#define I2S2_SwitchP6n()                MODIFY_REG(P_SWX5, I2S2_PS_MSK, ((1) << 2))
#define I2S2_SwitchP8n()                MODIFY_REG(P_SWX5, I2S2_PS_MSK, ((2) << 2))
#define I2S2_SwitchPBn()                MODIFY_REG(P_SWX5, I2S2_PS_MSK, ((3) << 2))

#define QSPI_PS_MSK                     (BIT1 | BIT0)
#define QSPI_SwitchP1n()                MODIFY_REG(P_SW4, QSPI_PS_MSK, ((0) << 0))
#define QSPI_SwitchP4n()                MODIFY_REG(P_SW4, QSPI_PS_MSK, ((1) << 0))
#define QSPI_SwitchP7n()                MODIFY_REG(P_SW4, QSPI_PS_MSK, ((2) << 0))

#define CMP1O_PS_MSK                    (BIT1 | BIT0)
#define CMP1O_SwitchP34()               MODIFY_REG(CMP1_6P6N_CR4, CMP1O_PS_MSK, ((0) << 0))
#define CMP1O_SwitchP41()               MODIFY_REG(CMP1_6P6N_CR4, CMP1O_PS_MSK, ((1) << 0))

#define CMP1NS_MSK                      (BIT5 | BIT4 | BIT3)
#define CMP1N_SwitchP36()               MODIFY_REG(CMP1_6P6N_CR3, CMP1NS_MSK, ((0) << 3))
#define CMP1N_SwitchP51()               MODIFY_REG(CMP1_6P6N_CR3, CMP1NS_MSK, ((1) << 3))
#define CMP1N_SwitchOP2O()              MODIFY_REG(CMP1_6P6N_CR3, CMP1NS_MSK, ((2) << 3))
#define CMP1N_SwitchREFV()              MODIFY_REG(CMP1_6P6N_CR3, CMP1NS_MSK, ((3) << 3))
#define CMP1N_SwitchDAC1O()             MODIFY_REG(CMP1_6P6N_CR3, CMP1NS_MSK, ((4) << 3))
#define CMP1N_SwitchDAC2O()             MODIFY_REG(CMP1_6P6N_CR3, CMP1NS_MSK, ((5) << 3))

#define CMP1PS_MSK                      (BIT2 | BIT1 | BIT0)
#define CMP1P_SwitchP37()               MODIFY_REG(CMP1_6P6N_CR3, CMP1PS_MSK, ((0) << 0))
#define CMP1P_SwitchP50()               MODIFY_REG(CMP1_6P6N_CR3, CMP1PS_MSK, ((1) << 0))
#define CMP1P_SwitchOP1O()              MODIFY_REG(CMP1_6P6N_CR3, CMP1PS_MSK, ((2) << 0))
#define CMP1P_SwitchADC1IN()            MODIFY_REG(CMP1_6P6N_CR3, CMP1PS_MSK, ((3) << 0))
#define CMP1P_SwitchDAC1O()             MODIFY_REG(CMP1_6P6N_CR3, CMP1PS_MSK, ((4) << 0))
#define CMP1P_SwitchDAC2O()             MODIFY_REG(CMP1_6P6N_CR3, CMP1PS_MSK, ((5) << 0))

#define CMP2O_PS_MSK                    (BIT1 | BIT0)
#define CMP2O_SwitchP47()               MODIFY_REG(CMP2_6P6N_CR4, CMP2O_PS_MSK, ((0) << 0))
#define CMP2O_SwitchP40()               MODIFY_REG(CMP2_6P6N_CR4, CMP2O_PS_MSK, ((1) << 0))

#define CMP2NS_MSK                      (BIT5 | BIT4 | BIT3)
#define CMP2N_SwitchP66()               MODIFY_REG(CMP2_6P6N_CR3, CMP2NS_MSK, ((0) << 3))
#define CMP2N_SwitchP11()               MODIFY_REG(CMP2_6P6N_CR3, CMP2NS_MSK, ((1) << 3))
#define CMP2N_SwitchOP3O()              MODIFY_REG(CMP2_6P6N_CR3, CMP2NS_MSK, ((2) << 3))
#define CMP2N_SwitchREFV()              MODIFY_REG(CMP2_6P6N_CR3, CMP2NS_MSK, ((3) << 3))
#define CMP2N_SwitchDAC1O()             MODIFY_REG(CMP2_6P6N_CR3, CMP2NS_MSK, ((4) << 3))
#define CMP2N_SwitchDAC2O()             MODIFY_REG(CMP2_6P6N_CR3, CMP2NS_MSK, ((5) << 3))

#define CMP2PS_MSK                      (BIT2 | BIT1 | BIT0)
#define CMP2P_SwitchP67()               MODIFY_REG(CMP2_6P6N_CR3, CMP2PS_MSK, ((0) << 0))
#define CMP2P_SwitchP10()               MODIFY_REG(CMP2_6P6N_CR3, CMP2PS_MSK, ((1) << 0))
#define CMP2P_SwitchOP2O()              MODIFY_REG(CMP2_6P6N_CR3, CMP2PS_MSK, ((2) << 0))
#define CMP2P_SwitchADC1IN()            MODIFY_REG(CMP2_6P6N_CR3, CMP2PS_MSK, ((3) << 0))
#define CMP2P_SwitchDAC1O()             MODIFY_REG(CMP2_6P6N_CR3, CMP2PS_MSK, ((4) << 0))
#define CMP2P_SwitchDAC2O()             MODIFY_REG(CMP2_6P6N_CR3, CMP2PS_MSK, ((5) << 0))

