fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CMP3O_PS_MSK                    (BIT1 | BIT0)
#define CMP3O_SwitchP24()               MODIFY_REG(CMP3_6P6N_CR4, CMP3O_PS_MSK, ((0) << 0))
#define CMP3O_SwitchP45()               MODIFY_REG(CMP3_6P6N_CR4, CMP3O_PS_MSK, ((1) << 0))

#define CMP3NS_MSK                      (BIT5 | BIT4 | BIT3)
#define CMP3N_SwitchP76()               MODIFY_REG(CMP3_6P6N_CR3, CMP3NS_MSK, ((0) << 3))
#define CMP3N_SwitchP52()               MODIFY_REG(CMP3_6P6N_CR3, CMP3NS_MSK, ((1) << 3))
#define CMP3N_SwitchOP4O()              MODIFY_REG(CMP3_6P6N_CR3, CMP3NS_MSK, ((2) << 3))
#define CMP3N_SwitchREFV()              MODIFY_REG(CMP3_6P6N_CR3, CMP3NS_MSK, ((3) << 3))
#define CMP3N_SwitchDAC1O()             MODIFY_REG(CMP3_6P6N_CR3, CMP3NS_MSK, ((4) << 3))
#define CMP3N_SwitchDAC2O()             MODIFY_REG(CMP3_6P6N_CR3, CMP3NS_MSK, ((5) << 3))

#define CMP3PS_MSK                      (BIT2 | BIT1 | BIT0)
#define CMP3P_SwitchP77()               MODIFY_REG(CMP3_6P6N_CR3, CMP3PS_MSK, ((0) << 0))
#define CMP3P_SwitchP53()               MODIFY_REG(CMP3_6P6N_CR3, CMP3PS_MSK, ((1) << 0))
#define CMP3P_SwitchOP3O()              MODIFY_REG(CMP3_6P6N_CR3, CMP3PS_MSK, ((2) << 0))
#define CMP3P_SwitchADC2IN()            MODIFY_REG(CMP3_6P6N_CR3, CMP3PS_MSK, ((3) << 0))
#define CMP3P_SwitchDAC1O()             MODIFY_REG(CMP3_6P6N_CR3, CMP3PS_MSK, ((4) << 0))
#define CMP3P_SwitchDAC2O()             MODIFY_REG(CMP3_6P6N_CR3, CMP3PS_MSK, ((5) << 0))

#define CMP4O_PS_MSK                    (BIT1 | BIT0)
#define CMP4O_SwitchP25()               MODIFY_REG(CMP4_6P6N_CR4, CMP4O_PS_MSK, ((0) << 0))
#define CMP4O_SwitchP46()               MODIFY_REG(CMP4_6P6N_CR4, CMP4O_PS_MSK, ((1) << 0))

#define CMP4NS_MSK                      (BIT5 | BIT4 | BIT3)
#define CMP4N_SwitchP26()               MODIFY_REG(CMP4_6P6N_CR3, CMP4NS_MSK, ((0) << 3))
#define CMP4N_SwitchP44()               MODIFY_REG(CMP4_6P6N_CR3, CMP4NS_MSK, ((1) << 3))
#define CMP4N_SwitchOP1O()              MODIFY_REG(CMP4_6P6N_CR3, CMP4NS_MSK, ((2) << 3))
#define CMP4N_SwitchREFV()              MODIFY_REG(CMP4_6P6N_CR3, CMP4NS_MSK, ((3) << 3))
#define CMP4N_SwitchDAC1O()             MODIFY_REG(CMP4_6P6N_CR3, CMP4NS_MSK, ((4) << 3))
#define CMP4N_SwitchDAC2O()             MODIFY_REG(CMP4_6P6N_CR3, CMP4NS_MSK, ((5) << 3))

#define CMP4PS_MSK                      (BIT2 | BIT1 | BIT0)
#define CMP4P_SwitchP27()               MODIFY_REG(CMP4_6P6N_CR3, CMP4PS_MSK, ((0) << 0))
#define CMP4P_SwitchP43()               MODIFY_REG(CMP4_6P6N_CR3, CMP4PS_MSK, ((1) << 0))
#define CMP4P_SwitchOP4O()              MODIFY_REG(CMP4_6P6N_CR3, CMP4PS_MSK, ((2) << 0))
#define CMP4P_SwitchADC2IN()            MODIFY_REG(CMP4_6P6N_CR3, CMP4PS_MSK, ((3) << 0))
#define CMP4P_SwitchDAC1O()             MODIFY_REG(CMP4_6P6N_CR3, CMP4PS_MSK, ((4) << 0))
#define CMP4P_SwitchDAC2O()             MODIFY_REG(CMP4_6P6N_CR3, CMP4PS_MSK, ((5) << 0))

#define PGA1O_PS_MSK                    (BIT5 | BIT4)
#define PGA1O_SwitchP07()               MODIFY_REG(PGA1_CR1, PGA1O_PS_MSK, ((0) << 4))
#define PGA1O_SwitchP00()               MODIFY_REG(PGA1_CR1, PGA1O_PS_MSK, ((1) << 4))
#define PGA1O_SwitchP74()               MODIFY_REG(PGA1_CR1, PGA1O_PS_MSK, ((2) << 4))
#define PGA1O_SwitchP63()               MODIFY_REG(PGA1_CR1, PGA1O_PS_MSK, ((3) << 4))

#define PGA1NS_MSK                      (BIT3 | BIT2)
#define PGA1N_SwitchP05()               MODIFY_REG(PGA1_CR1, PGA1NS_MSK, ((0) << 2))
#define PGA1N_SwitchP04()               MODIFY_REG(PGA1_CR1, PGA1NS_MSK, ((1) << 2))
#define PGA1N_SwitchP61()               MODIFY_REG(PGA1_CR1, PGA1NS_MSK, ((2) << 2))
#define PGA1N_SwitchDAC1O()             MODIFY_REG(PGA1_CR1, PGA1NS_MSK, ((3) << 2))

#define PGA1PS_MSK                      (BIT1 | BIT0)
#define PGA1P_SwitchP04()               MODIFY_REG(PGA1_CR1, PGA1PS_MSK, ((0) << 0))
#define PGA1P_SwitchP05()               MODIFY_REG(PGA1_CR1, PGA1PS_MSK, ((1) << 0))
#define PGA1P_SwitchP60()               MODIFY_REG(PGA1_CR1, PGA1PS_MSK, ((2) << 0))
#define PGA1P_SwitchDAC1O()             MODIFY_REG(PGA1_CR1, PGA1PS_MSK, ((3) << 0))

#define PGA2O_PS_MSK                    (BIT5 | BIT4)
#define PGA2O_SwitchP42()               MODIFY_REG(PGA2_CR1, PGA2O_PS_MSK, ((0) << 4))
#define PGA2O_SwitchP00()               MODIFY_REG(PGA2_CR1, PGA2O_PS_MSK, ((1) << 4))
#define PGA2O_SwitchP74()               MODIFY_REG(PGA2_CR1, PGA2O_PS_MSK, ((2) << 4))
#define PGA2O_SwitchP62()               MODIFY_REG(PGA2_CR1, PGA2O_PS_MSK, ((3) << 4))

#define PGA2NS_MSK                      (BIT3 | BIT2)
#define PGA2N_SwitchP27()               MODIFY_REG(PGA2_CR1, PGA2NS_MSK, ((0) << 2))
#define PGA2N_SwitchP81()               MODIFY_REG(PGA2_CR1, PGA2NS_MSK, ((1) << 2))
#define PGA2N_SwitchP76()               MODIFY_REG(PGA2_CR1, PGA2NS_MSK, ((2) << 2))
#define PGA2N_SwitchDAC2O()             MODIFY_REG(PGA2_CR1, PGA2NS_MSK, ((3) << 2))

#define PGA2PS_MSK                      (BIT1 | BIT0)
#define PGA2P_SwitchP26()               MODIFY_REG(PGA2_CR1, PGA2PS_MSK, ((0) << 0))
#define PGA2P_SwitchP80()               MODIFY_REG(PGA2_CR1, PGA2PS_MSK, ((1) << 0))
#define PGA2P_SwitchP75()               MODIFY_REG(PGA2_CR1, PGA2PS_MSK, ((2) << 0))
#define PGA2P_SwitchP77()               MODIFY_REG(PGA2_CR1, PGA2PS_MSK, ((3) << 0))

#define PGA3O_PS_MSK                    (BIT5 | BIT4)
#define PGA3O_SwitchP32()               MODIFY_REG(PGA3_CR1, PGA3O_PS_MSK, ((0) << 4))
#define PGA3O_SwitchP21()               MODIFY_REG(PGA3_CR1, PGA3O_PS_MSK, ((1) << 4))
#define PGA3O_SwitchP74()               MODIFY_REG(PGA3_CR1, PGA3O_PS_MSK, ((2) << 4))
#define PGA3O_SwitchP50()               MODIFY_REG(PGA3_CR1, PGA3O_PS_MSK, ((3) << 4))

#define PGA3NS_MSK                      (BIT3 | BIT2)
#define PGA3N_SwitchP51()               MODIFY_REG(PGA3_CR1, PGA3NS_MSK, ((0) << 2))
#define PGA3N_SwitchP42()               MODIFY_REG(PGA3_CR1, PGA3NS_MSK, ((1) << 2))
#define PGA3N_SwitchP71()               MODIFY_REG(PGA3_CR1, PGA3NS_MSK, ((2) << 2))
#define PGA3N_SwitchDAC2O()             MODIFY_REG(PGA3_CR1, PGA3NS_MSK, ((3) << 2))

#define PGA3PS_MSK                      (BIT1 | BIT0)
#define PGA3P_SwitchP35()               MODIFY_REG(PGA3_CR1, PGA3PS_MSK, ((0) << 0))
#define PGA3P_SwitchP20()               MODIFY_REG(PGA3_CR1, PGA3PS_MSK, ((1) << 0))
#define PGA3P_SwitchP70()               MODIFY_REG(PGA3_CR1, PGA3PS_MSK, ((2) << 0))
#define PGA3P_SwitchDAC2O()             MODIFY_REG(PGA3_CR1, PGA3PS_MSK, ((3) << 0))

#define PGA4O_PS_MSK                    (BIT5 | BIT4)
#define PGA4O_SwitchP13()               MODIFY_REG(PGA4_CR1, PGA4O_PS_MSK, ((0) << 4))
#define PGA4O_SwitchP40()               MODIFY_REG(PGA4_CR1, PGA4O_PS_MSK, ((1) << 4))
#define PGA4O_SwitchP74()               MODIFY_REG(PGA4_CR1, PGA4O_PS_MSK, ((2) << 4))
#define PGA4O_SwitchP63()               MODIFY_REG(PGA4_CR1, PGA4O_PS_MSK, ((3) << 4))

#define PGA4NS_MSK                      (BIT3 | BIT2)
#define PGA4N_SwitchP17()               MODIFY_REG(PGA4_CR1, PGA4NS_MSK, ((0) << 2))
#define PGA4N_SwitchP65()               MODIFY_REG(PGA4_CR1, PGA4NS_MSK, ((1) << 2))
#define PGA4N_SwitchP33()               MODIFY_REG(PGA4_CR1, PGA4NS_MSK, ((2) << 2))
#define PGA4N_SwitchDAC1O()             MODIFY_REG(PGA4_CR1, PGA4NS_MSK, ((3) << 2))

#define PGA4PS_MSK                      (BIT1 | BIT0)
#define PGA4P_SwitchP16()               MODIFY_REG(PGA4_CR1, PGA4PS_MSK, ((0) << 0))
#define PGA4P_SwitchP63()               MODIFY_REG(PGA4_CR1, PGA4PS_MSK, ((1) << 0))
#define PGA4P_SwitchP64()               MODIFY_REG(PGA4_CR1, PGA4PS_MSK, ((2) << 0))
#define PGA4P_SwitchDAC2O()             MODIFY_REG(PGA4_CR1, PGA4PS_MSK, ((3) << 0))

#define MCLKO_PS_MSK                    (BIT7)
#define CLK_MCLKO_SwitchP54()           CLR_REG_BIT(MCLKOCR, MCLKO_PS_MSK)
#define CLK_MCLKO_SwitchP16()           SET_REG_BIT(MCLKOCR, MCLKO_PS_MSK)

#define PWMA_C1PS_MSK                   (BIT1 | BIT0)
#define PWMA_C1SwitchP1011()            MODIFY_REG(PWMA_PS, PWMA_C1PS_MSK, ((0) << 0))
#define PWMA_C1SwitchP2021()            MODIFY_REG(PWMA_PS, PWMA_C1PS_MSK, ((1) << 0))
#define PWMA_C1SwitchP6061()            MODIFY_REG(PWMA_PS, PWMA_C1PS_MSK, ((2) << 0))

#define HSPWMA_C1SwitchP1011()          PWMA_C1SwitchP1011()
#define HSPWMA_C1SwitchP2021()          PWMA_C1SwitchP2021()
#define HSPWMA_C1SwitchP6061()          PWMA_C1SwitchP6061()

