fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMA_C2PS_MSK                   (BIT3 | BIT2)
#define PWMA_C2SwitchP1213()            MODIFY_REG(PWMA_PS, PWMA_C2PS_MSK, ((0) << 2))
#define PWMA_C2SwitchP2223()            MODIFY_REG(PWMA_PS, PWMA_C2PS_MSK, ((1) << 2))
#define PWMA_C2SwitchP6263()            MODIFY_REG(PWMA_PS, PWMA_C2PS_MSK, ((2) << 2))

#define HSPWMA_C2SwitchP1213()          PWMA_C2SwitchP1213()
#define HSPWMA_C2SwitchP2223()          PWMA_C2SwitchP2223()
#define HSPWMA_C2SwitchP6263()          PWMA_C2SwitchP6263()

#define PWMA_C3PS_MSK                   (BIT5 | BIT4)
#define PWMA_C3SwitchP1415()            MODIFY_REG(PWMA_PS, PWMA_C3PS_MSK, ((0) << 4))
#define PWMA_C3SwitchP2425()            MODIFY_REG(PWMA_PS, PWMA_C3PS_MSK, ((1) << 4))
#define PWMA_C3SwitchP6465()            MODIFY_REG(PWMA_PS, PWMA_C3PS_MSK, ((2) << 4))

#define HSPWMA_C3SwitchP1415()          PWMA_C3SwitchP1415()
#define HSPWMA_C3SwitchP2425()          PWMA_C3SwitchP2425()
#define HSPWMA_C3SwitchP6465()          PWMA_C3SwitchP6465()

#define PWMA_C4PS_MSK                   (BIT7 | BIT6)
#define PWMA_C4SwitchP1617()            MODIFY_REG(PWMA_PS, PWMA_C4PS_MSK, ((0) << 6))
#define PWMA_C4SwitchP2627()            MODIFY_REG(PWMA_PS, PWMA_C4PS_MSK, ((1) << 6))
#define PWMA_C4SwitchP6667()            MODIFY_REG(PWMA_PS, PWMA_C4PS_MSK, ((2) << 6))
#define PWMA_C4SwitchP3433()            MODIFY_REG(PWMA_PS, PWMA_C4PS_MSK, ((3) << 6))

#define HSPWMA_C4SwitchP1617()          PWMA_C4SwitchP1617()
#define HSPWMA_C4SwitchP2627()          PWMA_C4SwitchP2627()
#define HSPWMA_C4SwitchP6667()          PWMA_C4SwitchP6667()
#define HSPWMA_C4SwitchP3433()          PWMA_C4SwitchP3433()

#define PWMA_C5PS_MSK                   (BIT1 | BIT0)
#define PWMA_C5SwitchP46()              MODIFY_REG(PWMA_PS2, PWMA_C5PS_MSK, ((0) << 0))
#define PWMA_C5SwitchP04()              MODIFY_REG(PWMA_PS2, PWMA_C5PS_MSK, ((1) << 0))
#define PWMA_C5SwitchP72()              MODIFY_REG(PWMA_PS2, PWMA_C5PS_MSK, ((2) << 0))
#define PWMA_C5SwitchP13()              MODIFY_REG(PWMA_PS2, PWMA_C5PS_MSK, ((3) << 0))

#define HSPWMA_C5SwitchP46()            PWMA_C5SwitchP46()
#define HSPWMA_C5SwitchP04()            PWMA_C5SwitchP04()
#define HSPWMA_C5SwitchP72()            PWMA_C5SwitchP72()
#define HSPWMA_C5SwitchP13()            PWMA_C5SwitchP13()

#define PWMA_C6PS_MSK                   (BIT3 | BIT2)
#define PWMA_C6SwitchP47()              MODIFY_REG(PWMA_PS2, PWMA_C6PS_MSK, ((0) << 2))
#define PWMA_C6SwitchP05()              MODIFY_REG(PWMA_PS2, PWMA_C6PS_MSK, ((1) << 2))
#define PWMA_C6SwitchP73()              MODIFY_REG(PWMA_PS2, PWMA_C6PS_MSK, ((2) << 2))
#define PWMA_C6SwitchP15()              MODIFY_REG(PWMA_PS2, PWMA_C6PS_MSK, ((3) << 2))

#define HSPWMA_C6SwitchP47()            PWMA_C6SwitchP47()
#define HSPWMA_C6SwitchP05()            PWMA_C6SwitchP05()
#define HSPWMA_C6SwitchP73()            PWMA_C6SwitchP73()
#define HSPWMA_C6SwitchP15()            PWMA_C6SwitchP15()

#define PWMB_C5PS_MSK                   (BIT1 | BIT0)
#define PWMB_C5SwitchP20()              MODIFY_REG(PWMB_PS, PWMB_C5PS_MSK, ((0) << 0))
#define PWMB_C5SwitchP17()              MODIFY_REG(PWMB_PS, PWMB_C5PS_MSK, ((1) << 0))
#define PWMB_C5SwitchP00()              MODIFY_REG(PWMB_PS, PWMB_C5PS_MSK, ((2) << 0))
#define PWMB_C5SwitchP74()              MODIFY_REG(PWMB_PS, PWMB_C5PS_MSK, ((3) << 0))

#define HSPWMB_C5SwitchP20()            PWMB_C5SwitchP20()
#define HSPWMB_C5SwitchP17()            PWMB_C5SwitchP17()
#define HSPWMB_C5SwitchP00()            PWMB_C5SwitchP00()
#define HSPWMB_C5SwitchP74()            PWMB_C5SwitchP74()

#define PWMB_C6PS_MSK                   (BIT3 | BIT2)
#define PWMB_C6SwitchP21()              MODIFY_REG(PWMB_PS, PWMB_C6PS_MSK, ((0) << 2))
#define PWMB_C6SwitchP54()              MODIFY_REG(PWMB_PS, PWMB_C6PS_MSK, ((1) << 2))
#define PWMB_C6SwitchP01()              MODIFY_REG(PWMB_PS, PWMB_C6PS_MSK, ((2) << 2))
#define PWMB_C6SwitchP75()              MODIFY_REG(PWMB_PS, PWMB_C6PS_MSK, ((3) << 2))

#define HSPWMB_C6SwitchP21()            PWMB_C6SwitchP21()
#define HSPWMB_C6SwitchP54()            PWMB_C6SwitchP54()
#define HSPWMB_C6SwitchP01()            PWMB_C6SwitchP01()
#define HSPWMB_C6SwitchP75()            PWMB_C6SwitchP75()

#define PWMB_C7PS_MSK                   (BIT5 | BIT4)
#define PWMB_C7SwitchP22()              MODIFY_REG(PWMB_PS, PWMB_C7PS_MSK, ((0) << 4))
#define PWMB_C7SwitchP33()              MODIFY_REG(PWMB_PS, PWMB_C7PS_MSK, ((1) << 4))
#define PWMB_C7SwitchP02()              MODIFY_REG(PWMB_PS, PWMB_C7PS_MSK, ((2) << 4))
#define PWMB_C7SwitchP76()              MODIFY_REG(PWMB_PS, PWMB_C7PS_MSK, ((3) << 4))

#define HSPWMB_C7SwitchP22()            PWMB_C7SwitchP22()
#define HSPWMB_C7SwitchP33()            PWMB_C7SwitchP33()
#define HSPWMB_C7SwitchP02()            PWMB_C7SwitchP02()
#define HSPWMB_C7SwitchP76()            PWMB_C7SwitchP76()

#define PWMB_C8PS_MSK                   (BIT7 | BIT6)
#define PWMB_C8SwitchP23()              MODIFY_REG(PWMB_PS, PWMB_C8PS_MSK, ((0) << 6))
#define PWMB_C8SwitchP34()              MODIFY_REG(PWMB_PS, PWMB_C8PS_MSK, ((1) << 6))
#define PWMB_C8SwitchP03()              MODIFY_REG(PWMB_PS, PWMB_C8PS_MSK, ((2) << 6))
#define PWMB_C8SwitchP77()              MODIFY_REG(PWMB_PS, PWMB_C8PS_MSK, ((3) << 6))

#define HSPWMB_C8SwitchP23()            PWMB_C8SwitchP23()
#define HSPWMB_C8SwitchP34()            PWMB_C8SwitchP34()
#define HSPWMB_C8SwitchP03()            PWMB_C8SwitchP03()
#define HSPWMB_C8SwitchP77()            PWMB_C8SwitchP77()

#define PWMC_C1PS_MSK                   (BIT1 | BIT0)
#define PWMC_C1SwitchP6061()            MODIFY_REG(PWMC_PS, PWMC_C1PS_MSK, ((0) << 0))
#define PWMC_C1SwitchP8081()            MODIFY_REG(PWMC_PS, PWMC_C1PS_MSK, ((1) << 0))
#define PWMC_C1SwitchP4041()            MODIFY_REG(PWMC_PS, PWMC_C1PS_MSK, ((2) << 0))
#define PWMC_C1SwitchPB0B1()            MODIFY_REG(PWMC_PS, PWMC_C1PS_MSK, ((3) << 0))

#define HSPWMC_C1SwitchP6061()          PWMC_C1SwitchP6061()
#define HSPWMC_C1SwitchP8081()          PWMC_C1SwitchP8081()
#define HSPWMC_C1SwitchP4041()          PWMC_C1SwitchP4041()
#define HSPWMC_C1SwitchPB0B1()          PWMC_C1SwitchPB0B1()

#define PWMC_C2PS_MSK                   (BIT3 | BIT2)
#define PWMC_C2SwitchP6263()            MODIFY_REG(PWMC_PS, PWMC_C2PS_MSK, ((0) << 2))
#define PWMC_C2SwitchP8283()            MODIFY_REG(PWMC_PS, PWMC_C2PS_MSK, ((1) << 2))
#define PWMC_C2SwitchP4243()            MODIFY_REG(PWMC_PS, PWMC_C2PS_MSK, ((2) << 2))
#define PWMC_C2SwitchPB2B3()            MODIFY_REG(PWMC_PS, PWMC_C2PS_MSK, ((3) << 2))

#define HSPWMC_C2SwitchP6263()          PWMC_C2SwitchP6263()
#define HSPWMC_C2SwitchP8283()          PWMC_C2SwitchP8283()
#define HSPWMC_C2SwitchP4243()          PWMC_C2SwitchP4243()
#define HSPWMC_C2SwitchPB2B3()          PWMC_C2SwitchPB2B3()

