fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMC_C3PS_MSK                   (BIT5 | BIT4)
#define PWMC_C3SwitchP6465()            MODIFY_REG(PWMC_PS, PWMC_C3PS_MSK, ((0) << 4))
#define PWMC_C3SwitchP8485()            MODIFY_REG(PWMC_PS, PWMC_C3PS_MSK, ((1) << 4))
#define PWMC_C3SwitchP4445()            MODIFY_REG(PWMC_PS, PWMC_C3PS_MSK, ((2) << 4))
#define PWMC_C3SwitchPB4B5()            MODIFY_REG(PWMC_PS, PWMC_C3PS_MSK, ((3) << 4))

#define HSPWMC_C3SwitchP6465()          PWMC_C3SwitchP6465()
#define HSPWMC_C3SwitchP8485()          PWMC_C3SwitchP8485()
#define HSPWMC_C3SwitchP4445()          PWMC_C3SwitchP4445()
#define HSPWMC_C3SwitchPB4B5()          PWMC_C3SwitchPB4B5()

#define PWMC_C4PS_MSK                   (BIT7 | BIT6)
#define PWMC_C4SwitchP6667()            MODIFY_REG(PWMC_PS, PWMC_C4PS_MSK, ((0) << 6))
#define PWMC_C4SwitchP8687()            MODIFY_REG(PWMC_PS, PWMC_C4PS_MSK, ((1) << 6))
#define PWMC_C4SwitchP4647()            MODIFY_REG(PWMC_PS, PWMC_C4PS_MSK, ((2) << 6))
#define PWMC_C4SwitchPB6B7()            MODIFY_REG(PWMC_PS, PWMC_C4PS_MSK, ((3) << 6))

#define HSPWMC_C4SwitchP6667()          PWMC_C4SwitchP6667()
#define HSPWMC_C4SwitchP8687()          PWMC_C4SwitchP8687()
#define HSPWMC_C4SwitchP4647()          PWMC_C4SwitchP4647()
#define HSPWMC_C4SwitchPB6B7()          PWMC_C4SwitchPB6B7()

#define PWMC_C5PS_MSK                   (BIT1 | BIT0)
#define PWMC_C5SwitchP11()              MODIFY_REG(PWMC_PS2, PWMC_C5PS_MSK, ((0) << 0))
#define PWMC_C5SwitchP36()              MODIFY_REG(PWMC_PS2, PWMC_C5PS_MSK, ((1) << 0))
#define PWMC_C5SwitchP96()              MODIFY_REG(PWMC_PS2, PWMC_C5PS_MSK, ((2) << 0))
#define PWMC_C5SwitchP63()              MODIFY_REG(PWMC_PS2, PWMC_C5PS_MSK, ((3) << 0))

#define HSPWMC_C5SwitchP11()            PWMC_C5SwitchP11()
#define HSPWMC_C5SwitchP36()            PWMC_C5SwitchP36()
#define HSPWMC_C5SwitchP96()            PWMC_C5SwitchP96()
#define HSPWMC_C5SwitchP63()            PWMC_C5SwitchP63()

#define PWMC_C6PS_MSK                   (BIT3 | BIT2)
#define PWMC_C6SwitchP17()              MODIFY_REG(PWMC_PS2, PWMC_C6PS_MSK, ((0) << 2))
#define PWMC_C6SwitchP37()              MODIFY_REG(PWMC_PS2, PWMC_C6PS_MSK, ((1) << 2))
#define PWMC_C6SwitchP97()              MODIFY_REG(PWMC_PS2, PWMC_C6PS_MSK, ((2) << 2))
#define PWMC_C6SwitchP65()              MODIFY_REG(PWMC_PS2, PWMC_C6PS_MSK, ((3) << 2))

#define HSPWMC_C6SwitchP17()            PWMC_C6SwitchP17()
#define HSPWMC_C6SwitchP37()            PWMC_C6SwitchP37()
#define HSPWMC_C6SwitchP97()            PWMC_C6SwitchP97()
#define HSPWMC_C6SwitchP65()            PWMC_C6SwitchP65()

#define PWMD_C5PS_MSK                   (BIT1 | BIT0)
#define PWMD_C5SwitchP24()              MODIFY_REG(PWMD_PS, PWMD_C5PS_MSK, ((0) << 0))
#define PWMD_C5SwitchP81()              MODIFY_REG(PWMD_PS, PWMD_C5PS_MSK, ((1) << 0))
#define PWMD_C5SwitchP50()              MODIFY_REG(PWMD_PS, PWMD_C5PS_MSK, ((2) << 0))
#define PWMD_C5SwitchPB4()              MODIFY_REG(PWMD_PS, PWMD_C5PS_MSK, ((3) << 0))

#define HSPWMD_C5SwitchP24()            PWMD_C5SwitchP24()
#define HSPWMD_C5SwitchP81()            PWMD_C5SwitchP81()
#define HSPWMD_C5SwitchP50()            PWMD_C5SwitchP50()
#define HSPWMD_C5SwitchPB4()            PWMD_C5SwitchPB4()

#define PWMD_C6PS_MSK                   (BIT3 | BIT2)
#define PWMD_C6SwitchP25()              MODIFY_REG(PWMD_PS, PWMD_C6PS_MSK, ((0) << 2))
#define PWMD_C6SwitchP83()              MODIFY_REG(PWMD_PS, PWMD_C6PS_MSK, ((1) << 2))
#define PWMD_C6SwitchP51()              MODIFY_REG(PWMD_PS, PWMD_C6PS_MSK, ((2) << 2))
#define PWMD_C6SwitchPB5()              MODIFY_REG(PWMD_PS, PWMD_C6PS_MSK, ((3) << 2))

#define HSPWMD_C6SwitchP25()            PWMD_C6SwitchP25()
#define HSPWMD_C6SwitchP83()            PWMD_C6SwitchP83()
#define HSPWMD_C6SwitchP51()            PWMD_C6SwitchP51()
#define HSPWMD_C6SwitchPB5()            PWMD_C6SwitchPB5()

#define PWMD_C7PS_MSK                   (BIT5 | BIT4)
#define PWMD_C7SwitchP26()              MODIFY_REG(PWMD_PS, PWMD_C7PS_MSK, ((0) << 4))
#define PWMD_C7SwitchP85()              MODIFY_REG(PWMD_PS, PWMD_C7PS_MSK, ((1) << 4))
#define PWMD_C7SwitchP52()              MODIFY_REG(PWMD_PS, PWMD_C7PS_MSK, ((2) << 4))
#define PWMD_C7SwitchPB6()              MODIFY_REG(PWMD_PS, PWMD_C7PS_MSK, ((3) << 4))

#define HSPWMD_C7SwitchP26()            PWMD_C7SwitchP26()
#define HSPWMD_C7SwitchP85()            PWMD_C7SwitchP85()
#define HSPWMD_C7SwitchP52()            PWMD_C7SwitchP52()
#define HSPWMD_C7SwitchPB6()            PWMD_C7SwitchPB6()

#define PWMD_C8PS_MSK                   (BIT7 | BIT6)
#define PWMD_C8SwitchP27()              MODIFY_REG(PWMD_PS, PWMD_C8PS_MSK, ((0) << 6))
#define PWMD_C8SwitchP87()              MODIFY_REG(PWMD_PS, PWMD_C8PS_MSK, ((1) << 6))
#define PWMD_C8SwitchP53()              MODIFY_REG(PWMD_PS, PWMD_C8PS_MSK, ((2) << 6))
#define PWMD_C8SwitchPB7()              MODIFY_REG(PWMD_PS, PWMD_C8PS_MSK, ((3) << 6))

#define HSPWMD_C8SwitchP27()            PWMD_C8SwitchP27()
#define HSPWMD_C8SwitchP87()            PWMD_C8SwitchP87()
#define HSPWMD_C8SwitchP53()            PWMD_C8SwitchP53()
#define HSPWMD_C8SwitchPB7()            PWMD_C8SwitchPB7()

#define PWME_C1PS_MSK                   (BIT1 | BIT0)
#define PWME_C1SwitchP7071()            MODIFY_REG(PWME_PS, PWME_C1PS_MSK, ((0) << 0))
#define PWME_C1SwitchP9091()            MODIFY_REG(PWME_PS, PWME_C1PS_MSK, ((1) << 0))
#define PWME_C1SwitchPA0A1()            MODIFY_REG(PWME_PS, PWME_C1PS_MSK, ((2) << 0))

#define HSPWME_C1SwitchP7071()          PWME_C1SwitchP7071()
#define HSPWME_C1SwitchP9091()          PWME_C1SwitchP9091()
#define HSPWME_C1SwitchPA0A1()          PWME_C1SwitchPA0A1()

#define PWME_C2PS_MSK                   (BIT3 | BIT2)
#define PWME_C2SwitchP7273()            MODIFY_REG(PWME_PS, PWME_C2PS_MSK, ((0) << 2))
#define PWME_C2SwitchP9293()            MODIFY_REG(PWME_PS, PWME_C2PS_MSK, ((1) << 2))
#define PWME_C2SwitchPA2A3()            MODIFY_REG(PWME_PS, PWME_C2PS_MSK, ((2) << 2))

#define HSPWME_C2SwitchP7273()          PWME_C2SwitchP7273()
#define HSPWME_C2SwitchP9293()          PWME_C2SwitchP9293()
#define HSPWME_C2SwitchPA2A3()          PWME_C2SwitchPA2A3()

#define PWME_C3PS_MSK                   (BIT5 | BIT4)
#define PWME_C3SwitchP7475()            MODIFY_REG(PWME_PS, PWME_C3PS_MSK, ((0) << 4))
#define PWME_C3SwitchP9495()            MODIFY_REG(PWME_PS, PWME_C3PS_MSK, ((1) << 4))
#define PWME_C3SwitchPA4A5()            MODIFY_REG(PWME_PS, PWME_C3PS_MSK, ((2) << 4))

#define HSPWME_C3SwitchP7475()          PWME_C3SwitchP7475()
#define HSPWME_C3SwitchP9495()          PWME_C3SwitchP9495()
#define HSPWME_C3SwitchPA4A5()          PWME_C3SwitchPA4A5()

