fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWME_C4PS_MSK                   (BIT7 | BIT6)
#define PWME_C4SwitchP7677()            MODIFY_REG(PWME_PS, PWME_C4PS_MSK, ((0) << 6))
#define PWME_C4SwitchP9697()            MODIFY_REG(PWME_PS, PWME_C4PS_MSK, ((1) << 6))
#define PWME_C4SwitchPA6A7()            MODIFY_REG(PWME_PS, PWME_C4PS_MSK, ((2) << 6))

#define HSPWME_C4SwitchP7677()          PWME_C4SwitchP7677()
#define HSPWME_C4SwitchP9697()          PWME_C4SwitchP9697()
#define HSPWME_C4SwitchPA6A7()          PWME_C4SwitchPA6A7()

#define PWME_C5PS_MSK                   (BIT1 | BIT0)
#define PWME_C5SwitchP50()              MODIFY_REG(PWME_PS2, PWME_C5PS_MSK, ((0) << 0))
#define PWME_C5SwitchP43()              MODIFY_REG(PWME_PS2, PWME_C5PS_MSK, ((1) << 0))
#define PWME_C5SwitchPB4()              MODIFY_REG(PWME_PS2, PWME_C5PS_MSK, ((2) << 0))
#define PWME_C5SwitchP95()              MODIFY_REG(PWME_PS2, PWME_C5PS_MSK, ((3) << 0))

#define HSPWME_C5SwitchP50()            PWME_C5SwitchP50()
#define HSPWME_C5SwitchP43()            PWME_C5SwitchP43()
#define HSPWME_C5SwitchPB4()            PWME_C5SwitchPB4()
#define HSPWME_C5SwitchP95()            PWME_C5SwitchP95()

#define PWME_C6PS_MSK                   (BIT3 | BIT2)
#define PWME_C6SwitchP51()              MODIFY_REG(PWME_PS2, PWME_C6PS_MSK, ((0) << 2))
#define PWME_C6SwitchP44()              MODIFY_REG(PWME_PS2, PWME_C6PS_MSK, ((1) << 2))
#define PWME_C6SwitchPB5()              MODIFY_REG(PWME_PS2, PWME_C6PS_MSK, ((2) << 2))
#define PWME_C6SwitchP97()              MODIFY_REG(PWME_PS2, PWME_C6PS_MSK, ((3) << 2))

#define HSPWME_C6SwitchP51()            PWME_C6SwitchP51()
#define HSPWME_C6SwitchP44()            PWME_C6SwitchP44()
#define HSPWME_C6SwitchPB5()            PWME_C6SwitchPB5()
#define HSPWME_C6SwitchP97()            PWME_C6SwitchP97()

#define PWMF_C5PS_MSK                   (BIT1 | BIT0)
#define PWMF_C5SwitchP70()              MODIFY_REG(PWMF_PS, PWMF_C5PS_MSK, ((0) << 0))
#define PWMF_C5SwitchPA1()              MODIFY_REG(PWMF_PS, PWMF_C5PS_MSK, ((1) << 0))
#define PWMF_C5SwitchP90()              MODIFY_REG(PWMF_PS, PWMF_C5PS_MSK, ((2) << 0))

#define HSPWMF_C5SwitchP70()            PWMF_C5SwitchP70()
#define HSPWMF_C5SwitchPA1()            PWMF_C5SwitchPA1()
#define HSPWMF_C5SwitchP90()            PWMF_C5SwitchP90()

#define PWMF_C6PS_MSK                   (BIT3 | BIT2)
#define PWMF_C6SwitchP71()              MODIFY_REG(PWMF_PS, PWMF_C6PS_MSK, ((0) << 2))
#define PWMF_C6SwitchPA3()              MODIFY_REG(PWMF_PS, PWMF_C6PS_MSK, ((1) << 2))
#define PWMF_C6SwitchP91()              MODIFY_REG(PWMF_PS, PWMF_C6PS_MSK, ((2) << 2))

#define HSPWMF_C6SwitchP71()            PWMF_C6SwitchP71()
#define HSPWMF_C6SwitchPA3()            PWMF_C6SwitchPA3()
#define HSPWMF_C6SwitchP91()            PWMF_C6SwitchP91()

#define PWMF_C7PS_MSK                   (BIT5 | BIT4)
#define PWMF_C7SwitchP72()              MODIFY_REG(PWMF_PS, PWMF_C7PS_MSK, ((0) << 4))
#define PWMF_C7SwitchPA5()              MODIFY_REG(PWMF_PS, PWMF_C7PS_MSK, ((1) << 4))
#define PWMF_C7SwitchP92()              MODIFY_REG(PWMF_PS, PWMF_C7PS_MSK, ((2) << 4))

#define HSPWMF_C7SwitchP72()            PWMF_C7SwitchP72()
#define HSPWMF_C7SwitchPA5()            PWMF_C7SwitchPA5()
#define HSPWMF_C7SwitchP92()            PWMF_C7SwitchP92()

#define PWMF_C8PS_MSK                   (BIT7 | BIT6)
#define PWMF_C8SwitchP73()              MODIFY_REG(PWMF_PS, PWMF_C8PS_MSK, ((0) << 6))
#define PWMF_C8SwitchPA7()              MODIFY_REG(PWMF_PS, PWMF_C8PS_MSK, ((1) << 6))
#define PWMF_C8SwitchP93()              MODIFY_REG(PWMF_PS, PWMF_C8PS_MSK, ((2) << 6))

#define HSPWMF_C8SwitchP73()            PWMF_C8SwitchP73()
#define HSPWMF_C8SwitchPA7()            PWMF_C8SwitchPA7()
#define HSPWMF_C8SwitchP93()            PWMF_C8SwitchP93()

#define PWMA_ETRPS_MSK                  (BIT1 | BIT0)
#define PWMA_ETRSwitchP32()             MODIFY_REG(PWMA_ETRPS, PWMA_ETRPS_MSK, ((0) << 0))
#define PWMA_ETRSwitchP41()             MODIFY_REG(PWMA_ETRPS, PWMA_ETRPS_MSK, ((1) << 0))
#define PWMA_ETRSwitchP73()             MODIFY_REG(PWMA_ETRPS, PWMA_ETRPS_MSK, ((2) << 0))

#define HSPWMA_ETRSwitchP32()           PWMA_ETRSwitchP32()
#define HSPWMA_ETRSwitchP41()           PWMA_ETRSwitchP41()
#define HSPWMA_ETRSwitchP73()           PWMA_ETRSwitchP73()

#define PWMB_ETRPS_MSK                  (BIT1 | BIT0)
#define PWMB_ETRSwitchP32()             MODIFY_REG(PWMB_ETRPS, PWMB_ETRPS_MSK, ((0) << 0))
#define PWMB_ETRSwitchP06()             MODIFY_REG(PWMB_ETRPS, PWMB_ETRPS_MSK, ((1) << 0))

#define HSPWMB_ETRSwitchP32()           PWMB_ETRSwitchP32()
#define HSPWMB_ETRSwitchP06()           PWMB_ETRSwitchP06()

#define PWMC_ETRPS_MSK                  (BIT1 | BIT0)
#define PWMC_ETRSwitchP32()             MODIFY_REG(PWMC_ETRPS, PWMC_ETRPS_MSK, ((0) << 0))
#define PWMC_ETRSwitchP70()             MODIFY_REG(PWMC_ETRPS, PWMC_ETRPS_MSK, ((1) << 0))
#define PWMC_ETRSwitchP94()             MODIFY_REG(PWMC_ETRPS, PWMC_ETRPS_MSK, ((2) << 0))

#define HSPWMC_ETRSwitchP32()           PWMC_ETRSwitchP32()
#define HSPWMC_ETRSwitchP70()           PWMC_ETRSwitchP70()
#define HSPWMC_ETRSwitchP94()           PWMC_ETRSwitchP94()

#define PWMD_ETRPS_MSK                  (BIT1 | BIT0)
#define PWMD_ETRSwitchP32()             MODIFY_REG(PWMD_ETRPS, PWMD_ETRPS_MSK, ((0) << 0))
#define PWMD_ETRSwitchP70()             MODIFY_REG(PWMD_ETRPS, PWMD_ETRPS_MSK, ((1) << 0))

#define HSPWMD_ETRSwitchP32()           PWMD_ETRSwitchP32()
#define HSPWMD_ETRSwitchP70()           PWMD_ETRSwitchP70()

#define PWME_ETRPS_MSK                  (BIT1 | BIT0)
#define PWME_ETRSwitchP32()             MODIFY_REG(PWME_ETRPS, PWME_ETRPS_MSK, ((0) << 0))
#define PWME_ETRSwitchP02()             MODIFY_REG(PWME_ETRPS, PWME_ETRPS_MSK, ((2) << 0))

#define HSPWME_ETRSwitchP32()           PWME_ETRSwitchP32()
#define HSPWME_ETRSwitchP02()           PWME_ETRSwitchP02()

#define PWMF_ETRPS_MSK                  (BIT1 | BIT0)
#define PWMF_ETRSwitchP32()             MODIFY_REG(PWMF_ETRPS, PWMF_ETRPS_MSK, ((0) << 0))
#define PWMF_ETRSwitchPB1()             MODIFY_REG(PWMF_ETRPS, PWMF_ETRPS_MSK, ((1) << 0))
#define PWMF_ETRSwitchP00()             MODIFY_REG(PWMF_ETRPS, PWMF_ETRPS_MSK, ((2) << 0))

#define HSPWMF_ETRSwitchP32()           PWMF_ETRSwitchP32()
#define HSPWMF_ETRSwitchPB1()           PWMF_ETRSwitchPB1()
#define HSPWMF_ETRSwitchP00()           PWMF_ETRSwitchP00()

