fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMA_BRKPS_MSK                  (BIT3 | BIT2)
#define PWMA_BRKSwitchP35()             MODIFY_REG(PWMA_ETRPS, PWMA_BRKPS_MSK, ((0) << 2))
#define PWMA_BRKSwitchCMPAO()           MODIFY_REG(PWMA_ETRPS, PWMA_BRKPS_MSK, ((1) << 2))
#define PWMA_BRKSwitchP45()             MODIFY_REG(PWMA_ETRPS, PWMA_BRKPS_MSK, ((2) << 2))

#define HSPWMA_BRKSwitchP35()           PWMA_BRKSwitchP35()
#define HSPWMA_BRKSwitchCMPAO()         PWMA_BRKSwitchCMPAO()
#define HSPWMA_BRKSwitchP45()           PWMA_BRKSwitchP45()

#define PWMB_BRKPS_MSK                  (BIT3 | BIT2)
#define PWMB_BRKSwitchP35()             MODIFY_REG(PWMB_ETRPS, PWMB_BRKPS_MSK, ((0) << 2))
#define PWMB_BRKSwitchCMPBO()           MODIFY_REG(PWMB_ETRPS, PWMB_BRKPS_MSK, ((1) << 2))
#define PWMB_BRKSwitchP07()             MODIFY_REG(PWMB_ETRPS, PWMB_BRKPS_MSK, ((2) << 2))

#define HSPWMB_BRKSwitchP35()           PWMB_BRKSwitchP35()
#define HSPWMB_BRKSwitchCMPBO()         PWMB_BRKSwitchCMPBO()
#define HSPWMB_BRKSwitchP07()           PWMB_BRKSwitchP07()

#define PWMC_BRKPS_MSK                  (BIT3 | BIT2)
#define PWMC_BRKSwitchP35()             MODIFY_REG(PWMC_ETRPS, PWMC_BRKPS_MSK, ((0) << 2))
#define PWMC_BRKSwitchCMPCO()           MODIFY_REG(PWMC_ETRPS, PWMC_BRKPS_MSK, ((1) << 2))
#define PWMC_BRKSwitchP71()             MODIFY_REG(PWMC_ETRPS, PWMC_BRKPS_MSK, ((2) << 2))
#define PWMC_BRKSwitchP95()             MODIFY_REG(PWMC_ETRPS, PWMC_BRKPS_MSK, ((2) << 2))

#define HSPWMC_BRKSwitchP35()           PWMC_BRKSwitchP35()
#define HSPWMC_BRKSwitchCMPCO()         PWMC_BRKSwitchCMPCO()
#define HSPWMC_BRKSwitchP71()           PWMC_BRKSwitchP71()
#define HSPWMC_BRKSwitchP95()           PWMC_BRKSwitchP95()

#define PWMD_BRKPS_MSK                  (BIT3 | BIT2)
#define PWMD_BRKSwitchP35()             MODIFY_REG(PWMD_ETRPS, PWMD_BRKPS_MSK, ((0) << 2))
#define PWMD_BRKSwitchCMPDO()           MODIFY_REG(PWMD_ETRPS, PWMD_BRKPS_MSK, ((1) << 2))
#define PWMD_BRKSwitchP71()             MODIFY_REG(PWMD_ETRPS, PWMD_BRKPS_MSK, ((2) << 2))

#define HSPWMD_BRKSwitchP35()           PWMD_BRKSwitchP35()
#define HSPWMD_BRKSwitchCMPDO()         PWMD_BRKSwitchCMPDO()
#define HSPWMD_BRKSwitchP71()           PWMD_BRKSwitchP71()

#define PWME_BRKPS_MSK                  (BIT3 | BIT2)
#define PWME_BRKSwitchP35()             MODIFY_REG(PWME_ETRPS, PWME_BRKPS_MSK, ((0) << 2))
#define PWME_BRKSwitchCMPEO()           MODIFY_REG(PWME_ETRPS, PWME_BRKPS_MSK, ((1) << 2))
#define PWME_BRKSwitchP03()             MODIFY_REG(PWME_ETRPS, PWME_BRKPS_MSK, ((3) << 2))

#define HSPWME_BRKSwitchP35()           PWME_BRKSwitchP35()
#define HSPWME_BRKSwitchCMPEO()         PWME_BRKSwitchCMPEO()
#define HSPWME_BRKSwitchP03()           PWME_BRKSwitchP03()

#define PWMF_BRKPS_MSK                  (BIT3 | BIT2)
#define PWMF_BRKSwitchP35()             MODIFY_REG(PWMF_ETRPS, PWMF_BRKPS_MSK, ((0) << 2))
#define PWMF_BRKSwitchCMPFO()           MODIFY_REG(PWMF_ETRPS, PWMF_BRKPS_MSK, ((1) << 2))
#define PWMF_BRKSwitchPB3()             MODIFY_REG(PWMF_ETRPS, PWMF_BRKPS_MSK, ((2) << 2))
#define PWMF_BRKSwitchP01()             MODIFY_REG(PWMF_ETRPS, PWMF_BRKPS_MSK, ((3) << 2))

#define HSPWMF_BRKSwitchP35()           PWMF_BRKSwitchP35()
#define HSPWMF_BRKSwitchCMPFO()         PWMF_BRKSwitchCMPFO()
#define HSPWMF_BRKSwitchPB3()           PWMF_BRKSwitchPB3()
#define HSPWMF_BRKSwitchP01()           PWMF_BRKSwitchP01()

#define PWMA_CMPAPS_MSK                 (BIT5 | BIT4)
#define PWMA_CMPASwitchCMP1()           MODIFY_REG(PWMA_ETRPS, PWMA_CMPAPS_MSK, ((0) << 4))
#define PWMA_CMPASwitchCMP2()           MODIFY_REG(PWMA_ETRPS, PWMA_CMPAPS_MSK, ((1) << 4))
#define PWMA_CMPASwitchCMP3()           MODIFY_REG(PWMA_ETRPS, PWMA_CMPAPS_MSK, ((2) << 4))
#define PWMA_CMPASwitchCMP4()           MODIFY_REG(PWMA_ETRPS, PWMA_CMPAPS_MSK, ((3) << 4))

#define HSPWMA_CMPASwitchCMP1()         PWMA_CMPASwitchCMP1()
#define HSPWMA_CMPASwitchCMP2()         PWMA_CMPASwitchCMP2()
#define HSPWMA_CMPASwitchCMP3()         PWMA_CMPASwitchCMP3()
#define HSPWMA_CMPASwitchCMP4()         PWMA_CMPASwitchCMP4()

#define PWMB_CMPBPS_MSK                 (BIT5 | BIT4)
#define PWMB_CMPBSwitchCMP1()           MODIFY_REG(PWMB_ETRPS, PWMB_CMPBPS_MSK, ((0) << 4))
#define PWMB_CMPBSwitchCMP2()           MODIFY_REG(PWMB_ETRPS, PWMB_CMPBPS_MSK, ((1) << 4))
#define PWMB_CMPBSwitchCMP3()           MODIFY_REG(PWMB_ETRPS, PWMB_CMPBPS_MSK, ((2) << 4))
#define PWMB_CMPBSwitchCMP4()           MODIFY_REG(PWMB_ETRPS, PWMB_CMPBPS_MSK, ((3) << 4))

#define HSPWMB_CMPBSwitchCMP1()         PWMB_CMPBSwitchCMP1()
#define HSPWMB_CMPBSwitchCMP2()         PWMB_CMPBSwitchCMP2()
#define HSPWMB_CMPBSwitchCMP3()         PWMB_CMPBSwitchCMP3()
#define HSPWMB_CMPBSwitchCMP4()         PWMB_CMPBSwitchCMP4()

#define PWMC_CMPCPS_MSK                 (BIT5 | BIT4)
#define PWMC_CMPCSwitchCMP1()           MODIFY_REG(PWMC_ETRPS, PWMC_CMPCPS_MSK, ((0) << 4))
#define PWMC_CMPCSwitchCMP2()           MODIFY_REG(PWMC_ETRPS, PWMC_CMPCPS_MSK, ((1) << 4))
#define PWMC_CMPCSwitchCMP3()           MODIFY_REG(PWMC_ETRPS, PWMC_CMPCPS_MSK, ((2) << 4))
#define PWMC_CMPCSwitchCMP4()           MODIFY_REG(PWMC_ETRPS, PWMC_CMPCPS_MSK, ((3) << 4))

#define HSPWMC_CMPCSwitchCMP1()         PWMC_CMPCSwitchCMP1()
#define HSPWMC_CMPCSwitchCMP2()         PWMC_CMPCSwitchCMP2()
#define HSPWMC_CMPCSwitchCMP3()         PWMC_CMPCSwitchCMP3()
#define HSPWMC_CMPCSwitchCMP4()         PWMC_CMPCSwitchCMP4()

#define PWMD_CMPDPS_MSK                 (BIT5 | BIT4)
#define PWMD_CMPDSwitchCMP1()           MODIFY_REG(PWMD_ETRPS, PWMD_CMPDPS_MSK, ((0) << 4))
#define PWMD_CMPDSwitchCMP2()           MODIFY_REG(PWMD_ETRPS, PWMD_CMPDPS_MSK, ((1) << 4))
#define PWMD_CMPDSwitchCMP3()           MODIFY_REG(PWMD_ETRPS, PWMD_CMPDPS_MSK, ((2) << 4))
#define PWMD_CMPDSwitchCMP4()           MODIFY_REG(PWMD_ETRPS, PWMD_CMPDPS_MSK, ((3) << 4))

#define HSPWMD_CMPDSwitchCMP1()         PWMD_CMPDSwitchCMP1()
#define HSPWMD_CMPDSwitchCMP2()         PWMD_CMPDSwitchCMP2()
#define HSPWMD_CMPDSwitchCMP3()         PWMD_CMPDSwitchCMP3()
#define HSPWMD_CMPDSwitchCMP4()         PWMD_CMPDSwitchCMP4()

