fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWME_CMPEPS_MSK                 (BIT5 | BIT4)
#define PWME_CMPESwitchCMP1()           MODIFY_REG(PWME_ETRPS, PWME_CMPEPS_MSK, ((0) << 4))
#define PWME_CMPESwitchCMP2()           MODIFY_REG(PWME_ETRPS, PWME_CMPEPS_MSK, ((1) << 4))
#define PWME_CMPESwitchCMP3()           MODIFY_REG(PWME_ETRPS, PWME_CMPEPS_MSK, ((2) << 4))
#define PWME_CMPESwitchCMP4()           MODIFY_REG(PWME_ETRPS, PWME_CMPEPS_MSK, ((3) << 4))

#define HSPWME_CMPESwitchCMP1()         PWME_CMPESwitchCMP1()
#define HSPWME_CMPESwitchCMP2()         PWME_CMPESwitchCMP2()
#define HSPWME_CMPESwitchCMP3()         PWME_CMPESwitchCMP3()
#define HSPWME_CMPESwitchCMP4()         PWME_CMPESwitchCMP4()

#define PWMF_CMPFPS_MSK                 (BIT5 | BIT4)
#define PWMF_CMPFSwitchCMP1()           MODIFY_REG(PWMF_ETRPS, PWMF_CMPFPS_MSK, ((0) << 4))
#define PWMF_CMPFSwitchCMP2()           MODIFY_REG(PWMF_ETRPS, PWMF_CMPFPS_MSK, ((1) << 4))
#define PWMF_CMPFSwitchCMP3()           MODIFY_REG(PWMF_ETRPS, PWMF_CMPFPS_MSK, ((2) << 4))
#define PWMF_CMPFSwitchCMP4()           MODIFY_REG(PWMF_ETRPS, PWMF_CMPFPS_MSK, ((3) << 4))

#define HSPWMF_CMPFSwitchCMP1()         PWMF_CMPFSwitchCMP1()
#define HSPWMF_CMPFSwitchCMP2()         PWMF_CMPFSwitchCMP2()
#define HSPWMF_CMPFSwitchCMP3()         PWMF_CMPFSwitchCMP3()
#define HSPWMF_CMPFSwitchCMP4()         PWMF_CMPFSwitchCMP4()

#define ADC_ETRPS_MSK                   (BIT7 | BIT6)
#define ADC1_ETRSwitchP12()             MODIFY_REG(ADCEXCFG, ADC_ETRPS_MSK, ((0) << 6))
#define ADC1_ETRSwitchP43()             MODIFY_REG(ADCEXCFG, ADC_ETRPS_MSK, ((1) << 6))

#define ADC2_ETRPS_MSK                  (BIT7 | BIT6)
#define ADC2_ETRSwitchP12()             MODIFY_REG(ADC2EXCFG, ADC2_ETRPS_MSK, ((0) << 6))
#define ADC2_ETRSwitchP43()             MODIFY_REG(ADC2EXCFG, ADC2_ETRPS_MSK, ((1) << 6))

#define LCM_DPS_MSK                     (BIT3 | BIT2)
#define LCM_DATA8BSwitchP2()            MODIFY_REG(LCMIFCFG, LCM_DPS_MSK, ((0) << 2))
#define LCM_DATA8BSwitchP6()            MODIFY_REG(LCMIFCFG, LCM_DPS_MSK, ((1) << 2))
#define LCM_DATA16BSwitchP2P0()         MODIFY_REG(LCMIFCFG, LCM_DPS_MSK, ((0) << 2))
#define LCM_DATA16BSwitchP6P2()         MODIFY_REG(LCMIFCFG, LCM_DPS_MSK, ((1) << 2))
#define LCM_DATA16BSwitchP2P4()         MODIFY_REG(LCMIFCFG, LCM_DPS_MSK, ((2) << 2))
#define LCM_DATA16BSwitchP6P7()         MODIFY_REG(LCMIFCFG, LCM_DPS_MSK, ((3) << 2))

#define LCM_RSPS_MSK                    (BIT6)
#define LCM_RSSwitchP45()               CLR_REG_BIT(LCMIFCFG2, LCM_RSPS_MSK)
#define LCM_RSSwitchP40()               SET_REG_BIT(LCMIFCFG2, LCM_RSPS_MSK)

#define LCM_RWPS_MSK                    (BIT5)
#define LCM_CTRLSwitchP4442()           CLR_REG_BIT(LCMIFCFG2, LCM_RWPS_MSK)
#define LCM_CTRLSwitchP3736()           SET_REG_BIT(LCMIFCFG2, LCM_RWPS_MSK)

#define LIN_PS_MSK                      (BIT1 | BIT0)
#define LIN1_SwitchP0203()              MODIFY_REG(P_SW1, LIN_PS_MSK, ((0) << 0))
#define LIN1_SwitchP5253()              MODIFY_REG(P_SW1, LIN_PS_MSK, ((1) << 0))
#define LIN1_SwitchP4647()              MODIFY_REG(P_SW1, LIN_PS_MSK, ((2) << 0))
#define LIN1_SwitchP7273()              MODIFY_REG(P_SW1, LIN_PS_MSK, ((3) << 0))

#define LIN2_PS_MSK                     (BIT5 | BIT4)
#define LIN2_SwitchP0607()              MODIFY_REG(P_SWX2, LIN2_PS_MSK, ((0) << 4))
#define LIN2_SwitchP2627()              MODIFY_REG(P_SWX2, LIN2_PS_MSK, ((1) << 4))
#define LIN2_SwitchP6263()              MODIFY_REG(P_SWX2, LIN2_PS_MSK, ((2) << 4))
#define LIN2_SwitchP8485()              MODIFY_REG(P_SWX2, LIN2_PS_MSK, ((3) << 4))

#define CAN1_PS_MSK                     (BIT5 | BIT4)
#define CAN1_PS2_MSK                    BIT2
#define CAN1_SwitchP000106()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((0) << 4)); CLR_REG_BIT(P_SWX1, CAN1_PS2_MSK)
#define CAN1_SwitchP505122()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((1) << 4)); CLR_REG_BIT(P_SWX1, CAN1_PS2_MSK)
#define CAN1_SwitchP424551()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((2) << 4)); CLR_REG_BIT(P_SWX1, CAN1_PS2_MSK)
#define CAN1_SwitchP707145()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((3) << 4)); CLR_REG_BIT(P_SWX1, CAN1_PS2_MSK)
#define CAN1_SwitchP303133()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((0) << 4)); SET_REG_BIT(P_SWX1, CAN1_PS2_MSK)
#define CAN1_SwitchP363712()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((1) << 4)); SET_REG_BIT(P_SWX1, CAN1_PS2_MSK)
#define CAN1_SwitchP141533()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((2) << 4)); SET_REG_BIT(P_SWX1, CAN1_PS2_MSK)
#define CAN1_SwitchP434474()            MODIFY_REG(P_SW1, CAN1_PS_MSK, ((3) << 4)); SET_REG_BIT(P_SWX1, CAN1_PS2_MSK)

#define CAN2_PS_MSK                     (BIT1 | BIT0)
#define CAN2_PS2_MSK                    BIT3
#define CAN2_SwitchP020307()            MODIFY_REG(P_SW3, CAN2_PS_MSK, ((0) << 0)); CLR_REG_BIT(P_SWX1, CAN2_PS2_MSK)
#define CAN2_SwitchP525323()            MODIFY_REG(P_SW3, CAN2_PS_MSK, ((1) << 0)); CLR_REG_BIT(P_SWX1, CAN2_PS2_MSK)
#define CAN2_SwitchP464753()            MODIFY_REG(P_SW3, CAN2_PS_MSK, ((2) << 0)); CLR_REG_BIT(P_SWX1, CAN2_PS2_MSK)
#define CAN2_SwitchP727347()            MODIFY_REG(P_SW3, CAN2_PS_MSK, ((3) << 0)); CLR_REG_BIT(P_SWX1, CAN2_PS2_MSK)
#define CAN2_SwitchP101107()            MODIFY_REG(P_SW3, CAN2_PS_MSK, ((0) << 0)); SET_REG_BIT(P_SWX1, CAN2_PS2_MSK)
#define CAN2_SwitchP848583()            MODIFY_REG(P_SW3, CAN2_PS_MSK, ((1) << 0)); SET_REG_BIT(P_SWX1, CAN2_PS2_MSK)
#define CAN2_SwitchPA0A123()            MODIFY_REG(P_SW3, CAN2_PS_MSK, ((2) << 0)); SET_REG_BIT(P_SWX1, CAN2_PS2_MSK)

/////////////////////////////////////////////////

#define CLKSEL_MCKSEL_MSK               (BIT1 | BIT0)
#define CLK_MCLK_HIRC()                 MODIFY_REG(CLKSEL, CLKSEL_MCKSEL_MSK, ((0x00) << 0))
#define CLK_MCLK_XTAL()                 MODIFY_REG(CLKSEL, CLKSEL_MCKSEL_MSK, ((0x01) << 0))
#define CLK_MCLK_X32K()                 MODIFY_REG(CLKSEL, CLKSEL_MCKSEL_MSK, ((0x02) << 0))
#define CLK_MCLK_LIRC()                 MODIFY_REG(CLKSEL, CLKSEL_MCKSEL_MSK, ((0x03) << 0))

