fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CLKSEL_MCK2SEL_MSK              (BIT3 | BIT2)
#define CLK_MCLK2_BYPASS()              MODIFY_REG(CLKSEL, CLKSEL_MCK2SEL_MSK, ((0x00) << 2))
#define CLK_MCLK2_HPLL1D2()             MODIFY_REG(CLKSEL, CLKSEL_MCK2SEL_MSK, ((0x01) << 2))
#define CLK_MCLK2_HPLL2D2()             MODIFY_REG(CLKSEL, CLKSEL_MCK2SEL_MSK, ((0x02) << 2))
#define CLK_MCLK2_IRC48M()              MODIFY_REG(CLKSEL, CLKSEL_MCK2SEL_MSK, ((0x03) << 2))

//#define CKSEL_HSIOCK_MSK                (BIT6)
//#define CLK_HSIOCK_MCLK()               CLR_REG_BIT(CLKSEL, CKSEL_HSIOCK_MSK)
//#define CLK_HSIOCK_PLL()                SET_REG_BIT(CLKSEL, CKSEL_HSIOCK_MSK)
//
//#define CLK_HSIOCK_Divider(n)           WRITE_REG(HSCLKDIV, (n))

#define CLK_SYSCLK_Divider(n)           WRITE_REG(CLKDIV, (n))

#define MCLKODIV_MSK                    (~(BIT7))
#define CLK_MCLKO_Divider(n)            MODIFY_REG(MCLKOCR, MCLKODIV_MSK, (n))

#define HIRCCR_EN_MSK                   (BIT7)
#define HIRCCR_ST_MSK                   (BIT0)
#define CLK_HIRC_Enable()               SET_REG_BIT(HIRCCR, HIRCCR_EN_MSK)
#define CLK_HIRC_WaitStable()           while (READ_REG_BIT(HIRCCR, HIRCCR_ST_MSK) == 0)

#define IRCBAND_SEL_MSK                 (BIT1 | BIT0)
#define CLK_HIRC_16MHzBand()            MODIFY_REG(IRCBAND, IRCBAND_SEL_MSK, ((0) << 0))
#define CLK_HIRC_27MHzBand()            MODIFY_REG(IRCBAND, IRCBAND_SEL_MSK, ((1) << 0))
#define CLK_HIRC_44MHzBand()            MODIFY_REG(IRCBAND, IRCBAND_SEL_MSK, ((2) << 0))
#define CLK_HIRC_72MHzBand()            MODIFY_REG(IRCBAND, IRCBAND_SEL_MSK, ((3) << 0))

#define IRC48MCR_EN_MSK                 (BIT7)
#define IRC48MCR_ST_MSK                 (BIT0)
#define CLK_IRC48M_Enable()             SET_REG_BIT(IRC48MCR, IRC48MCR_EN_MSK)
#define CLK_IRC48M_WaitStable()         while (READ_REG_BIT(IRC48MCR, IRC48MCR_ST_MSK) == 0)

#define LIRCCR_EN_MSK                   (BIT7)
#define LIRCCR_ST_MSK                   (BIT0)
#define CLK_LIRC_Enable()               SET_REG_BIT(IRC32KCR, LIRCCR_EN_MSK)
#define CLK_LIRC_WaitStable()           while (READ_REG_BIT(IRC32KCR, LIRCCR_ST_MSK) == 0)

#define XOSCCR_EN_MSK                   (BIT7)
#define XOSCCR_XITYPE_MSK               (BIT6)
#define XOSCCR_GAIN_MSK                 (BIT5)
#define XOSCCR_FILTER_MSK               (BIT3 | BIT2)
#define XOSCCR_ST_MSK                   (BIT0)

#define CLK_XTAL_Enable()               SET_REG_BIT(XOSCCR, XOSCCR_EN_MSK | XOSCCR_XITYPE_MSK)
#define CLK_XOSC_Enable()               SET_REG_BIT(XOSCCR, XOSCCR_EN_MSK)
#define CLK_XOSC_WaitStable()           while (READ_REG_BIT(XOSCCR, XOSCCR_ST_MSK) == 0)

#define CLK_XOSC_LowGain()              CLR_REG_BIT(XOSCCR, XOSCCR_GAIN_MSK)
#define CLK_XOSC_FullGain()             SET_REG_BIT(XOSCCR, XOSCCR_GAIN_MSK)

#define CLK_XOSC_HighFilter()           MODIFY_REG(CLKSEL, XOSCCR_FILTER_MSK, ((0) << 2))
#define CLK_XOSC_MiddleFilter()         MODIFY_REG(CLKSEL, XOSCCR_FILTER_MSK, ((1) << 2))
#define CLK_XOSC_LowFilter()            MODIFY_REG(CLKSEL, XOSCCR_FILTER_MSK, ((2) << 2))

#define X32KCR_EN_MSK                   (BIT7)
#define X32KCR_GAIN_MSK                 (BIT6)
#define X32KCR_ST_MSK                   (BIT0)

#define CLK_X32K_Enable()               SET_REG_BIT(X32KCR, X32KCR_EN_MSK)
#define CLK_X32K_WaitStable()           while (READ_REG_BIT(X32KCR, X32KCR_ST_MSK) == 0)

#define CLK_X32K_LowGain()              CLR_REG_BIT(X32KCR, X32KCR_GAIN_MSK)
#define CLK_X32K_FullGain()             SET_REG_BIT(X32KCR, X32KCR_GAIN_MSK)

#define CLK_SPI1CLK_Divider(n)          WRITE_REG(SPI_CLKDIV, (n))
#define CLK_SPI2CLK_Divider(n)          WRITE_REG(SPI2_CLKDIV, (n))
#define CLK_SPI3CLK_Divider(n)          WRITE_REG(SPI3_CLKDIV, (n))
#define CLK_I2S1CLK_Divider(n)          WRITE_REG(I2S_CLKDIV, (n))
#define CLK_I2S2CLK_Divider(n)          WRITE_REG(I2S2_CLKDIV, (n))
#define CLK_PWMACLK_Divider(n)          WRITE_REG(PWMA_CLKDIV, (n))
#define CLK_PWMBCLK_Divider(n)          WRITE_REG(PWMB_CLKDIV, (n))
#define CLK_PWMCCLK_Divider(n)          WRITE_REG(PWMC_CLKDIV, (n))
#define CLK_PWMDCLK_Divider(n)          WRITE_REG(PWMD_CLKDIV, (n))
#define CLK_PWMECLK_Divider(n)          WRITE_REG(PWME_CLKDIV, (n))
#define CLK_PWMFCLK_Divider(n)          WRITE_REG(PWMF_CLKDIV, (n))
#define CLK_TFPUCLK_Divider(n)          WRITE_REG(TFPU_CLKDIV, (n))

#define HPLL1CR_ENHPLL1_MSK             BIT7
#define CLK_HPLL1_Enable()              SET_REG_BIT(HPLLCR, HPLL1CR_ENHPLL1_MSK)
#define CLK_HPLL1_Disable()             CLR_REG_BIT(HPLLCR, HPLL1CR_ENHPLL1_MSK)

#define HPLL1CR_HPLL1CKS_MSK            BIT4
#define CLK_HPLL1_BASECLK()             CLR_REG_BIT(HPLLCR, HPLL1CR_HPLL1CKS_MSK)
#define CLK_HPLL1_IRC48M()              SET_REG_BIT(HPLLCR, HPLL1CR_HPLL1CKS_MSK)

#define HPLL1CR_LOCK_MSK                (BIT_LN)
#define CLK_HPLL1_LockFreq(n)           MODIFY_REG(HPLLCR, HPLL1CR_LOCK_MSK, ((n) << 0))
#define CLK_HPLL1_Lock312MHz()          CLK_HPLL1_LockFreq(0)
#define CLK_HPLL1_Lock324MHz()          CLK_HPLL1_LockFreq(1)
#define CLK_HPLL1_Lock336MHz()          CLK_HPLL1_LockFreq(2)
#define CLK_HPLL1_Lock348MHz()          CLK_HPLL1_LockFreq(3)
#define CLK_HPLL1_Lock360MHz()          CLK_HPLL1_LockFreq(4)
#define CLK_HPLL1_Lock372MHz()          CLK_HPLL1_LockFreq(5)
#define CLK_HPLL1_Lock384MHz()          CLK_HPLL1_LockFreq(6)
#define CLK_HPLL1_Lock396MHz()          CLK_HPLL1_LockFreq(7)
#define CLK_HPLL1_Lock408MHz()          CLK_HPLL1_LockFreq(8)
#define CLK_HPLL1_Lock420MHz()          CLK_HPLL1_LockFreq(9)
#define CLK_HPLL1_Lock432MHz()          CLK_HPLL1_LockFreq(10)
#define CLK_HPLL1_Lock444MHz()          CLK_HPLL1_LockFreq(11)
#define CLK_HPLL1_Lock456MHz()          CLK_HPLL1_LockFreq(12)
#define CLK_HPLL1_Lock468MHz()          CLK_HPLL1_LockFreq(13)
#define CLK_HPLL1_Lock480MHz()          CLK_HPLL1_LockFreq(14)
#define CLK_HPLL1_Lock492MHz()          CLK_HPLL1_LockFreq(15)

#define CLK_HPLL1_PreDivider(n)         WRITE_REG(HPLLPDIV, (n))

#define HPLL2CR_ENHPLL2_MSK             BIT7
#define CLK_HPLL2_Enable()              SET_REG_BIT(HPLL2CR, HPLL2CR_ENHPLL2_MSK)
#define CLK_HPLL2_Disable()             CLR_REG_BIT(HPLL2CR, HPLL2CR_ENHPLL2_MSK)

#define HPLL2CR_HPLL2CKS_MSK            BIT4
#define CLK_HPLL2_BASECLK()             CLR_REG_BIT(HPLL2CR, HPLL2CR_HPLL2CKS_MSK)
#define CLK_HPLL2_IRC48M()              SET_REG_BIT(HPLL2CR, HPLL2CR_HPLL2CKS_MSK)

#define HPLL2CR_LOCK_MSK                (BIT_LN)
#define CLK_HPLL2_LockFreq(n)           MODIFY_REG(HPLL2CR, HPLL2CR_LOCK_MSK, ((n) << 0))
#define CLK_HPLL2_Lock312MHz()          CLK_HPLL2_LockFreq(0)
#define CLK_HPLL2_Lock324MHz()          CLK_HPLL2_LockFreq(1)
#define CLK_HPLL2_Lock336MHz()          CLK_HPLL2_LockFreq(2)
#define CLK_HPLL2_Lock348MHz()          CLK_HPLL2_LockFreq(3)
#define CLK_HPLL2_Lock360MHz()          CLK_HPLL2_LockFreq(4)
#define CLK_HPLL2_Lock372MHz()          CLK_HPLL2_LockFreq(5)
#define CLK_HPLL2_Lock384MHz()          CLK_HPLL2_LockFreq(6)
#define CLK_HPLL2_Lock396MHz()          CLK_HPLL2_LockFreq(7)
#define CLK_HPLL2_Lock408MHz()          CLK_HPLL2_LockFreq(8)
#define CLK_HPLL2_Lock420MHz()          CLK_HPLL2_LockFreq(9)
#define CLK_HPLL2_Lock432MHz()          CLK_HPLL2_LockFreq(10)
#define CLK_HPLL2_Lock444MHz()          CLK_HPLL2_LockFreq(11)
#define CLK_HPLL2_Lock456MHz()          CLK_HPLL2_LockFreq(12)
#define CLK_HPLL2_Lock468MHz()          CLK_HPLL2_LockFreq(13)
#define CLK_HPLL2_Lock480MHz()          CLK_HPLL2_LockFreq(14)
#define CLK_HPLL2_Lock492MHz()          CLK_HPLL2_LockFreq(15)

