fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CLK_HPLL2_PreDivider(n)         WRITE_REG(HPLL2PDIV, (n))

#define HPLL1CR_HSI2SCK_MSK             (BIT6 | BIT5)
#define CLK_HSI2SCK_HPLL1D2()           MODIFY_REG(HPLLCR, HPLL1CR_HSI2SCK_MSK, ((0) << 5))
#define CLK_HSI2SCK_HPLL2D2()           MODIFY_REG(HPLLCR, HPLL1CR_HSI2SCK_MSK, ((1) << 5))
#define CLK_HSI2SCK_HPLL1()             MODIFY_REG(HPLLCR, HPLL1CR_HSI2SCK_MSK, ((2) << 5))
#define CLK_HSI2SCK_HPLL2()             MODIFY_REG(HPLLCR, HPLL1CR_HSI2SCK_MSK, ((3) << 5))

#define HPLL2CR_HSIOCK_MSK              (BIT6 | BIT5)
#define CLK_HSIOCK_HPLL1D2()            MODIFY_REG(HPLL2CR, HPLL2CR_HSIOCK_MSK, ((0) << 5))
#define CLK_HSIOCK_HPLL2D2()            MODIFY_REG(HPLL2CR, HPLL2CR_HSIOCK_MSK, ((1) << 5))
#define CLK_HSIOCK_HPLL1()              MODIFY_REG(HPLL2CR, HPLL2CR_HSIOCK_MSK, ((2) << 5))
#define CLK_HSIOCK_HPLL2()              MODIFY_REG(HPLL2CR, HPLL2CR_HSIOCK_MSK, ((3) << 5))

#define MCLKOCK_SEL_MSK                 (BIT5 | BIT4)
#define CLK_MCLKO_NONE()                MODIFY_REG(HIRCCR, MCLKOCK_SEL_MSK, ((0) << 4))
#define CLK_MCLKO_SYSCLK()              MODIFY_REG(HIRCCR, MCLKOCK_SEL_MSK, ((1) << 4))
#define CLK_MCLKO_HIRC()                MODIFY_REG(HIRCCR, MCLKOCK_SEL_MSK, ((2) << 4))
#define CLK_MCLKO_HIRCF()               MODIFY_REG(HIRCCR, MCLKOCK_SEL_MSK, ((3) << 4))

/////////////////////////////////////////////////

#define CRECR_ENCRE_MSK                 (BIT7)
#define CRECR_MONO_MSK                  (BIT6)
#define CRECR_UPT_MSK                   (BIT5 | BIT4)
#define CRECR_CREHF_MSK                 (BIT3)
#define CRECR_CREINC_MSK                (BIT2)
#define CRECR_CREDEC_MSK                (BIT1)
#define CRECR_CRERDY_MSK                (BIT0)

#define CRE_Enable()                    SET_REG_BIT(CRECR, CRECR_ENCRE_MSK)
#define CRE_Disable()                   CLR_REG_BIT(CRECR, CRECR_ENCRE_MSK)

#define CRE_OneStepMode()               CLR_REG_BIT(CRECR, CRECR_MONO_MSK)
#define CRE_TwoStepsMode()              SET_REG_BIT(CRECR, CRECR_MONO_MSK)

#define CRE_CalibCycle_1ms()            MODIFY_REG(CRECR, CRECR_UPT_MSK, ((0) << 4))
#define CRE_CalibCycle_4ms()            MODIFY_REG(CRECR, CRECR_UPT_MSK, ((1) << 4))
#define CRE_CalibCycle_32ms()           MODIFY_REG(CRECR, CRECR_UPT_MSK, ((2) << 4))
#define CRE_CalibCycle_64ms()           MODIFY_REG(CRECR, CRECR_UPT_MSK, ((3) << 4))

#define CRE_LowFrequency()              CLR_REG_BIT(CRECR, CRECR_CREHF_MSK)
#define CRE_HighFrequency()             SET_REG_BIT(CRECR, CRECR_CREHF_MSK)

#define CRE_CalibReady()                READ_REG_BIT(CRECR, CRECR_CRERDY_MSK)

#define CRE_LFCNT(freq)                 ((16UL * (freq)) / 32768)
#define CRE_HFCNT(freq)                 ((8UL * (freq)) / 32768)

#define CRE_SetCalibCounter(n)          WRITE_REG(CRECNTH, HIBYTE(n)); \
                                        WRITE_REG(CRECNTL, LOBYTE(n))

#define CRE_LFERROR(freq, err)          ((BYTE)(CRE_LFCNT(freq) * (err) / 1000))
#define CRE_HFERROR(freq, err)          ((BYTE)(CRE_HFCNT(freq) * (err) / 1000))

#define CRE_SetCalibError(n)            WRITE_REG(CRERES, (n))

/////////////////////////////////////////////////

#define WDTCONTR_FLAG_MSK               BIT7
#define WDTCONTR_EN_MSK                 BIT5
#define WDTCONTR_CLR_MSK                BIT4
#define WDTCONTR_IDL_MSK                BIT3
#define WDTCONTR_PS_MSK                 (BIT2 | BIT1 | BIT0)

#define WDT_Enable()                    SET_REG_BIT(WDT_CONTR, WDTCONTR_EN_MSK)
#define WDT_Clear()                     SET_REG_BIT(WDT_CONTR, WDTCONTR_CLR_MSK)
#define WDT_CheckWDTReset()             READ_REG_BIT(WDT_CONTR, WDTCONTR_FLAG_MSK)
#define WDT_IdlePause()                 CLR_REG_BIT(WDT_CONTR, WDTCONTR_IDL_MSK)
#define WDT_IdleContinue()              SET_REG_BIT(WDT_CONTR, WDTCONTR_IDL_MSK)

#define WDT_SetPrescale(n)              MODIFY_REG(WDT_CONTR, WDTCONTR_PS_MSK, ((n) << 0))
#define WDT_SetPrescale2()              WDT_SetPrescale(0)
#define WDT_SetPrescale4()              WDT_SetPrescale(1)
#define WDT_SetPrescale8()              WDT_SetPrescale(2)
#define WDT_SetPrescale16()             WDT_SetPrescale(3)
#define WDT_SetPrescale32()             WDT_SetPrescale(4)
#define WDT_SetPrescale64()             WDT_SetPrescale(5)
#define WDT_SetPrescale128()            WDT_SetPrescale(6)
#define WDT_SetPrescale256()            WDT_SetPrescale(7)

/////////////////////////////////////////////////

#define CHIPID_ReadID0()                CHIPID0
#define CHIPID_ReadID1()                CHIPID1
#define CHIPID_ReadID2()                CHIPID2
#define CHIPID_ReadID3()                CHIPID3
#define CHIPID_ReadID4()                CHIPID4
#define CHIPID_ReadID5()                CHIPID5
#define CHIPID_ReadID6()                CHIPID6
#define CHIPID_ReadREFVoltage()         MAKEWORD(CHIPID8, CHIPID7)
#define CHIPID_ReadLIRCFrequency()      MAKEWORD(CHIPID10, CHIPID9)
#define CHIPID_Read22MIRCTrim()         CHIPID11
#define CHIPID_Read24MIRCTrim()         CHIPID12
#define CHIPID_Read40MIRCTrim()         CHIPID13
#define CHIPID_Read45MIRCTrim()         CHIPID14
#define CHIPID_Read48MIRCTrim()         CHIPID15
#define CHIPID_Read49MIRCTrim()         CHIPID16
#define CHIPID_Read50MIRCTrim()         CHIPID17
#define CHIPID_Read55MIRCTrim()         CHIPID18
#define CHIPID_Read60MIRCTrim()         CHIPID19
#define CHIPID_Read64MIRCTrim()         CHIPID20
#define CHIPID_Read16MVRTrim()          CHIPID21
#define CHIPID_Read27MVRTrim()          CHIPID22
#define CHIPID_Read44MVRTrim()          CHIPID23
#define CHIPID_Read72MVRTrim()          CHIPID24
#define CHIPID_ReadTag()                CHIPID31

#define HIRC_22M1184()                          \
{                                               \
    IRTRIM = CHIPID_Read22MIRCTrim();           \
    VRTRIM = CHIPID_Read27MVRTrim();            \
    CLK_HIRC_27MHzBand();                       \
}

#define HIRC_24M()                              \
{                                               \
    IRTRIM = CHIPID_Read24MIRCTrim();           \
    VRTRIM = CHIPID_Read27MVRTrim();            \
    CLK_HIRC_27MHzBand();                       \
}

#define HIRC_40M()                              \
{                                               \
    IRTRIM = CHIPID_Read40MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

#define HIRC_45M1584()                          \
{                                               \
    IRTRIM = CHIPID_Read45MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

