fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HIRC_48M()                              \
{                                               \
    IRTRIM = CHIPID_Read48MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

#define HIRC_49M152()                           \
{                                               \
    IRTRIM = CHIPID_Read49MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

#define HIRC_50M8032()                          \
{                                               \
    IRTRIM = CHIPID_Read50MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

#define HIRC_55M296()                           \
{                                               \
    IRTRIM = CHIPID_Read55MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

#define HIRC_60M()                              \
{                                               \
    IRTRIM = CHIPID_Read60MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

#define HIRC_64M()                              \
{                                               \
    IRTRIM = CHIPID_Read64MIRCTrim();           \
    VRTRIM = CHIPID_Read44MVRTrim();            \
    CLK_HIRC_44MHzBand();                       \
}

/////////////////////////////////////////////////

#define PORT_SetFallingInt(p, b)        CLR_REG_BIT(P##p##IM0, (b)); \
                                        CLR_REG_BIT(P##p##IM1, (b)); \
                                        CLR_REG_BIT(P##p##IM2, (b))

#define PORT_SetRisingInt(p, b)         SET_REG_BIT(P##p##IM0, (b)); \
                                        CLR_REG_BIT(P##p##IM1, (b)); \
                                        CLR_REG_BIT(P##p##IM2, (b))

#define PORT_SetLowLevelInt(p, b)       CLR_REG_BIT(P##p##IM0, (b)); \
                                        SET_REG_BIT(P##p##IM1, (b)); \
                                        CLR_REG_BIT(P##p##IM2, (b))

#define PORT_SetHighLevelInt(p, b)      SET_REG_BIT(P##p##IM0, (b)); \
                                        SET_REG_BIT(P##p##IM1, (b)); \
                                        CLR_REG_BIT(P##p##IM2, (b))

#define PORT_SetEdgeInt(p, b)           CLR_REG_BIT(P##p##IM0, (b)); \
                                        CLR_REG_BIT(P##p##IM1, (b)); \
                                        SET_REG_BIT(P##p##IM2, (b))

#define SetP0nFallingInt(b)             PORT_SetFallingInt(0, (b))
#define SetP1nFallingInt(b)             PORT_SetFallingInt(1, (b))
#define SetP2nFallingInt(b)             PORT_SetFallingInt(2, (b))
#define SetP3nFallingInt(b)             PORT_SetFallingInt(3, (b))
#define SetP4nFallingInt(b)             PORT_SetFallingInt(4, (b))
#define SetP5nFallingInt(b)             PORT_SetFallingInt(5, (b))
#define SetP6nFallingInt(b)             PORT_SetFallingInt(6, (b))
#define SetP7nFallingInt(b)             PORT_SetFallingInt(7, (b))
#define SetP8nFallingInt(b)             PORT_SetFallingInt(8, (b))
#define SetP9nFallingInt(b)             PORT_SetFallingInt(9, (b))
#define SetPAnFallingInt(b)             PORT_SetFallingInt(A, (b))
#define SetPBnFallingInt(b)             PORT_SetFallingInt(B, (b))

#define SetP0nRisingInt(b)              PORT_SetRisingInt(0, (b))
#define SetP1nRisingInt(b)              PORT_SetRisingInt(1, (b))
#define SetP2nRisingInt(b)              PORT_SetRisingInt(2, (b))
#define SetP3nRisingInt(b)              PORT_SetRisingInt(3, (b))
#define SetP4nRisingInt(b)              PORT_SetRisingInt(4, (b))
#define SetP5nRisingInt(b)              PORT_SetRisingInt(5, (b))
#define SetP6nRisingInt(b)              PORT_SetRisingInt(6, (b))
#define SetP7nRisingInt(b)              PORT_SetRisingInt(7, (b))
#define SetP8nRisingInt(b)              PORT_SetRisingInt(8, (b))
#define SetP9nRisingInt(b)              PORT_SetRisingInt(9, (b))
#define SetPAnRisingInt(b)              PORT_SetRisingInt(A, (b))
#define SetPBnRisingInt(b)              PORT_SetRisingInt(B, (b))

#define SetP0nLowLevelInt(b)            PORT_SetLowLevelInt(0, (b))
#define SetP1nLowLevelInt(b)            PORT_SetLowLevelInt(1, (b))
#define SetP2nLowLevelInt(b)            PORT_SetLowLevelInt(2, (b))
#define SetP3nLowLevelInt(b)            PORT_SetLowLevelInt(3, (b))
#define SetP4nLowLevelInt(b)            PORT_SetLowLevelInt(4, (b))
#define SetP5nLowLevelInt(b)            PORT_SetLowLevelInt(5, (b))
#define SetP6nLowLevelInt(b)            PORT_SetLowLevelInt(6, (b))
#define SetP7nLowLevelInt(b)            PORT_SetLowLevelInt(7, (b))
#define SetP8nLowLevelInt(b)            PORT_SetLowLevelInt(8, (b))
#define SetP9nLowLevelInt(b)            PORT_SetLowLevelInt(9, (b))
#define SetPAnLowLevelInt(b)            PORT_SetLowLevelInt(A, (b))
#define SetPBnLowLevelInt(b)            PORT_SetLowLevelInt(B, (b))

#define SetP0nHighLevelInt(b)           PORT_SetHighLevelInt(0, (b))
#define SetP1nHighLevelInt(b)           PORT_SetHighLevelInt(1, (b))
#define SetP2nHighLevelInt(b)           PORT_SetHighLevelInt(2, (b))
#define SetP3nHighLevelInt(b)           PORT_SetHighLevelInt(3, (b))
#define SetP4nHighLevelInt(b)           PORT_SetHighLevelInt(4, (b))
#define SetP5nHighLevelInt(b)           PORT_SetHighLevelInt(5, (b))
#define SetP6nHighLevelInt(b)           PORT_SetHighLevelInt(6, (b))
#define SetP7nHighLevelInt(b)           PORT_SetHighLevelInt(7, (b))
#define SetP8nHighLevelInt(b)           PORT_SetHighLevelInt(8, (b))
#define SetP9nHighLevelInt(b)           PORT_SetHighLevelInt(9, (b))
#define SetPAnHighLevelInt(b)           PORT_SetHighLevelInt(A, (b))
#define SetPBnHighLevelInt(b)           PORT_SetHighLevelInt(B, (b))

#define SetP0nEdgeInt(b)                PORT_SetEdgeInt(0, (b))
#define SetP1nEdgeInt(b)                PORT_SetEdgeInt(1, (b))
#define SetP2nEdgeInt(b)                PORT_SetEdgeInt(2, (b))
#define SetP3nEdgeInt(b)                PORT_SetEdgeInt(3, (b))
#define SetP4nEdgeInt(b)                PORT_SetEdgeInt(4, (b))
#define SetP5nEdgeInt(b)                PORT_SetEdgeInt(5, (b))
#define SetP6nEdgeInt(b)                PORT_SetEdgeInt(6, (b))
#define SetP7nEdgeInt(b)                PORT_SetEdgeInt(7, (b))
#define SetP8nEdgeInt(b)                PORT_SetEdgeInt(8, (b))
#define SetP9nEdgeInt(b)                PORT_SetEdgeInt(9, (b))
#define SetPAnEdgeInt(b)                PORT_SetEdgeInt(A, (b))
#define SetPBnEdgeInt(b)                PORT_SetEdgeInt(B, (b))

