fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define T4T3M_T4CLKO_MSK                BIT4
#define TIMER4_EnableCLKO()             SET_REG_BIT(T4T3M, T4T3M_T4CLKO_MSK)
#define TIMER4_DisableCLKO()            CLR_REG_BIT(T4T3M, T4T3M_T4CLKO_MSK)

////////////////////////

#define T6T5M_T5R_MSK                   BIT3
#define TIMER5_Run()                    SET_REG_BIT(T6T5M, T6T5M_T5R_MSK)
#define TIMER5_Stop()                   CLR_REG_BIT(T6T5M, T6T5M_T5R_MSK)

#define TIMER5_SetReload16(n)           (T5H = HIBYTE(n), T5L = LOBYTE(n))
#define TIMER5_SetPrescale(n)           (TM5PS = (n))

#define T6T5M_T5X12_MSK                 BIT1
#define TIMER5_1TMode()                 SET_REG_BIT(T6T5M, T6T5M_T5X12_MSK)
#define TIMER5_12TMode()                CLR_REG_BIT(T6T5M, T6T5M_T5X12_MSK)

#define T6T5M_T5CT_MSK                  BIT2
#define TIMER5_TimerMode()              CLR_REG_BIT(T6T5M, T6T5M_T5CT_MSK)
#define TIMER5_CounterMode()            SET_REG_BIT(T6T5M, T6T5M_T5CT_MSK)

#define T6T5M_T5CLKO_MSK                BIT0
#define TIMER5_EnableCLKO()             SET_REG_BIT(T6T5M, T6T5M_T5CLKO_MSK)
#define TIMER5_DisableCLKO()            CLR_REG_BIT(T6T5M, T6T5M_T5CLKO_MSK)

////////////////////////

#define T6T5M_T6R_MSK                   BIT7
#define TIMER6_Run()                    SET_REG_BIT(T6T5M, T6T5M_T6R_MSK)
#define TIMER6_Stop()                   CLR_REG_BIT(T6T5M, T6T5M_T6R_MSK)

#define TIMER6_SetReload16(n)           (T6H = HIBYTE(n), T6L = LOBYTE(n))
#define TIMER6_SetPrescale(n)           (TM6PS = (n))

#define T6T5M_T6X12_MSK                 BIT5
#define TIMER6_1TMode()                 SET_REG_BIT(T6T5M, T6T5M_T6X12_MSK)
#define TIMER6_12TMode()                CLR_REG_BIT(T6T5M, T6T5M_T6X12_MSK)

#define T6T5M_T6CT_MSK                  BIT6
#define TIMER6_TimerMode()              CLR_REG_BIT(T6T5M, T6T5M_T6CT_MSK)
#define TIMER6_CounterMode()            SET_REG_BIT(T6T5M, T6T5M_T6CT_MSK)

#define T6T5M_T6CLKO_MSK                BIT4
#define TIMER6_EnableCLKO()             SET_REG_BIT(T6T5M, T6T5M_T6CLKO_MSK)
#define TIMER6_DisableCLKO()            CLR_REG_BIT(T6T5M, T6T5M_T6CLKO_MSK)

////////////////////////

#define T8T7M_T7R_MSK                   BIT3
#define TIMER7_Run()                    SET_REG_BIT(T8T7M, T8T7M_T7R_MSK)
#define TIMER7_Stop()                   CLR_REG_BIT(T8T7M, T8T7M_T7R_MSK)

#define TIMER7_SetReload16(n)           (T7H = HIBYTE(n), T7L = LOBYTE(n))
#define TIMER7_SetPrescale(n)           (TM7PS = (n))

#define T8T7M_T7X12_MSK                 BIT1
#define TIMER7_1TMode()                 SET_REG_BIT(T8T7M, T8T7M_T7X12_MSK)
#define TIMER7_12TMode()                CLR_REG_BIT(T8T7M, T8T7M_T7X12_MSK)

#define T8T7M_T7CT_MSK                  BIT2
#define TIMER7_TimerMode()              CLR_REG_BIT(T8T7M, T8T7M_T7CT_MSK)
#define TIMER7_CounterMode()            SET_REG_BIT(T8T7M, T8T7M_T7CT_MSK)

#define T8T7M_T7CLKO_MSK                BIT0
#define TIMER7_EnableCLKO()             SET_REG_BIT(T8T7M, T8T7M_T7CLKO_MSK)
#define TIMER7_DisableCLKO()            CLR_REG_BIT(T8T7M, T8T7M_T7CLKO_MSK)

////////////////////////

#define T8T7M_T8R_MSK                   BIT7
#define TIMER8_Run()                    SET_REG_BIT(T8T7M, T8T7M_T8R_MSK)
#define TIMER8_Stop()                   CLR_REG_BIT(T8T7M, T8T7M_T8R_MSK)

#define TIMER8_SetReload16(n)           (T8H = HIBYTE(n), T8L = LOBYTE(n))
#define TIMER8_SetPrescale(n)           (TM8PS = (n))

#define T8T7M_T8X12_MSK                 BIT5
#define TIMER8_1TMode()                 SET_REG_BIT(T8T7M, T8T7M_T8X12_MSK)
#define TIMER8_12TMode()                CLR_REG_BIT(T8T7M, T8T7M_T8X12_MSK)

#define T8T7M_T8CT_MSK                  BIT6
#define TIMER8_TimerMode()              CLR_REG_BIT(T8T7M, T8T7M_T8CT_MSK)
#define TIMER8_CounterMode()            SET_REG_BIT(T8T7M, T8T7M_T8CT_MSK)

#define T8T7M_T8CLKO_MSK                BIT4
#define TIMER8_EnableCLKO()             SET_REG_BIT(T8T7M, T8T7M_T8CLKO_MSK)
#define TIMER8_DisableCLKO()            CLR_REG_BIT(T8T7M, T8T7M_T8CLKO_MSK)

////////////////////////

#define T10T9M_T9R_MSK                  BIT3
#define TIMER9_Run()                    SET_REG_BIT(T10T9M, T10T9M_T9R_MSK)
#define TIMER9_Stop()                   CLR_REG_BIT(T10T9M, T10T9M_T9R_MSK)

#define TIMER9_SetReload16(n)           (T9H = HIBYTE(n), T9L = LOBYTE(n))
#define TIMER9_SetPrescale(n)           (TM9PS = (n))

#define T10T9M_T9X12_MSK                BIT1
#define TIMER9_1TMode()                 SET_REG_BIT(T10T9M, T10T9M_T9X12_MSK)
#define TIMER9_12TMode()                CLR_REG_BIT(T10T9M, T10T9M_T9X12_MSK)

#define T10T9M_T9CT_MSK                 BIT2
#define TIMER9_TimerMode()              CLR_REG_BIT(T10T9M, T10T9M_T9CT_MSK)
#define TIMER9_CounterMode()            SET_REG_BIT(T10T9M, T10T9M_T9CT_MSK)

#define T10T9M_T9CLKO_MSK               BIT0
#define TIMER9_EnableCLKO()             SET_REG_BIT(T10T9M, T10T9M_T9CLKO_MSK)
#define TIMER9_DisableCLKO()            CLR_REG_BIT(T10T9M, T10T9M_T9CLKO_MSK)

#define TIMERPS_T9T10SEL_MSK            BIT3
#define T9T10_CLKO_SwitchP7161()        CLR_REG_BIT(TIMER_PS, TIMERPS_T9T10SEL_MSK)
#define T9T10_CLKO_SwitchPB1B7()        SET_REG_BIT(TIMER_PS, TIMERPS_T9T10SEL_MSK)

////////////////////////

#define T10T9M_T10R_MSK                 BIT7
#define TIMER10_Run()                   SET_REG_BIT(T10T9M, T10T9M_T10R_MSK)
#define TIMER10_Stop()                  CLR_REG_BIT(T10T9M, T10T9M_T10R_MSK)

#define TIMER10_SetReload16(n)          (T10H = HIBYTE(n), T10L = LOBYTE(n))
#define TIMER10_SetPrescale(n)          (TM8PS = (n))

#define T10T9M_T10X12_MSK               BIT5
#define TIMER10_1TMode()                SET_REG_BIT(T10T9M, T10T9M_T10X12_MSK)
#define TIMER10_12TMode()               CLR_REG_BIT(T10T9M, T10T9M_T10X12_MSK)

#define T10T9M_T10CT_MSK                BIT6
#define TIMER10_TimerMode()             CLR_REG_BIT(T10T9M, T10T9M_T10CT_MSK)
#define TIMER10_CounterMode()           SET_REG_BIT(T10T9M, T10T9M_T10CT_MSK)

#define T10T9M_T10CLKO_MSK              BIT4
#define TIMER10_EnableCLKO()            SET_REG_BIT(T10T9M, T10T9M_T10CLKO_MSK)
#define TIMER10_DisableCLKO()           CLR_REG_BIT(T10T9M, T10T9M_T10CLKO_MSK)

