fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
////////////////////////

#define T11CR_T11R_MSK                  BIT7
#define TIMER11_Run()                   SET_REG_BIT(T11CR, T11CR_T11R_MSK)
#define TIMER11_Stop()                  CLR_REG_BIT(T11CR, T11CR_T11R_MSK)

#define TIMER11_CheckFlag()             READ_REG_BIT(T11CR, T11CR_T11IF_MSK)
#define TIMER11_ClearFlag()             CLR_REG_BIT(T11CR, T11CR_T11IF_MSK)

#define TIMER11_SetReload16(n)          (T11H = HIBYTE(n), T11L = LOBYTE(n))
#define TIMER11_SetPrescale(n)          (T11PS = (n))

#define T11CR_T11X12_MSK                BIT4
#define TIMER11_1TMode()                SET_REG_BIT(T11CR, T11CR_T11X12_MSK)
#define TIMER11_12TMode()               CLR_REG_BIT(T11CR, T11CR_T11X12_MSK)

#define T11CR_T11CT_MSK                 BIT6
#define TIMER11_TimerMode()             CLR_REG_BIT(T11CR, T11CR_T11CT_MSK)
#define TIMER11_CounterMode()           SET_REG_BIT(T11CR, T11CR_T11CT_MSK)

#define T11CR_T11CLKO_MSK               BIT5
#define TIMER11_EnableCLKO()            SET_REG_BIT(T11CR, T11CR_T11CLKO_MSK)
#define TIMER11_DisableCLKO()           CLR_REG_BIT(T11CR, T11CR_T11CLKO_MSK)

#define TIMERPS_T11SEL_MSK              (BIT5 | BIT4)
#define T11_CLKO_SwitchP77()            MODIFY_REG(TIMER_PS, TIMERPS_T11SEL_MSK, ((0) << 4))
#define T11_CLKO_SwitchP15()            MODIFY_REG(TIMER_PS, TIMERPS_T11SEL_MSK, ((1) << 4))
#define T11_CLKO_SwitchPA7()            MODIFY_REG(TIMER_PS, TIMERPS_T11SEL_MSK, ((2) << 4))
#define T11_CLKO_SwitchP45()            MODIFY_REG(TIMER_PS, TIMERPS_T11SEL_MSK, ((3) << 4))

#define T11CR_T11CS_MSK                 (BIT3 | BIT2)
#define TIMER11_ClockSource(n)          MODIFY_REG(T11CR, T11CR_T11CS_MSK, ((n) << 2))
#define TIMER11_CLK_SYSCLK()            TIMER11_ClockSource(0)
#define TIMER11_CLK_HIRC()              TIMER11_ClockSource(1)
#define TIMER11_CLK_X32K()              TIMER11_ClockSource(2)
#define TIMER11_CLK_LIRC()              TIMER11_ClockSource(3)

////////////////////////

#define T18T17M_T17R_MSK                BIT3
#define TIMER17_Run()                   SET_REG_BIT(T18T17M, T18T17M_T17R_MSK)
#define TIMER17_Stop()                  CLR_REG_BIT(T18T17M, T18T17M_T17R_MSK)

#define TIMER17_SetReload16(n)          (T17H = HIBYTE(n), T17L = LOBYTE(n))
#define TIMER17_SetPrescale(n)          (TM17PS = (n))

#define T18T17M_T17X12_MSK              BIT1
#define TIMER17_1TMode()                SET_REG_BIT(T18T17M, T18T17M_T17X12_MSK)
#define TIMER17_12TMode()               CLR_REG_BIT(T18T17M, T18T17M_T17X12_MSK)

#define T18T17M_T17CT_MSK               BIT2
#define TIMER17_TimerMode()             CLR_REG_BIT(T18T17M, T18T17M_T17CT_MSK)
#define TIMER17_CounterMode()           SET_REG_BIT(T18T17M, T18T17M_T17CT_MSK)

#define T18T17M_T17CLKO_MSK             BIT0
#define TIMER17_EnableCLKO()            SET_REG_BIT(T18T17M, T18T17M_T17CLKO_MSK)
#define TIMER17_DisableCLKO()           CLR_REG_BIT(T18T17M, T18T17M_T17CLKO_MSK)

////////////////////////

#define T18T17M_T18R_MSK                BIT7
#define TIMER18_Run()                   SET_REG_BIT(T18T17M, T18T17M_T18R_MSK)
#define TIMER18_Stop()                  CLR_REG_BIT(T18T17M, T18T17M_T18R_MSK)

#define TIMER18_SetReload16(n)          (T18H = HIBYTE(n), T18L = LOBYTE(n))
#define TIMER18_SetPrescale(n)          (TM18PS = (n))

#define T18T17M_T18X12_MSK              BIT5
#define TIMER18_1TMode()                SET_REG_BIT(T18T17M, T18T17M_T18X12_MSK)
#define TIMER18_12TMode()               CLR_REG_BIT(T18T17M, T18T17M_T18X12_MSK)

#define T18T17M_T18CT_MSK               BIT6
#define TIMER18_TimerMode()             CLR_REG_BIT(T18T17M, T18T17M_T18CT_MSK)
#define TIMER18_CounterMode()           SET_REG_BIT(T18T17M, T18T17M_T18CT_MSK)

#define T18T17M_T18CLKO_MSK             BIT4
#define TIMER18_EnableCLKO()            SET_REG_BIT(T18T17M, T18T17M_T18CLKO_MSK)
#define TIMER18_DisableCLKO()           CLR_REG_BIT(T18T17M, T18T17M_T18CLKO_MSK)

/////////////////////////////////////////////////

#define SCON_SM_MSK                     (BIT7 | BIT6)
#define UART1_SetMode(n)                MODIFY_REG(SCON, SCON_SM_MSK, ((n) << 6))
#define UART1_Mode0()                   UART1_SetMode(0)
#define UART1_Mode1()                   UART1_SetMode(1)
#define UART1_Mode2()                   UART1_SetMode(2)
#define UART1_Mode3()                   UART1_SetMode(3)

#define UART1_EnableRx()                (REN = 1)
#define UART1_DisableRx()               (REN = 0)
#define UART1_SetTB8(b)                 (TB8 = (b))
#define UART1_ReadRB8()                 (RB8)

#define UART1_SendData(d)               (SBUF = (d))
#define UART1_ReadData()                (SBUF)

#define PCON_SMOD_MSK                   BIT7
#define UART1_BaudrateX2()              SET_REG_BIT(PCON, PCON_SMOD_MSK)

#define AUXR_M0X6_MSK                   BIT5
#define UART1_Mode0BaudrateX6()         SET_REG_BIT(AUXR, AUXR_M0X6_MSK)

#define USARTCR2_PCEN_MSK               BIT2
#define USARTCR2_PS_MSK                 BIT1
#define UART1_NoneParity()              CLR_REG_BIT(USARTCR2, USARTCR2_PCEN_MSK)
#define UART1_OddParity()               SET_REG_BIT(USARTCR2, USARTCR2_PCEN_MSK); \
                                        SET_REG_BIT(USARTCR2, USARTCR2_PS_MSK)
#define UART1_EvenParity()              SET_REG_BIT(USARTCR2, USARTCR2_PCEN_MSK); \
                                        CLR_REG_BIT(USARTCR2, USARTCR2_PS_MSK)
#define UART1_MarkParity()              CLR_REG_BIT(USARTCR2, USARTCR2_PCEN_MSK); \
                                        UART1_SetTB8(1)
#define UART1_SpaceParity()             CLR_REG_BIT(USARTCR2, USARTCR2_PCEN_MSK); \
                                        UART1_SetTB8(0)

#define UR1TOCR_ENTO_MSK                BIT7
#define UART1_EnableTimeout()           SET_REG_BIT(UR1TOCR, UR1TOCR_ENTO_MSK)
#define UART1_DisableTimeout()          CLR_REG_BIT(UR1TOCR, UR1TOCR_ENTO_MSK)

#define UR1TOCR_SCALE_MSK               BIT5
#define UART1_TimeoutScale_SYSCLK()     SET_REG_BIT(UR1TOCR, UR1TOCR_SCALE_MSK)
#define UART1_TimeoutScale_BRT()        CLR_REG_BIT(UR1TOCR, UR1TOCR_SCALE_MSK)

#define UART1_SetTimeoutInterval(n)     UR1TOTL = BYTE0(n); \
                                        UR1TOTH = BYTE1(n); \
                                        UR1TOTE = BYTE2(n)

#define AUXR_S1BRT_MSK                  BIT0
#define UART1_Timer1BRT()               CLR_REG_BIT(AUXR, AUXR_S1BRT_MSK)
#define UART1_Timer2BRT()               SET_REG_BIT(AUXR, AUXR_S1BRT_MSK)

