fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
////////////////////////

#define S2CON_S2SM_MSK                  (BIT7 | BIT6)
#define UART2_SetMode(n)                MODIFY_REG(S2CON, S2CON_S2SM_MSK, ((n) << 6))
#define UART2_Mode0()                   UART2_SetMode(0)
#define UART2_Mode1()                   UART2_SetMode(1)
#define UART2_Mode2()                   UART2_SetMode(2)
#define UART2_Mode3()                   UART2_SetMode(3)

#define S2CON_S2REN_MSK                 BIT4
#define UART2_EnableRx()                SET_REG_BIT(S2CON, S2CON_S2REN_MSK)
#define UART2_DisableRx()               CLR_REG_BIT(S2CON, S2CON_S2REN_MSK)

#define S2CON_S2TB8_MSK                 BIT3
#define UART2_SetTB8(b)                 MODIFY_REG(S2CON, S2CON_S2TB8_MSK, ((b) << 3))

#define S2CON_S2RB8_MSK                 BIT2
#define UART2_ReadRB8()                 READ_REG_BIT(S2CON, S2CON_S2RB8_MSK)

#define UART2_SendData(d)               (S2BUF = (d))
#define UART2_ReadData()                (S2BUF)

#define S2CFG_S2M0X6_MSK                BIT5
#define UART2_Mode0BaudrateX6()         SET_REG_BIT(S2CFG, S2CFG_S2M0X6_MSK)

#define S2CFG_W1_MSK                    BIT1
#define UART2_Timer2BRT()               SET_REG_BIT(S2CFG, S2CFG_W1_MSK)

#define USART2CR2_PCEN_MSK              BIT2
#define USART2CR2_PS_MSK                BIT1
#define UART2_NoneParity()              CLR_REG_BIT(USART2CR2, USART2CR2_PCEN_MSK)
#define UART2_OddParity()               SET_REG_BIT(USART2CR2, USART2CR2_PCEN_MSK); \
                                        SET_REG_BIT(USART2CR2, USART2CR2_PS_MSK)
#define UART2_EvenParity()              SET_REG_BIT(USART2CR2, USART2CR2_PCEN_MSK); \
                                        CLR_REG_BIT(USART2CR2, USART2CR2_PS_MSK)
#define UART2_MarkParity()              CLR_REG_BIT(USART2CR2, USART2CR2_PCEN_MSK); \
                                        UART2_SetTB8(1)
#define UART2_SpaceParity()             CLR_REG_BIT(USART2CR2, USART2CR2_PCEN_MSK); \
                                        UART2_SetTB8(0)

#define UR2TOCR_ENTO_MSK                BIT7
#define UART2_EnableTimeout()           SET_REG_BIT(UR2TOCR, UR2TOCR_ENTO_MSK)
#define UART2_DisableTimeout()          CLR_REG_BIT(UR2TOCR, UR2TOCR_ENTO_MSK)

#define UR2TOCR_SCALE_MSK               BIT5
#define UART2_TimeoutScale_SYSCLK()     SET_REG_BIT(UR2TOCR, UR2TOCR_SCALE_MSK)
#define UART2_TimeoutScale_BRT()        CLR_REG_BIT(UR2TOCR, UR2TOCR_SCALE_MSK)

#define UART2_SetTimeoutInterval(n)     UR2TOTL = BYTE0(n); \
                                        UR2TOTH = BYTE1(n); \
                                        UR2TOTE = BYTE2(n)

////////////////////////

#define S3CON_S3SM_MSK                  (BIT7 | BIT6)
#define UART3_SetMode(n)                MODIFY_REG(S3CON, S3CON_S3SM_MSK, ((n) << 6))
#define UART3_Mode0()                   UART3_SetMode(0)
#define UART3_Mode1()                   UART3_SetMode(1)
#define UART3_Mode2()                   UART3_SetMode(2)
#define UART3_Mode3()                   UART3_SetMode(3)

#define S3CON_S3REN_MSK                 BIT4
#define UART3_EnableRx()                SET_REG_BIT(S3CON, S3CON_S3REN_MSK)
#define UART3_DisableRx()               CLR_REG_BIT(S3CON, S3CON_S3REN_MSK)

#define S3CON_S3TB8_MSK                 BIT3
#define UART3_SetTB8(b)                 MODIFY_REG(S3CON, S3CON_S3TB8_MSK, ((b) << 3))

#define S3CON_S3RB8_MSK                 BIT2
#define UART3_ReadRB8()                 READ_REG_BIT(S3CON, S3CON_S3RB8_MSK)

#define UART3_SendData(d)               (S3BUF = (d))
#define UART3_ReadData()                (S3BUF)

#define S3CFG_S3M0X6_MSK                BIT5
#define UART3_Mode0BaudrateX6()         SET_REG_BIT(S3CFG, S3CFG_S3M0X6_MSK)

#define USART3CR2_PCEN_MSK              BIT2
#define USART3CR2_PS_MSK                BIT1
#define UART3_NoneParity()              CLR_REG_BIT(USART3CR2, USART3CR2_PCEN_MSK)
#define UART3_OddParity()               SET_REG_BIT(USART3CR2, USART3CR2_PCEN_MSK); \
                                        SET_REG_BIT(USART3CR2, USART3CR2_PS_MSK)
#define UART3_EvenParity()              SET_REG_BIT(USART3CR2, USART3CR2_PCEN_MSK); \
                                        CLR_REG_BIT(USART3CR2, USART3CR2_PS_MSK)
#define UART3_MarkParity()              CLR_REG_BIT(USART3CR2, USART3CR2_PCEN_MSK); \
                                        UART3_SetTB8(1)
#define UART3_SpaceParity()             CLR_REG_BIT(USART3CR2, USART3CR2_PCEN_MSK); \
                                        UART3_SetTB8(0)

#define UR3TOCR_ENTO_MSK                BIT7
#define UART3_EnableTimeout()           SET_REG_BIT(UR3TOCR, UR3TOCR_ENTO_MSK)
#define UART3_DisableTimeout()          CLR_REG_BIT(UR3TOCR, UR3TOCR_ENTO_MSK)

#define UR3TOCR_SCALE_MSK               BIT5
#define UART3_TimeoutScale_SYSCLK()     SET_REG_BIT(UR3TOCR, UR3TOCR_SCALE_MSK)
#define UART3_TimeoutScale_BRT()        CLR_REG_BIT(UR3TOCR, UR3TOCR_SCALE_MSK)

#define UART3_SetTimeoutInterval(n)     UR3TOTL = BYTE0(n); \
                                        UR3TOTH = BYTE1(n); \
                                        UR3TOTE = BYTE2(n)

#define S3CFG_S3BRT_MSK                 BIT0
#define UART3_Timer2BRT()               CLR_REG_BIT(S3CFG, S3CFG_S3BRT_MSK)
#define UART3_Timer3BRT()               SET_REG_BIT(S3CFG, S3CFG_S3BRT_MSK)

////////////////////////

#define S4CON_S4SM_MSK                  (BIT7 | BIT6)
#define UART4_SetMode(n)                MODIFY_REG(S4CON, S4CON_S4SM_MSK, ((n) << 6))
#define UART4_Mode0()                   UART4_SetMode(0)
#define UART4_Mode1()                   UART4_SetMode(1)
#define UART4_Mode2()                   UART4_SetMode(2)
#define UART4_Mode3()                   UART4_SetMode(3)

#define S4CON_S4REN_MSK                 BIT4
#define UART4_EnableRx()                SET_REG_BIT(S4CON, S4CON_S4REN_MSK)
#define UART4_DisableRx()               CLR_REG_BIT(S4CON, S4CON_S4REN_MSK)

#define S4CON_S4TB8_MSK                 BIT3
#define UART4_SetTB8(b)                 MODIFY_REG(S4CON, S4CON_S4TB8_MSK, ((b) << 3))

#define S4CON_S4RB8_MSK                 BIT2
#define UART4_ReadRB8()                 READ_REG_BIT(S4CON, S4CON_S4RB8_MSK)

#define UART4_SendData(d)               (S4BUF = (d))
#define UART4_ReadData()                (S4BUF)

