fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define S4CFG_S4M0X6_MSK                BIT5
#define UART4_Mode0BaudrateX6()         SET_REG_BIT(S4CFG, S4CFG_S4M0X6_MSK)

#define USART4CR2_PCEN_MSK              BIT2
#define USART4CR2_PS_MSK                BIT1
#define UART4_NoneParity()              CLR_REG_BIT(USART4CR2, USART4CR2_PCEN_MSK)
#define UART4_OddParity()               SET_REG_BIT(USART4CR2, USART4CR2_PCEN_MSK); \
                                        SET_REG_BIT(USART4CR2, USART4CR2_PS_MSK)
#define UART4_EvenParity()              SET_REG_BIT(USART4CR2, USART4CR2_PCEN_MSK); \
                                        CLR_REG_BIT(USART4CR2, USART4CR2_PS_MSK)
#define UART4_MarkParity()              CLR_REG_BIT(USART4CR2, USART4CR2_PCEN_MSK); \
                                        UART4_SetTB8(1)
#define UART4_SpaceParity()             CLR_REG_BIT(USART4CR2, USART4CR2_PCEN_MSK); \
                                        UART4_SetTB8(0)

#define UR4TOCR_ENTO_MSK                BIT7
#define UART4_EnableTimeout()           SET_REG_BIT(UR4TOCR, UR4TOCR_ENTO_MSK)
#define UART4_DisableTimeout()          CLR_REG_BIT(UR4TOCR, UR4TOCR_ENTO_MSK)

#define UR4TOCR_SCALE_MSK               BIT5
#define UART4_TimeoutScale_SYSCLK()     SET_REG_BIT(UR4TOCR, UR4TOCR_SCALE_MSK)
#define UART4_TimeoutScale_BRT()        CLR_REG_BIT(UR4TOCR, UR4TOCR_SCALE_MSK)

#define UART4_SetTimeoutInterval(n)     UR4TOTL = BYTE0(n); \
                                        UR4TOTH = BYTE1(n); \
                                        UR4TOTE = BYTE2(n)

#define S4CFG_S4BRT_MSK                 BIT0
#define UART4_Timer2BRT()               CLR_REG_BIT(S4CFG, S4CFG_S4BRT_MSK)
#define UART4_Timer4BRT()               SET_REG_BIT(S4CFG, S4CFG_S4BRT_MSK)

////////////////////////

#define S5CON_S5SM_MSK                  (BIT7 | BIT6)
#define UART5_SetMode(n)                MODIFY_REG(S5CON, S5CON_S5SM_MSK, ((n) << 6))
#define UART5_Mode0()                   UART5_SetMode(0)
#define UART5_Mode1()                   UART5_SetMode(1)
#define UART5_Mode2()                   UART5_SetMode(2)
#define UART5_Mode3()                   UART5_SetMode(3)

#define S5CON_S5REN_MSK                 BIT4
#define UART5_EnableRx()                SET_REG_BIT(S5CON, S5CON_S5REN_MSK)
#define UART5_DisableRx()               CLR_REG_BIT(S5CON, S5CON_S5REN_MSK)

#define S5CON_S5TB8_MSK                 BIT3
#define UART5_SetTB8(b)                 MODIFY_REG(S5CON, S5CON_S5TB8_MSK, ((b) << 3))

#define S5CON_S5RB8_MSK                 BIT2
#define UART5_ReadRB8()                 READ_REG_BIT(S5CON, S5CON_S5RB8_MSK)

#define UART5_SendData(d)               (S5BUF = (d))
#define UART5_ReadData()                (S5BUF)

#define S5CFG_S5M0X6_MSK                BIT5
#define UART5_Mode0BaudrateX6()         SET_REG_BIT(S5CFG, S5CFG_S5M0X6_MSK)

#define USART5CR2_PCEN_MSK              BIT2
#define USART5CR2_PS_MSK                BIT1
#define UART5_NoneParity()              CLR_REG_BIT(USART5CR2, USART5CR2_PCEN_MSK)
#define UART5_OddParity()               SET_REG_BIT(USART5CR2, USART5CR2_PCEN_MSK); \
                                        SET_REG_BIT(USART5CR2, USART5CR2_PS_MSK)
#define UART5_EvenParity()              SET_REG_BIT(USART5CR2, USART5CR2_PCEN_MSK); \
                                        CLR_REG_BIT(USART5CR2, USART5CR2_PS_MSK)
#define UART5_MarkParity()              CLR_REG_BIT(USART5CR2, USART5CR2_PCEN_MSK); \
                                        UART5_SetTB8(1)
#define UART5_SpaceParity()             CLR_REG_BIT(USART5CR2, USART5CR2_PCEN_MSK); \
                                        UART5_SetTB8(0)

#define UR5TOCR_ENTO_MSK                BIT7
#define UART5_EnableTimeout()           SET_REG_BIT(UR5TOCR, UR5TOCR_ENTO_MSK)
#define UART5_DisableTimeout()          CLR_REG_BIT(UR5TOCR, UR5TOCR_ENTO_MSK)

#define UR5TOCR_SCALE_MSK               BIT5
#define UART5_TimeoutScale_SYSCLK()     SET_REG_BIT(UR5TOCR, UR5TOCR_SCALE_MSK)
#define UART5_TimeoutScale_BRT()        CLR_REG_BIT(UR5TOCR, UR5TOCR_SCALE_MSK)

#define UART5_SetTimeoutInterval(n)     UR5TOTL = BYTE0(n); \
                                        UR5TOTH = BYTE1(n); \
                                        UR5TOTE = BYTE2(n)

#define S5CFG_S5BRT_MSK                 BIT0
#define UART5_Timer2BRT()               CLR_REG_BIT(S5CFG, S5CFG_S5BRT_MSK)
#define UART5_Timer5BRT()               SET_REG_BIT(S5CFG, S5CFG_S5BRT_MSK)

////////////////////////

#define S6CON_S6SM_MSK                  (BIT7 | BIT6)
#define UART6_SetMode(n)                MODIFY_REG(S6CON, S6CON_S6SM_MSK, ((n) << 6))
#define UART6_Mode0()                   UART6_SetMode(0)
#define UART6_Mode1()                   UART6_SetMode(1)
#define UART6_Mode2()                   UART6_SetMode(2)
#define UART6_Mode3()                   UART6_SetMode(3)

#define S6CON_S6REN_MSK                 BIT4
#define UART6_EnableRx()                SET_REG_BIT(S6CON, S6CON_S6REN_MSK)
#define UART6_DisableRx()               CLR_REG_BIT(S6CON, S6CON_S6REN_MSK)

#define S6CON_S6TB8_MSK                 BIT3
#define UART6_SetTB8(b)                 MODIFY_REG(S6CON, S6CON_S6TB8_MSK, ((b) << 3))

#define S6CON_S6RB8_MSK                 BIT2
#define UART6_ReadRB8()                 READ_REG_BIT(S6CON, S6CON_S6RB8_MSK)

#define UART6_SendData(d)               (S6BUF = (d))
#define UART6_ReadData()                (S6BUF)

#define S6CFG_S6M0X6_MSK                BIT5
#define UART6_Mode0BaudrateX6()         SET_REG_BIT(S6CFG, S6CFG_S6M0X6_MSK)

#define USART6CR2_PCEN_MSK              BIT2
#define USART6CR2_PS_MSK                BIT1
#define UART6_NoneParity()              CLR_REG_BIT(USART6CR2, USART6CR2_PCEN_MSK)
#define UART6_OddParity()               SET_REG_BIT(USART6CR2, USART6CR2_PCEN_MSK); \
                                        SET_REG_BIT(USART6CR2, USART6CR2_PS_MSK)
#define UART6_EvenParity()              SET_REG_BIT(USART6CR2, USART6CR2_PCEN_MSK); \
                                        CLR_REG_BIT(USART6CR2, USART6CR2_PS_MSK)
#define UART6_MarkParity()              CLR_REG_BIT(USART6CR2, USART6CR2_PCEN_MSK); \
                                        UART6_SetTB8(1)
#define UART6_SpaceParity()             CLR_REG_BIT(USART6CR2, USART6CR2_PCEN_MSK); \
                                        UART6_SetTB8(0)

#define UR6TOCR_ENTO_MSK                BIT7
#define UART6_EnableTimeout()           SET_REG_BIT(UR6TOCR, UR6TOCR_ENTO_MSK)
#define UART6_DisableTimeout()          CLR_REG_BIT(UR6TOCR, UR6TOCR_ENTO_MSK)

#define UR6TOCR_SCALE_MSK               BIT5
#define UART6_TimeoutScale_SYSCLK()     SET_REG_BIT(UR6TOCR, UR6TOCR_SCALE_MSK)
#define UART6_TimeoutScale_BRT()        CLR_REG_BIT(UR6TOCR, UR6TOCR_SCALE_MSK)

#define UART6_SetTimeoutInterval(n)     UR6TOTL = BYTE0(n); \
                                        UR6TOTH = BYTE1(n); \
                                        UR6TOTE = BYTE2(n)

#define S6CFG_S6BRT_MSK                 BIT0
#define UART6_Timer2BRT()               CLR_REG_BIT(S6CFG, S6CFG_S6BRT_MSK)
#define UART6_Timer6BRT()               SET_REG_BIT(S6CFG, S6CFG_S6BRT_MSK)

