fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
////////////////////////

#define S7CON_S7SM_MSK                  (BIT7 | BIT6)
#define UART7_SetMode(n)                MODIFY_REG(S7CON, S7CON_S7SM_MSK, ((n) << 6))
#define UART7_Mode0()                   UART7_SetMode(0)
#define UART7_Mode1()                   UART7_SetMode(1)
#define UART7_Mode2()                   UART7_SetMode(2)
#define UART7_Mode3()                   UART7_SetMode(3)

#define S7CON_S7REN_MSK                 BIT4
#define UART7_EnableRx()                SET_REG_BIT(S7CON, S7CON_S7REN_MSK)
#define UART7_DisableRx()               CLR_REG_BIT(S7CON, S7CON_S7REN_MSK)

#define S7CON_S7TB8_MSK                 BIT3
#define UART7_SetTB8(b)                 MODIFY_REG(S7CON, S7CON_S7TB8_MSK, ((b) << 3))

#define S7CON_S7RB8_MSK                 BIT2
#define UART7_ReadRB8()                 READ_REG_BIT(S7CON, S7CON_S7RB8_MSK)

#define UART7_SendData(d)               (S7BUF = (d))
#define UART7_ReadData()                (S7BUF)

#define S7CFG_S7M0X6_MSK                BIT5
#define UART7_Mode0BaudrateX6()         SET_REG_BIT(S7CFG, S7CFG_S7M0X6_MSK)

#define USART7CR2_PCEN_MSK              BIT2
#define USART7CR2_PS_MSK                BIT1
#define UART7_NoneParity()              CLR_REG_BIT(USART7CR2, USART7CR2_PCEN_MSK)
#define UART7_OddParity()               SET_REG_BIT(USART7CR2, USART7CR2_PCEN_MSK); \
                                        SET_REG_BIT(USART7CR2, USART7CR2_PS_MSK)
#define UART7_EvenParity()              SET_REG_BIT(USART7CR2, USART7CR2_PCEN_MSK); \
                                        CLR_REG_BIT(USART7CR2, USART7CR2_PS_MSK)
#define UART7_MarkParity()              CLR_REG_BIT(USART7CR2, USART7CR2_PCEN_MSK); \
                                        UART7_SetTB8(1)
#define UART7_SpaceParity()             CLR_REG_BIT(USART7CR2, USART7CR2_PCEN_MSK); \
                                        UART7_SetTB8(0)

#define UR7TOCR_ENTO_MSK                BIT7
#define UART7_EnableTimeout()           SET_REG_BIT(UR7TOCR, UR7TOCR_ENTO_MSK)
#define UART7_DisableTimeout()          CLR_REG_BIT(UR7TOCR, UR7TOCR_ENTO_MSK)

#define UR7TOCR_SCALE_MSK               BIT5
#define UART7_TimeoutScale_SYSCLK()     SET_REG_BIT(UR7TOCR, UR7TOCR_SCALE_MSK)
#define UART7_TimeoutScale_BRT()        CLR_REG_BIT(UR7TOCR, UR7TOCR_SCALE_MSK)

#define UART7_SetTimeoutInterval(n)     UR7TOTL = BYTE0(n); \
                                        UR7TOTH = BYTE1(n); \
                                        UR7TOTE = BYTE2(n)

#define S7CFG_S7BRT_MSK                 BIT0
#define UART7_Timer2BRT()               CLR_REG_BIT(S7CFG, S7CFG_S7BRT_MSK)
#define UART7_Timer7BRT()               SET_REG_BIT(S7CFG, S7CFG_S7BRT_MSK)

////////////////////////

#define S8CON_S8SM_MSK                  (BIT7 | BIT6)
#define UART8_SetMode(n)                MODIFY_REG(S8CON, S8CON_S8SM_MSK, ((n) << 6))
#define UART8_Mode0()                   UART8_SetMode(0)
#define UART8_Mode1()                   UART8_SetMode(1)
#define UART8_Mode2()                   UART8_SetMode(2)
#define UART8_Mode3()                   UART8_SetMode(3)

#define S8CON_S8REN_MSK                 BIT4
#define UART8_EnableRx()                SET_REG_BIT(S8CON, S8CON_S8REN_MSK)
#define UART8_DisableRx()               CLR_REG_BIT(S8CON, S8CON_S8REN_MSK)

#define S8CON_S8TB8_MSK                 BIT3
#define UART8_SetTB8(b)                 MODIFY_REG(S8CON, S8CON_S8TB8_MSK, ((b) << 3))

#define S8CON_S8RB8_MSK                 BIT2
#define UART8_ReadRB8()                 READ_REG_BIT(S8CON, S8CON_S8RB8_MSK)

#define UART8_SendData(d)               (S8BUF = (d))
#define UART8_ReadData()                (S8BUF)

#define S8CFG_S8M0X6_MSK                BIT5
#define UART8_Mode0BaudrateX6()         SET_REG_BIT(S8CFG, S8CFG_S8M0X6_MSK)

#define USART8CR2_PCEN_MSK              BIT2
#define USART8CR2_PS_MSK                BIT1
#define UART8_NoneParity()              CLR_REG_BIT(USART8CR2, USART8CR2_PCEN_MSK)
#define UART8_OddParity()               SET_REG_BIT(USART8CR2, USART8CR2_PCEN_MSK); \
                                        SET_REG_BIT(USART8CR2, USART8CR2_PS_MSK)
#define UART8_EvenParity()              SET_REG_BIT(USART8CR2, USART8CR2_PCEN_MSK); \
                                        CLR_REG_BIT(USART8CR2, USART8CR2_PS_MSK)
#define UART8_MarkParity()              CLR_REG_BIT(USART8CR2, USART8CR2_PCEN_MSK); \
                                        UART8_SetTB8(1)
#define UART8_SpaceParity()             CLR_REG_BIT(USART8CR2, USART8CR2_PCEN_MSK); \
                                        UART8_SetTB8(0)

#define UR8TOCR_ENTO_MSK                BIT7
#define UART8_EnableTimeout()           SET_REG_BIT(UR8TOCR, UR8TOCR_ENTO_MSK)
#define UART8_DisableTimeout()          CLR_REG_BIT(UR8TOCR, UR8TOCR_ENTO_MSK)

#define UR8TOCR_SCALE_MSK               BIT5
#define UART8_TimeoutScale_SYSCLK()     SET_REG_BIT(UR8TOCR, UR8TOCR_SCALE_MSK)
#define UART8_TimeoutScale_BRT()        CLR_REG_BIT(UR8TOCR, UR8TOCR_SCALE_MSK)

#define UART8_SetTimeoutInterval(n)     UR8TOTL = BYTE0(n); \
                                        UR8TOTH = BYTE1(n); \
                                        UR8TOTE = BYTE2(n)

#define S8CFG_S8BRT_MSK                 BIT0
#define UART8_Timer2BRT()               CLR_REG_BIT(S8CFG, S8CFG_S8BRT_MSK)
#define UART8_Timer8BRT()               SET_REG_BIT(S8CFG, S8CFG_S8BRT_MSK)

/////////////////////////////////////////////////

#define CMP1CR1_CMP1EN_MSK              BIT7
#define CMP1_Enable()                   SET_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_CMP1EN_MSK)
#define CMP1_Disable()                  CLR_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_CMP1EN_MSK)

#define CMP1CR1_CMP1OE_MSK              BIT1
#define CMP1_EnableOutput()             SET_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_CMP1OE_MSK)
#define CMP1_DisableOutput()            CLR_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_CMP1OE_MSK)

#define CMP1CR1_CMP1RES_MSK             BIT0
#define CMP1_ReadResult()               READ_REG_BIT(CMP1_6P6N_CR1, CMP1CR1_CMP1RES_MSK)

#define CMP1CR2_INVO_MSK                BIT7
#define CMP1_OutputInvert()             SET_REG_BIT(CMP1_6P6N_CR2, CMP1CR2_INVO_MSK)

#define CMP1CR2_DISFLT_MSK              BIT6
#define CMP1_EnableAnalogFilter()       CLR_REG_BIT(CMP1_6P6N_CR2, CMP1CR2_DISFLT_MSK)
#define CMP1_DisableAnalogFilter()      SET_REG_BIT(CMP1_6P6N_CR2, CMP1CR2_DISFLT_MSK)

#define CMP1CR2_LCDTY_MSK               (BIT5 | BIT4 | BIT_LN)
#define CMP1_SetDigitalFilter(n)        MODIFY_REG(CMP1_6P6N_CR2, CMP1CR2_LCDTY_MSK, ((n) << 0))

#define CMP1CR3_CHYS_MSK                (BIT7 | BIT6)
#define CMP1_SetHysteresis(n)           MODIFY_REG(CMP1_6P6N_CR3, CMP1CR3_CHYS_MSK, ((n) << 6))
#define CMP1_DisableHysteresis()        CMP1_SetHysteresis(0)
#define CMP1_SetHysteresis_10mV()       CMP1_SetHysteresis(1)
#define CMP1_SetHysteresis_20mV()       CMP1_SetHysteresis(2)
#define CMP1_SetHysteresis_30mV()       CMP1_SetHysteresis(3)

