fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
////////////////////////

#define CMP2CR1_CMP2EN_MSK              BIT7
#define CMP2_Enable()                   SET_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_CMP2EN_MSK)
#define CMP2_Disable()                  CLR_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_CMP2EN_MSK)

#define CMP2CR1_CMP2OE_MSK              BIT1
#define CMP2_EnableOutput()             SET_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_CMP2OE_MSK)
#define CMP2_DisableOutput()            CLR_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_CMP2OE_MSK)

#define CMP2CR1_CMP2RES_MSK             BIT0
#define CMP2_ReadResult()               READ_REG_BIT(CMP2_6P6N_CR1, CMP2CR1_CMP2RES_MSK)

#define CMP2CR2_INVO_MSK                BIT7
#define CMP2_OutputInvert()             SET_REG_BIT(CMP2_6P6N_CR2, CMP2CR2_INVO_MSK)

#define CMP2CR2_DISFLT_MSK              BIT6
#define CMP2_EnableAnalogFilter()       CLR_REG_BIT(CMP2_6P6N_CR2, CMP2CR2_DISFLT_MSK)
#define CMP2_DisableAnalogFilter()      SET_REG_BIT(CMP2_6P6N_CR2, CMP2CR2_DISFLT_MSK)

#define CMP2CR2_LCDTY_MSK               (BIT5 | BIT4 | BIT_LN)
#define CMP2_SetDigitalFilter(n)        MODIFY_REG(CMP2_6P6N_CR2, CMP2CR2_LCDTY_MSK, ((n) << 0))

#define CMP2CR3_CHYS_MSK                (BIT7 | BIT6)
#define CMP2_SetHysteresis(n)           MODIFY_REG(CMP2_6P6N_CR3, CMP2CR3_CHYS_MSK, ((n) << 6))
#define CMP2_DisableHysteresis()        CMP2_SetHysteresis(0)
#define CMP2_SetHysteresis_10mV()       CMP2_SetHysteresis(1)
#define CMP2_SetHysteresis_20mV()       CMP2_SetHysteresis(2)
#define CMP2_SetHysteresis_30mV()       CMP2_SetHysteresis(3)

////////////////////////

#define CMP3CR1_CMP3EN_MSK              BIT7
#define CMP3_Enable()                   SET_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_CMP3EN_MSK)
#define CMP3_Disable()                  CLR_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_CMP3EN_MSK)

#define CMP3CR1_CMP3OE_MSK              BIT1
#define CMP3_EnableOutput()             SET_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_CMP3OE_MSK)
#define CMP3_DisableOutput()            CLR_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_CMP3OE_MSK)

#define CMP3CR1_CMP3RES_MSK             BIT0
#define CMP3_ReadResult()               READ_REG_BIT(CMP3_6P6N_CR1, CMP3CR1_CMP3RES_MSK)

#define CMP3CR2_INVO_MSK                BIT7
#define CMP3_OutputInvert()             SET_REG_BIT(CMP3_6P6N_CR2, CMP3CR2_INVO_MSK)

#define CMP3CR2_DISFLT_MSK              BIT6
#define CMP3_EnableAnalogFilter()       CLR_REG_BIT(CMP3_6P6N_CR2, CMP3CR2_DISFLT_MSK)
#define CMP3_DisableAnalogFilter()      SET_REG_BIT(CMP3_6P6N_CR2, CMP3CR2_DISFLT_MSK)

#define CMP3CR2_LCDTY_MSK               (BIT5 | BIT4 | BIT_LN)
#define CMP3_SetDigitalFilter(n)        MODIFY_REG(CMP3_6P6N_CR2, CMP3CR2_LCDTY_MSK, ((n) << 0))

#define CMP3CR3_CHYS_MSK                (BIT7 | BIT6)
#define CMP3_SetHysteresis(n)           MODIFY_REG(CMP3_6P6N_CR3, CMP3CR3_CHYS_MSK, ((n) << 6))
#define CMP3_DisableHysteresis()        CMP3_SetHysteresis(0)
#define CMP3_SetHysteresis_10mV()       CMP3_SetHysteresis(1)
#define CMP3_SetHysteresis_20mV()       CMP3_SetHysteresis(2)
#define CMP3_SetHysteresis_30mV()       CMP3_SetHysteresis(3)

////////////////////////

#define CMP4CR1_CMP4EN_MSK              BIT7
#define CMP4_Enable()                   SET_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_CMP4EN_MSK)
#define CMP4_Disable()                  CLR_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_CMP4EN_MSK)

#define CMP4CR1_CMP4OE_MSK              BIT1
#define CMP4_EnableOutput()             SET_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_CMP4OE_MSK)
#define CMP4_DisableOutput()            CLR_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_CMP4OE_MSK)

#define CMP4CR1_CMP4RES_MSK             BIT0
#define CMP4_ReadResult()               READ_REG_BIT(CMP4_6P6N_CR1, CMP4CR1_CMP4RES_MSK)

#define CMP4CR2_INVO_MSK                BIT7
#define CMP4_OutputInvert()             SET_REG_BIT(CMP4_6P6N_CR2, CMP4CR2_INVO_MSK)

#define CMP4CR2_DISFLT_MSK              BIT6
#define CMP4_EnableAnalogFilter()       CLR_REG_BIT(CMP4_6P6N_CR2, CMP4CR2_DISFLT_MSK)
#define CMP4_DisableAnalogFilter()      SET_REG_BIT(CMP4_6P6N_CR2, CMP4CR2_DISFLT_MSK)

#define CMP4CR2_LCDTY_MSK               (BIT5 | BIT4 | BIT_LN)
#define CMP4_SetDigitalFilter(n)        MODIFY_REG(CMP4_6P6N_CR2, CMP4CR2_LCDTY_MSK, ((n) << 0))

#define CMP4CR3_CHYS_MSK                (BIT7 | BIT6)
#define CMP4_SetHysteresis(n)           MODIFY_REG(CMP4_6P6N_CR3, CMP4CR3_CHYS_MSK, ((n) << 6))
#define CMP4_DisableHysteresis()        CMP4_SetHysteresis(0)
#define CMP4_SetHysteresis_10mV()       CMP4_SetHysteresis(1)
#define CMP4_SetHysteresis_20mV()       CMP4_SetHysteresis(2)
#define CMP4_SetHysteresis_30mV()       CMP4_SetHysteresis(3)

/////////////////////////////////////////////////

#define IAPCON_IAPEN_MSK                BIT7
#define IAP_Enable()                    SET_REG_BIT(IAP_CONTR, IAPCON_IAPEN_MSK)
#define IAP_Disable()                   CLR_REG_BIT(IAP_CONTR, IAPCON_IAPEN_MSK)

#define IAP_SetData(d)                  (IAP_DATA = (d))
#define IAP_ReadData()                  (IAP_DATA)

#define IAP_SetDataX(n, d)              (IAP_XDATA[n] = (d))
#define IAP_ReadDataX(n)                (IAP_XDATA[n])

#define IAP_SetAddress(n)               IAP_ADDRL = BYTE0(n); \
                                        IAP_ADDRH = BYTE1(n); \
                                        IAP_ADDRE = BYTE2(n)

#define IAP_Trigger()                   IAP_TRIG = 0x5a; \
                                        IAP_TRIG = 0xa5; \
                                        _nop_();         \
                                        _nop_();         \
                                        _nop_();         \
                                        _nop_()

#define IAP_Idle()                      IAP_CMD = 0
#define IAP_TriggerRead()               IAP_CMD = 1; IAP_Trigger()
#define IAP_TriggerProgram()            IAP_CMD = 2; IAP_Trigger()
#define IAP_TriggerErase()              IAP_CMD = 3; IAP_Trigger()

#define IAP_TriggerRead4Bytes()         IAP_CMD = 5; IAP_Trigger()
#define IAP_TriggerRead8Bytes()         IAP_CMD = 6; IAP_Trigger()
#define IAP_TriggerRead16Bytes()        IAP_CMD = 7; IAP_Trigger()
#define IAP_TriggerProgram4Bytes()      IAP_CMD = 13; IAP_Trigger()
#define IAP_TriggerProgram8Bytes()      IAP_CMD = 14; IAP_Trigger()
#define IAP_TriggerProgram16Bytes()     IAP_CMD = 15; IAP_Trigger()

#define IAP_SetTimeBase()               IAP_TPS = ((SYSCLK) / 1000000)

#define IAPCON_FAIL_MSK                 BIT4
#define IAP_CheckErrorFlag()            READ_REG_BIT(IAP_CONTR, IAPCON_FAIL_MSK)
#define IAP_ClearErrorFlag()            CLR_REG_BIT(IAP_CONTR, IAPCON_FAIL_MSK)

/////////////////////////////////////////////////

#define ADCCONTR_ADCPOWER_MSK           BIT7
#define ADC1_Enable()                   SET_REG_BIT(ADC_CONTR, ADCCONTR_ADCPOWER_MSK)
#define ADC1_Disable()                  CLR_REG_BIT(ADC_CONTR, ADCCONTR_ADCPOWER_MSK)

#define ADC1_ReadResult()               MAKEWORD(ADC_RESL, ADC_RES)

#define ADCCONTR_ADCSTART_MSK           BIT6
#define ADC1_Start()                    SET_REG_BIT(ADC_CONTR, ADCCONTR_ADCSTART_MSK)

