fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define ADCCONTR_ADCCHS_MSK             (BIT_LN)
#define ADC1_ActiveChannel(n)           MODIFY_REG(ADC_CONTR, ADCCONTR_ADCCHS_MSK, ((n) << 0))

#define ADCCONTR_ADCEPWMT_MSK           BIT4
#define ADC1_EnablePWMTrig()            SET_REG_BIT(ADC_CONTR, ADCCONTR_ADCEPWMT_MSK)
#define ADC1_DisablePWMTrig()           CLR_REG_BIT(ADC_CONTR, ADCCONTR_ADCEPWMT_MSK)

#define ADCCFG_RESFMT_MSK               BIT5
#define ADC1_ResultLeftAlign()          CLR_REG_BIT(ADCCFG, ADCCFG_RESFMT_MSK)
#define ADC1_ResultRightAlign()         SET_REG_BIT(ADCCFG, ADCCFG_RESFMT_MSK)

#define ADCCFG_SPEED_MSK                (BIT_LN)
#define ADC1_SetClockDivider(n)         MODIFY_REG(ADCCFG, ADCCFG_SPEED_MSK, ((n) << 0))

#define ADCEXCFG_ETRE_MSK               BIT5
#define ADC1_EnableETR()                SET_REG_BIT(ADCEXCFG, ADCEXCFG_ETRE_MSK)
#define ADC1_DisableETR()               CLR_REG_BIT(ADCEXCFG, ADCEXCFG_ETRE_MSK)

#define ADCEXCFG_ETRP_MSK               BIT4
#define ADC1_ETRRising()                CLR_REG_BIT(ADCEXCFG, ADCEXCFG_ETRP_MSK)
#define ADC1_ETRFalling()               SET_REG_BIT(ADCEXCFG, ADCEXCFG_ETRP_MSK)

#define ADCEXCFG_CVT_MSK                (BIT2 | BIT1 | BIT0)
#define ADC1_SetRepeatTimes(n)          MODIFY_REG(ADCEXCFG, ADCEXCFG_CVT_MSK, ((n) << 0))

#define ADC1_DisableRepeatConv()        ADC1_SetRepeatTimes(0)
#define ADC1_SetRepeat2Times()          ADC1_SetRepeatTimes(4)
#define ADC1_SetRepeat4Times()          ADC1_SetRepeatTimes(5)
#define ADC1_SetRepeat8Times()          ADC1_SetRepeatTimes(6)
#define ADC1_SetRepeat16Times()         ADC1_SetRepeatTimes(7)

#define ADCTIM_CSSETUP_MSK              BIT7
#define ADCTIM_CSHOLD_MSK               (BIT6 | BIT5)
#define ADCTIM_SMPDUTY_MSK              (BIT4 | BIT_LN)
#define ADC1_SetCSSetupCycles(n)        MODIFY_REG(ADCTIM, ADCTIM_CSSETUP_MSK, (((n) - 1) << 7))
#define ADC1_SetCSHoldCycles(n)         MODIFY_REG(ADCTIM, ADCTIM_CSHOLD_MSK, (((n) - 1) << 5))
#define ADC1_SetSampleDutyCycles(n)     MODIFY_REG(ADCTIM, ADCTIM_SMPDUTY_MSK, (((n) - 1) << 0))

#define ADCEXCFG2_TRIGON_MSK            BIT7
#define ADC1_ADC2_IndependMode()        CLR_REG_BIT(ADCEXCFG2, ADCEXCFG2_TRIGON_MSK)
#define ADC1_ADC2_LinkageMode()         SET_REG_BIT(ADCEXCFG2, ADCEXCFG2_TRIGON_MSK)

#define ADCEXCFG2_PWMCFG_MSK            (BIT5 | BIT4)
#define ADC1_TriggerMode(n)             MODIFY_REG(ADCEXCFG2, ADCEXCFG2_PWMCFG_MSK, ((n) << 4))
#define ADC1_TriggerDisable()           ADC1_TriggerMode(0)
#define ADC1_RisingTrigger()            ADC1_TriggerMode(1)
#define ADC1_FallingTrigger()           ADC1_TriggerMode(2)
#define ADC1_EdgeTrigger()              ADC1_TriggerMode(3)

#define ADCEXCFG2_TRIGSEL_MSK           (BIT_LN)
#define ADC1_TriggerSel(n)              MODIFY_REG(ADCEXCFG2, ADCEXCFG2_TRIGSEL_MSK, ((n) << 0))
#define ADC1_PWMATrgoTrigger()          ADC1_TriggerSel(0)
#define ADC1_PWMCTrgoTrigger()          ADC1_TriggerSel(1)
#define ADC1_PWMETrgoTrigger()          ADC1_TriggerSel(2)
#define ADC1_PWMATrgo2Trigger()         ADC1_TriggerSel(3)
#define ADC1_PWMCTrgo2Trigger()         ADC1_TriggerSel(4)
#define ADC1_PWMETrgo2Trigger()         ADC1_TriggerSel(5)
#define ADC1_PWMBTrgoTrigger()          ADC1_TriggerSel(6)
#define ADC1_PWMDTrgoTrigger()          ADC1_TriggerSel(7)
#define ADC1_PWMFTrgoTrigger()          ADC1_TriggerSel(8)
#define ADC1_AlwaysTrigger()            ADC1_TriggerSel(9)
#define ADC1_NoneTrigger()              ADC1_TriggerSel(10)
#define ADC1_T17Trigger()               ADC1_TriggerSel(12)
#define ADC1_T18Trigger()               ADC1_TriggerSel(13)
#define ADC1_T17PhaseTrigger()          ADC1_TriggerSel(14)
#define ADC1_T18PhaseTrigger()          ADC1_TriggerSel(15)

////////////////////////

#define ADC2CONTR_ADC2POWER_MSK         BIT7
#define ADC2_Enable()                   SET_REG_BIT(ADC2_CONTR, ADC2CONTR_ADC2POWER_MSK)
#define ADC2_Disable()                  CLR_REG_BIT(ADC2_CONTR, ADC2CONTR_ADC2POWER_MSK)

#define ADC2_ReadResult()               MAKEWORD(ADC2_RESL, ADC2_RES)

#define ADC2CONTR_ADC2START_MSK         BIT6
#define ADC2_Start()                    SET_REG_BIT(ADC2_CONTR, ADC2CONTR_ADC2START_MSK)

#define ADC2CONTR_ADC2CHS_MSK           (BIT_LN)
#define ADC2_ActiveChannel(n)           MODIFY_REG(ADC2_CONTR, ADC2CONTR_ADC2CHS_MSK, ((n) << 0))

#define ADC2CONTR_ADC2EPWMT_MSK         BIT4
#define ADC2_EnablePWMTrig()            SET_REG_BIT(ADC2_CONTR, ADC2CONTR_ADC2EPWMT_MSK)
#define ADC2_DisablePWMTrig()           CLR_REG_BIT(ADC2_CONTR, ADC2CONTR_ADC2EPWMT_MSK)

#define ADC2CFG_RESFMT_MSK              BIT5
#define ADC2_ResultLeftAlign()          CLR_REG_BIT(ADC2CFG, ADC2CFG_RESFMT_MSK)
#define ADC2_ResultRightAlign()         SET_REG_BIT(ADC2CFG, ADC2CFG_RESFMT_MSK)

#define ADC2CFG_SPEED_MSK               (BIT_LN)
#define ADC2_SetClockDivider(n)         MODIFY_REG(ADC2CFG, ADC2CFG_SPEED_MSK, ((n) << 0))

#define ADC2EXCFG_ETRE_MSK              BIT5
#define ADC2_EnableETR()                SET_REG_BIT(ADC2EXCFG, ADC2EXCFG_ETRE_MSK)
#define ADC2_DisableETR()               CLR_REG_BIT(ADC2EXCFG, ADC2EXCFG_ETRE_MSK)

#define ADC2EXCFG_ETRP_MSK              BIT4
#define ADC2_ETRRising()                CLR_REG_BIT(ADC2EXCFG, ADC2EXCFG_ETRP_MSK)
#define ADC2_ETRFalling()               SET_REG_BIT(ADC2EXCFG, ADC2EXCFG_ETRP_MSK)

#define ADC2EXCFG_CVT_MSK               (BIT2 | BIT1 | BIT0)
#define ADC2_SetRepeatTimes(n)          MODIFY_REG(ADC2EXCFG, ADC2EXCFG_CVT_MSK, ((n) << 0))

#define ADC2_DisableRepeatConv()        ADC2_SetRepeatTimes(0)
#define ADC2_SetRepeat2Times()          ADC2_SetRepeatTimes(4)
#define ADC2_SetRepeat4Times()          ADC2_SetRepeatTimes(5)
#define ADC2_SetRepeat8Times()          ADC2_SetRepeatTimes(6)
#define ADC2_SetRepeat16Times()         ADC2_SetRepeatTimes(7)

#define ADC2TIM_CSSETUP_MSK             BIT7
#define ADC2TIM_CSHOLD_MSK              (BIT6 | BIT5)
#define ADC2TIM_SMPDUTY_MSK             (BIT4 | BIT_LN)
#define ADC2_SetCSSetupCycles(n)        MODIFY_REG(ADC2TIM, ADC2TIM_CSSETUP_MSK, (((n) - 1) << 7))
#define ADC2_SetCSHoldCycles(n)         MODIFY_REG(ADC2TIM, ADC2TIM_CSHOLD_MSK, (((n) - 1) << 5))
#define ADC2_SetSampleDutyCycles(n)     MODIFY_REG(ADC2TIM, ADC2TIM_SMPDUTY_MSK, (((n) - 1) << 0))

#define ADC2EXCFG2_PWMCFG_MSK           (BIT5 | BIT4)
#define ADC2_TriggerMode(n)             MODIFY_REG(ADC2EXCFG2, ADC2EXCFG2_PWMCFG_MSK, ((n) << 4))
#define ADC2_TriggerDisable()           ADC2_TriggerMode(0)
#define ADC2_RisingTrigger()            ADC2_TriggerMode(1)
#define ADC2_FallingTrigger()           ADC2_TriggerMode(2)
#define ADC2_EdgeTrigger()              ADC2_TriggerMode(3)

