fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define ADC2EXCFG2_TRIGSEL_MSK          (BIT_LN)
#define ADC2_TriggerSel(n)              MODIFY_REG(ADC2EXCFG2, ADC2EXCFG2_TRIGSEL_MSK, ((n) << 0))
#define ADC2_PWMATrgoTrigger()          ADC2_TriggerSel(0)
#define ADC2_PWMCTrgoTrigger()          ADC2_TriggerSel(1)
#define ADC2_PWMETrgoTrigger()          ADC2_TriggerSel(2)
#define ADC2_PWMATrgo2Trigger()         ADC2_TriggerSel(3)
#define ADC2_PWMCTrgo2Trigger()         ADC2_TriggerSel(4)
#define ADC2_PWMETrgo2Trigger()         ADC2_TriggerSel(5)
#define ADC2_PWMBTrgoTrigger()          ADC2_TriggerSel(6)
#define ADC2_PWMDTrgoTrigger()          ADC2_TriggerSel(7)
#define ADC2_PWMFTrgoTrigger()          ADC2_TriggerSel(8)
#define ADC2_AlwaysTrigger()            ADC2_TriggerSel(9)
#define ADC2_NoneTrigger()              ADC2_TriggerSel(10)
#define ADC2_T17Trigger()               ADC2_TriggerSel(12)
#define ADC2_T18Trigger()               ADC2_TriggerSel(13)
#define ADC2_T17PhaseTrigger()          ADC2_TriggerSel(14)
#define ADC2_T18PhaseTrigger()          ADC2_TriggerSel(15)

/////////////////////////////////////////////////

#define DAC1CR_DAC1EN_MSK               BIT0
#define DAC1_Enable()                   SET_REG_BIT(DAC1_CR, DAC1CR_DAC1EN_MSK)
#define DAC1_Disable()                  CLR_REG_BIT(DAC1_CR, DAC1CR_DAC1EN_MSK)

#define DAC1CR_TRIGSEL_MSK              (BIT5 | BIT4)
#define DAC1_TriggerSel(n)              MODIFY_REG(DAC1_CR, DAC1CR_TRIGSEL_MSK, ((n) << 4))
#define DAC1_SigngleTrigger()           DAC1_TriggerSel(0)
#define DAC1_T17Trigger()               DAC1_TriggerSel(1)
#define DAC1_T18Trigger()               DAC1_TriggerSel(2)
#define DAC1_AlwaysTrigger()            DAC1_TriggerSel(3)

#define DAC1CR_TRIGGER_MSK              BIT6
#define DAC1_Trigger()                  SET_REG_BIT(DAC1_CR, DAC1CR_TRIGGER_MSK)

#define DAC1CR_DMAEN_MSK                BIT7
#define DAC1_EnableDMA()                SET_REG_BIT(DAC1_CR, DAC1CR_DMAEN_MSK)
#define DAC1_DisableDMA()               CLR_REG_BIT(DAC1_CR, DAC1CR_DMAEN_MSK)

#define DAC1STA_BUSY_MSK                BIT7
#define DAC1_CheckBusy()                READ_REG_BIT(DAC1_STA, DAC1STA_BUSY_MSK)

#define DAC1_SetValue(n)                (DAC1_DATH = HIBYTE(n), DAC1_DATL = LOBYTE(n))
#define DAC1_SetClockDivider(n)         (DAC1_DIVH = HIBYTE(n), DAC1_DIVL = LOBYTE(n))

////////////////////////

#define DAC2CR_DAC2EN_MSK               BIT0
#define DAC2_Enable()                   SET_REG_BIT(DAC2_CR, DAC2CR_DAC2EN_MSK)
#define DAC2_Disable()                  CLR_REG_BIT(DAC2_CR, DAC2CR_DAC2EN_MSK)

#define DAC2CR_TRIGSEL_MSK              (BIT5 | BIT4)
#define DAC2_TriggerSel(n)              MODIFY_REG(DAC2_CR, DAC2CR_TRIGSEL_MSK, ((n) << 4))
#define DAC2_SigngleTrigger()           DAC2_TriggerSel(0)
#define DAC2_T17Trigger()               DAC2_TriggerSel(1)
#define DAC2_T18Trigger()               DAC2_TriggerSel(2)
#define DAC2_AlwaysTrigger()            DAC2_TriggerSel(3)

#define DAC2CR_TRIGGER_MSK              BIT6
#define DAC2_Trigger()                  SET_REG_BIT(DAC2_CR, DAC2CR_TRIGGER_MSK)

#define DAC2CR_DMAEN_MSK                BIT7
#define DAC2_EnableDMA()                SET_REG_BIT(DAC2_CR, DAC2CR_DMAEN_MSK)
#define DAC2_DisableDMA()               CLR_REG_BIT(DAC2_CR, DAC2CR_DMAEN_MSK)

#define DAC2STA_BUSY_MSK                BIT7
#define DAC2_CheckBusy()                READ_REG_BIT(DAC2_STA, DAC2STA_BUSY_MSK)

#define DAC2_SetValue(n)                (DAC2_DATH = HIBYTE(n), DAC2_DATL = LOBYTE(n))
#define DAC2_SetClockDivider(n)         (DAC2_DIVH = HIBYTE(n), DAC2_DIVL = LOBYTE(n))

/////////////////////////////////////////////////

#define PGA1CR2_PD_MSK                  BIT0
#define PGA1_Enable()                   CLR_REG_BIT(PGA1_CR2, PGA1CR2_PD_MSK)
#define PGA1_Disable()                  SET_REG_BIT(PGA1_CR2, PGA1CR2_PD_MSK)

#define PGA1CR1_MSEL_MSK                (BIT7 | BIT6)
#define PGA1_SetMode(n)                 MODIFY_REG(PGA1_CR1, PGA1CR1_MSEL_MSK, ((n) << 6))
#define PGA1_GeneralOPAMode()           PGA1_SetMode(0)
#define PGA1_BufferMode()               PGA1_SetMode(1)
#define PGA1_InvertPGAMode()            PGA1_SetMode(2)
#define PGA1_NonInvertPGAMode()         PGA1_SetMode(3)

#define PGA1CR2_OE_MSK                  BIT2
#define PGA1_EnableOutput()             SET_REG_BIT(PGA1_CR2, PGA1CR2_OE_MSK)
#define PGA1_DisableOutput()            CLR_REG_BIT(PGA1_CR2, PGA1CR2_OE_MSK)

#define PGA1CR2_IBS_MSK                 BIT1
#define PGA1_NormalBiasCurrent()        CLR_REG_BIT(PGA1_CR2, PGA1CR2_IBS_MSK)
#define PGA1_StrongBiasCurrent()        SET_REG_BIT(PGA1_CR2, PGA1CR2_IBS_MSK)

#define PGA1CR2_GSEL_MSK                (BIT6 | BIT5 | BIT4)
#define PGA1_SetGain(n)                 MODIFY_REG(PGA1_CR2, PGA1CR2_GSEL_MSK, ((n) << 4))

#define PGA1_DisableGain()              PGA1_SetGain(0)

#define PGA1_SetInvertGain1()           PGA1_SetGain(1)
#define PGA1_SetInvertGain2()           PGA1_SetGain(2)
#define PGA1_SetInvertGain4()           PGA1_SetGain(3)
#define PGA1_SetInvertGain8()           PGA1_SetGain(4)
#define PGA1_SetInvertGain16()          PGA1_SetGain(5)
#define PGA1_SetInvertGain32()          PGA1_SetGain(6)
#define PGA1_SetInvertGain48()          PGA1_SetGain(7)

#define PGA1_SetNonInvertGain2()        PGA1_SetGain(1)
#define PGA1_SetNonInvertGain3()        PGA1_SetGain(2)
#define PGA1_SetNonInvertGain5()        PGA1_SetGain(3)
#define PGA1_SetNonInvertGain9()        PGA1_SetGain(4)
#define PGA1_SetNonInvertGain17()       PGA1_SetGain(5)
#define PGA1_SetNonInvertGain33()       PGA1_SetGain(6)
#define PGA1_SetNonInvertGain49()       PGA1_SetGain(7)

////////////////////////

#define PGA2CR2_PD_MSK                  BIT0
#define PGA2_Enable()                   CLR_REG_BIT(PGA2_CR2, PGA2CR2_PD_MSK)
#define PGA2_Disable()                  SET_REG_BIT(PGA2_CR2, PGA2CR2_PD_MSK)

#define PGA2CR1_MSEL_MSK                (BIT7 | BIT6)
#define PGA2_SetMode(n)                 MODIFY_REG(PGA2_CR1, PGA2CR1_MSEL_MSK, ((n) << 6))
#define PGA2_GeneralOPAMode()           PGA2_SetMode(0)
#define PGA2_BufferMode()               PGA2_SetMode(1)
#define PGA2_InvertPGAMode()            PGA2_SetMode(2)
#define PGA2_NonInvertPGAMode()         PGA2_SetMode(3)

#define PGA2CR2_OE_MSK                  BIT2
#define PGA2_EnableOutput()             SET_REG_BIT(PGA2_CR2, PGA2CR2_OE_MSK)
#define PGA2_DisableOutput()            CLR_REG_BIT(PGA2_CR2, PGA2CR2_OE_MSK)

