fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PGA2CR2_IBS_MSK                 BIT1
#define PGA2_NormalBiasCurrent()        CLR_REG_BIT(PGA2_CR2, PGA2CR2_IBS_MSK)
#define PGA2_StrongBiasCurrent()        SET_REG_BIT(PGA2_CR2, PGA2CR2_IBS_MSK)

#define PGA2CR2_GSEL_MSK                (BIT6 | BIT5 | BIT4)
#define PGA2_SetGain(n)                 MODIFY_REG(PGA2_CR2, PGA2CR2_GSEL_MSK, ((n) << 4))

#define PGA2_DisableGain()              PGA2_SetGain(0)

#define PGA2_SetInvertGain1()           PGA2_SetGain(1)
#define PGA2_SetInvertGain2()           PGA2_SetGain(2)
#define PGA2_SetInvertGain4()           PGA2_SetGain(3)
#define PGA2_SetInvertGain8()           PGA2_SetGain(4)
#define PGA2_SetInvertGain16()          PGA2_SetGain(5)
#define PGA2_SetInvertGain32()          PGA2_SetGain(6)
#define PGA2_SetInvertGain48()          PGA2_SetGain(7)

#define PGA2_SetNonInvertGain2()        PGA2_SetGain(1)
#define PGA2_SetNonInvertGain3()        PGA2_SetGain(2)
#define PGA2_SetNonInvertGain5()        PGA2_SetGain(3)
#define PGA2_SetNonInvertGain9()        PGA2_SetGain(4)
#define PGA2_SetNonInvertGain17()       PGA2_SetGain(5)
#define PGA2_SetNonInvertGain33()       PGA2_SetGain(6)
#define PGA2_SetNonInvertGain49()       PGA2_SetGain(7)

////////////////////////

#define PGA3CR2_PD_MSK                  BIT0
#define PGA3_Enable()                   CLR_REG_BIT(PGA3_CR2, PGA3CR2_PD_MSK)
#define PGA3_Disable()                  SET_REG_BIT(PGA3_CR2, PGA3CR2_PD_MSK)

#define PGA3CR1_MSEL_MSK                (BIT7 | BIT6)
#define PGA3_SetMode(n)                 MODIFY_REG(PGA3_CR1, PGA3CR1_MSEL_MSK, ((n) << 6))
#define PGA3_GeneralOPAMode()           PGA3_SetMode(0)
#define PGA3_BufferMode()               PGA3_SetMode(1)
#define PGA3_InvertPGAMode()            PGA3_SetMode(2)
#define PGA3_NonInvertPGAMode()         PGA3_SetMode(3)

#define PGA3CR2_OE_MSK                  BIT2
#define PGA3_EnableOutput()             SET_REG_BIT(PGA3_CR2, PGA3CR2_OE_MSK)
#define PGA3_DisableOutput()            CLR_REG_BIT(PGA3_CR2, PGA3CR2_OE_MSK)

#define PGA3CR2_IBS_MSK                 BIT1
#define PGA3_NormalBiasCurrent()        CLR_REG_BIT(PGA3_CR2, PGA3CR2_IBS_MSK)
#define PGA3_StrongBiasCurrent()        SET_REG_BIT(PGA3_CR2, PGA3CR2_IBS_MSK)

#define PGA3CR2_GSEL_MSK                (BIT6 | BIT5 | BIT4)
#define PGA3_SetGain(n)                 MODIFY_REG(PGA3_CR2, PGA3CR2_GSEL_MSK, ((n) << 4))

#define PGA3_DisableGain()              PGA3_SetGain(0)

#define PGA3_SetInvertGain1()           PGA3_SetGain(1)
#define PGA3_SetInvertGain2()           PGA3_SetGain(2)
#define PGA3_SetInvertGain4()           PGA3_SetGain(3)
#define PGA3_SetInvertGain8()           PGA3_SetGain(4)
#define PGA3_SetInvertGain16()          PGA3_SetGain(5)
#define PGA3_SetInvertGain32()          PGA3_SetGain(6)
#define PGA3_SetInvertGain48()          PGA3_SetGain(7)

#define PGA3_SetNonInvertGain2()        PGA3_SetGain(1)
#define PGA3_SetNonInvertGain3()        PGA3_SetGain(2)
#define PGA3_SetNonInvertGain5()        PGA3_SetGain(3)
#define PGA3_SetNonInvertGain9()        PGA3_SetGain(4)
#define PGA3_SetNonInvertGain17()       PGA3_SetGain(5)
#define PGA3_SetNonInvertGain33()       PGA3_SetGain(6)
#define PGA3_SetNonInvertGain49()       PGA3_SetGain(7)

////////////////////////

#define PGA4CR2_PD_MSK                  BIT0
#define PGA4_Enable()                   CLR_REG_BIT(PGA4_CR2, PGA4CR2_PD_MSK)
#define PGA4_Disable()                  SET_REG_BIT(PGA4_CR2, PGA4CR2_PD_MSK)

#define PGA4CR1_MSEL_MSK                (BIT7 | BIT6)
#define PGA4_SetMode(n)                 MODIFY_REG(PGA4_CR1, PGA4CR1_MSEL_MSK, ((n) << 6))
#define PGA4_GeneralOPAMode()           PGA4_SetMode(0)
#define PGA4_BufferMode()               PGA4_SetMode(1)
#define PGA4_InvertPGAMode()            PGA4_SetMode(2)
#define PGA4_NonInvertPGAMode()         PGA4_SetMode(3)

#define PGA4CR2_OE_MSK                  BIT2
#define PGA4_EnableOutput()             SET_REG_BIT(PGA4_CR2, PGA4CR2_OE_MSK)
#define PGA4_DisableOutput()            CLR_REG_BIT(PGA4_CR2, PGA4CR2_OE_MSK)

#define PGA4CR2_IBS_MSK                 BIT1
#define PGA4_NormalBiasCurrent()        CLR_REG_BIT(PGA4_CR2, PGA4CR2_IBS_MSK)
#define PGA4_StrongBiasCurrent()        SET_REG_BIT(PGA4_CR2, PGA4CR2_IBS_MSK)

#define PGA4CR2_GSEL_MSK                (BIT6 | BIT5 | BIT4)
#define PGA4_SetGain(n)                 MODIFY_REG(PGA4_CR2, PGA4CR2_GSEL_MSK, ((n) << 4))

#define PGA4_DisableGain()              PGA4_SetGain(0)

#define PGA4_SetInvertGain1()           PGA4_SetGain(1)
#define PGA4_SetInvertGain2()           PGA4_SetGain(2)
#define PGA4_SetInvertGain4()           PGA4_SetGain(3)
#define PGA4_SetInvertGain8()           PGA4_SetGain(4)
#define PGA4_SetInvertGain16()          PGA4_SetGain(5)
#define PGA4_SetInvertGain32()          PGA4_SetGain(6)
#define PGA4_SetInvertGain48()          PGA4_SetGain(7)

#define PGA4_SetNonInvertGain2()        PGA4_SetGain(1)
#define PGA4_SetNonInvertGain3()        PGA4_SetGain(2)
#define PGA4_SetNonInvertGain5()        PGA4_SetGain(3)
#define PGA4_SetNonInvertGain9()        PGA4_SetGain(4)
#define PGA4_SetNonInvertGain17()       PGA4_SetGain(5)
#define PGA4_SetNonInvertGain33()       PGA4_SetGain(6)
#define PGA4_SetNonInvertGain49()       PGA4_SetGain(7)

/////////////////////////////////////////////////

#define SPCTL_SPEN_MSK                  BIT6
#define SPI1_Enable()                   SET_REG_BIT(SPCTL, SPCTL_SPEN_MSK)
#define SPI1_Disable()                  CLR_REG_BIT(SPCTL, SPCTL_SPEN_MSK)

#define SPCTL_DORD_MSK                  BIT5
#define SPI1_DataLSB()                  SET_REG_BIT(SPCTL, SPCTL_DORD_MSK)
#define SPI1_DataMSB()                  CLR_REG_BIT(SPCTL, SPCTL_DORD_MSK)

#define SPCTL_MSTR_MSK                  BIT4
#define SPI1_MasterMode()               SET_REG_BIT(SPCTL, SPCTL_MSTR_MSK)
#define SPI1_SlaveMode()                CLR_REG_BIT(SPCTL, SPCTL_MSTR_MSK)

#define SPCTL_SSIG_MSK                  BIT7
#define SPI1_IgnoreSS()                 SET_REG_BIT(SPCTL, SPCTL_SSIG_MSK)
#define SPI1_UnignoreSS()               CLR_REG_BIT(SPCTL, SPCTL_SSIG_MSK)

