fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define SPCTL_CPOL_MSK                  BIT3
#define SPCTL_CPHA_MSK                  BIT2
#define SPIMODE                         (SPCTL_CPOL_MSK | SPCTL_CPHA_MSK)
#define SPI1_SetMode0()                 MODIFY_REG(SPCTL, SPIMODE, ((0) << 2))
#define SPI1_SetMode1()                 MODIFY_REG(SPCTL, SPIMODE, ((1) << 2))
#define SPI1_SetMode2()                 MODIFY_REG(SPCTL, SPIMODE, ((2) << 2))
#define SPI1_SetMode3()                 MODIFY_REG(SPCTL, SPIMODE, ((3) << 2))

#define SPCTL_SPR_MSK                   (BIT1 | BIT0)
#define SPI1_SetClockDivider(n)         MODIFY_REG(SPCTL, SPCTL_SPR_MSK, ((n) << 0))
#define SPI1_SetClockDivider2()         SPI1_SetClockDivider(3)
#define SPI1_SetClockDivider4()         SPI1_SetClockDivider(0)
#define SPI1_SetClockDivider8()         SPI1_SetClockDivider(1)
#define SPI1_SetClockDivider16()        SPI1_SetClockDivider(2)

#define SPI1_SendData(d)                (SPDAT = (d))
#define SPI1_ReadData()                 (SPDAT)

#define HSSPICFG2_IOSW_MSK              BIT6
#define SPI1_SwapMosiMiso()             SET_REG_BIT(HSSPI_CFG2, HSSPICFG2_IOSW_MSK)

#define HSSPICFG2_HSSPIEN_MSK           BIT5
#define HSSPI1_Enable()                 SET_REG_BIT(HSSPI_CFG2, HSSPICFG2_HSSPIEN_MSK)
#define HSSPI1_Disable()                CLR_REG_BIT(HSSPI_CFG2, HSSPICFG2_HSSPIEN_MSK)

#define HSSPICFG_SSHLD_MSK              BIT_HN
#define HSSPI1_SetSSHoldTime(n)         MODIFY_REG(HSSPI_CFG, HSSPICFG_SSHLD_MSK, ((n) << 4))

#define HSSPICFG_SSSETUP_MSK            BIT_LN
#define HSSPI1_SetSSSetupTime(n)        MODIFY_REG(HSSPI_CFG, HSSPICFG_SSSETUP_MSK, ((n) << 0))

#define HSSPICFG2_SSDACT_MSK            BIT_LN
#define HSSPI1_SetSSDeactTime(n)        MODIFY_REG(HSSPI_CFG2, HSSPICFG2_SSDACT_MSK, ((n) << 0))

#define HSSPICFG2_FIFOEN_MSK            BIT4
#define HSSPI1_EnableFIFO()             SET_REG_BIT(HSSPI_CFG2, HSSPICFG2_FIFOEN_MSK)
#define HSSPI1_DisableFIFO()            CLR_REG_BIT(HSSPI_CFG2, HSSPICFG2_FIFOEN_MSK)

#define HSSPI1_SetClockDivider(n)       WRITE_REG(HSSPI_PSCR, (n))

#define SPITOCR_ENTO_MSK                BIT7
#define SPI1_EnableTimeout()            SET_REG_BIT(SPITOCR, SPITOCR_ENTO_MSK)
#define SPI1_DisableTimeout()           CLR_REG_BIT(SPITOCR, SPITOCR_ENTO_MSK)

#define SPITOCR_SCALE_MSK               BIT5
#define SPI1_TimeoutScale_SYSCLK()      SET_REG_BIT(SPITOCR, SPITOCR_SCALE_MSK)
#define SPI1_TimeoutScale_1us()         CLR_REG_BIT(SPITOCR, SPITOCR_SCALE_MSK)

#define SPI1_SetTimeoutInterval(n)      SPITOTL = BYTE0(n); \
                                        SPITOTH = BYTE1(n); \
                                        SPITOTE = BYTE2(n)

////////////////////////

#define SPI2CTL_SPEN_MSK                BIT6
#define SPI2_Enable()                   SET_REG_BIT(SPI2CTL, SPI2CTL_SPEN_MSK)
#define SPI2_Disable()                  CLR_REG_BIT(SPI2CTL, SPI2CTL_SPEN_MSK)

#define SPI2CTL_DORD_MSK                BIT5
#define SPI2_DataLSB()                  SET_REG_BIT(SPI2CTL, SPI2CTL_DORD_MSK)
#define SPI2_DataMSB()                  CLR_REG_BIT(SPI2CTL, SPI2CTL_DORD_MSK)

#define SPI2CTL_MSTR_MSK                BIT4
#define SPI2_MasterMode()               SET_REG_BIT(SPI2CTL, SPI2CTL_MSTR_MSK)
#define SPI2_SlaveMode()                CLR_REG_BIT(SPI2CTL, SPI2CTL_MSTR_MSK)

#define SPI2CTL_SSIG_MSK                BIT7
#define SPI2_IgnoreSS()                 SET_REG_BIT(SPI2CTL, SPI2CTL_SSIG_MSK)
#define SPI2_UnignoreSS()               CLR_REG_BIT(SPI2CTL, SPI2CTL_SSIG_MSK)

#define SPI2CTL_CPOL_MSK                BIT3
#define SPI2CTL_CPHA_MSK                BIT2
#define SPI2MODE                        (SPI2CTL_CPOL_MSK | SPI2CTL_CPHA_MSK)
#define SPI2_SetMode0()                 MODIFY_REG(SPI2CTL, SPI2MODE, ((0) << 2))
#define SPI2_SetMode1()                 MODIFY_REG(SPI2CTL, SPI2MODE, ((1) << 2))
#define SPI2_SetMode2()                 MODIFY_REG(SPI2CTL, SPI2MODE, ((2) << 2))
#define SPI2_SetMode3()                 MODIFY_REG(SPI2CTL, SPI2MODE, ((3) << 2))

#define SPI2CTL_SPR_MSK                 (BIT1 | BIT0)
#define SPI2_SetClockDivider(n)         MODIFY_REG(SPI2CTL, SPI2CTL_SPR_MSK, ((n) << 0))
#define SPI2_SetClockDivider2()         SPI2_SetClockDivider(3)
#define SPI2_SetClockDivider4()         SPI2_SetClockDivider(0)
#define SPI2_SetClockDivider8()         SPI2_SetClockDivider(1)
#define SPI2_SetClockDivider16()        SPI2_SetClockDivider(2)

#define SPI2_SendData(d)                (SPI2DAT = (d))
#define SPI2_ReadData()                 (SPI2DAT)

#define HSSPI2CFG2_IOSW_MSK             BIT6
#define SPI2_SwapMosiMiso()             SET_REG_BIT(HSSPI2_CFG2, HSSPI2CFG2_IOSW_MSK)

#define HSSPI2CFG2_HSSPIEN_MSK          BIT5
#define HSSPI2_Enable()                 SET_REG_BIT(HSSPI2_CFG2, HSSPI2CFG2_HSSPIEN_MSK)
#define HSSPI2_Disable()                CLR_REG_BIT(HSSPI2_CFG2, HSSPI2CFG2_HSSPIEN_MSK)

#define HSSPI2CFG_SSHLD_MSK             BIT_HN
#define HSSPI2_SetSSHoldTime(n)         MODIFY_REG(HSSPI2_CFG, HSSPI2CFG_SSHLD_MSK, ((n) << 4))

#define HSSPI2CFG_SSSETUP_MSK           BIT_LN
#define HSSPI2_SetSSSetupTime(n)        MODIFY_REG(HSSPI2_CFG, HSSPI2CFG_SSSETUP_MSK, ((n) << 0))

#define HSSPI2CFG2_SSDACT_MSK           BIT_LN
#define HSSPI2_SetSSDeactTime(n)        MODIFY_REG(HSSPI2_CFG2, HSSPI2CFG2_SSDACT_MSK, ((n) << 0))

#define HSSPI2CFG2_FIFOEN_MSK            BIT4
#define HSSPI2_EnableFIFO()             SET_REG_BIT(HSSPI2_CFG2, HSSPI2CFG2_FIFOEN_MSK)
#define HSSPI2_DisableFIFO()            CLR_REG_BIT(HSSPI2_CFG2, HSSPI2CFG2_FIFOEN_MSK)

#define HSSPI2_SetClockDivider(n)       WRITE_REG(HSSPI2_PSCR, (n))

#define SPI2TOCR_ENTO_MSK               BIT7
#define SPI2_EnableTimeout()            SET_REG_BIT(SPI2TOCR, SPI2TOCR_ENTO_MSK)
#define SPI2_DisableTimeout()           CLR_REG_BIT(SPI2TOCR, SPI2TOCR_ENTO_MSK)

#define SPI2TOCR_SCALE_MSK              BIT5
#define SPI2_TimeoutScale_SYSCLK()      SET_REG_BIT(SPI2TOCR, SPI2TOCR_SCALE_MSK)
#define SPI2_TimeoutScale_1us()         CLR_REG_BIT(SPI2TOCR, SPI2TOCR_SCALE_MSK)

#define SPI2_SetTimeoutInterval(n)      SPI2TOTL = BYTE0(n); \
                                        SPI2TOTH = BYTE1(n); \
                                        SPI2TOTE = BYTE2(n)

