fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
////////////////////////

#define SPI3CTL_SPEN_MSK                BIT6
#define SPI3_Enable()                   SET_REG_BIT(SPI3CTL, SPI3CTL_SPEN_MSK)
#define SPI3_Disable()                  CLR_REG_BIT(SPI3CTL, SPI3CTL_SPEN_MSK)

#define SPI3CTL_DORD_MSK                BIT5
#define SPI3_DataLSB()                  SET_REG_BIT(SPI3CTL, SPI3CTL_DORD_MSK)
#define SPI3_DataMSB()                  CLR_REG_BIT(SPI3CTL, SPI3CTL_DORD_MSK)

#define SPI3CTL_MSTR_MSK                BIT4
#define SPI3_MasterMode()               SET_REG_BIT(SPI3CTL, SPI3CTL_MSTR_MSK)
#define SPI3_SlaveMode()                CLR_REG_BIT(SPI3CTL, SPI3CTL_MSTR_MSK)

#define SPI3CTL_SSIG_MSK                BIT7
#define SPI3_IgnoreSS()                 SET_REG_BIT(SPI3CTL, SPI3CTL_SSIG_MSK)
#define SPI3_UnignoreSS()               CLR_REG_BIT(SPI3CTL, SPI3CTL_SSIG_MSK)

#define SPI3CTL_CPOL_MSK                BIT3
#define SPI3CTL_CPHA_MSK                BIT2
#define SPI3MODE                        (SPI3CTL_CPOL_MSK | SPI3CTL_CPHA_MSK)
#define SPI3_SetMode0()                 MODIFY_REG(SPI3CTL, SPI3MODE, ((0) << 2))
#define SPI3_SetMode1()                 MODIFY_REG(SPI3CTL, SPI3MODE, ((1) << 2))
#define SPI3_SetMode2()                 MODIFY_REG(SPI3CTL, SPI3MODE, ((2) << 2))
#define SPI3_SetMode3()                 MODIFY_REG(SPI3CTL, SPI3MODE, ((3) << 2))

#define SPI3CTL_SPR_MSK                 (BIT1 | BIT0)
#define SPI3_SetClockDivider(n)         MODIFY_REG(SPI3CTL, SPI3CTL_SPR_MSK, ((n) << 0))
#define SPI3_SetClockDivider2()         SPI3_SetClockDivider(3)
#define SPI3_SetClockDivider4()         SPI3_SetClockDivider(0)
#define SPI3_SetClockDivider8()         SPI3_SetClockDivider(1)
#define SPI3_SetClockDivider16()        SPI3_SetClockDivider(2)

#define SPI3_SendData(d)                (SPI3DAT = (d))
#define SPI3_ReadData()                 (SPI3DAT)

#define HSSPI3CFG2_IOSW_MSK             BIT6
#define SPI3_SwapMosiMiso()             SET_REG_BIT(HSSPI3_CFG2, HSSPI3CFG2_IOSW_MSK)

#define HSSPI3CFG2_HSSPIEN_MSK          BIT5
#define HSSPI3_Enable()                 SET_REG_BIT(HSSPI3_CFG2, HSSPI3CFG2_HSSPIEN_MSK)
#define HSSPI3_Disable()                CLR_REG_BIT(HSSPI3_CFG2, HSSPI3CFG2_HSSPIEN_MSK)

#define HSSPI3CFG_SSHLD_MSK             BIT_HN
#define HSSPI3_SetSSHoldTime(n)         MODIFY_REG(HSSPI3_CFG, HSSPI3CFG_SSHLD_MSK, ((n) << 4))

#define HSSPI3CFG_SSSETUP_MSK           BIT_LN
#define HSSPI3_SetSSSetupTime(n)        MODIFY_REG(HSSPI3_CFG, HSSPI3CFG_SSSETUP_MSK, ((n) << 0))

#define HSSPI3CFG2_SSDACT_MSK           BIT_LN
#define HSSPI3_SetSSDeactTime(n)        MODIFY_REG(HSSPI3_CFG2, HSSPI3CFG2_SSDACT_MSK, ((n) << 0))

#define HSSPI3CFG2_FIFOEN_MSK            BIT4
#define HSSPI3_EnableFIFO()             SET_REG_BIT(HSSPI3_CFG2, HSSPI3CFG2_FIFOEN_MSK)
#define HSSPI3_DisableFIFO()            CLR_REG_BIT(HSSPI3_CFG2, HSSPI3CFG2_FIFOEN_MSK)

#define HSSPI3_SetClockDivider(n)       WRITE_REG(HSSPI3_PSCR, (n))

#define SPI3TOCR_ENTO_MSK               BIT7
#define SPI3_EnableTimeout()            SET_REG_BIT(SPI3TOCR, SPI3TOCR_ENTO_MSK)
#define SPI3_DisableTimeout()           CLR_REG_BIT(SPI3TOCR, SPI3TOCR_ENTO_MSK)

#define SPI3TOCR_SCALE_MSK              BIT5
#define SPI3_TimeoutScale_SYSCLK()      SET_REG_BIT(SPI3TOCR, SPI3TOCR_SCALE_MSK)
#define SPI3_TimeoutScale_1us()         CLR_REG_BIT(SPI3TOCR, SPI3TOCR_SCALE_MSK)

#define SPI3_SetTimeoutInterval(n)      SPI3TOTL = BYTE0(n); \
                                        SPI3TOTH = BYTE1(n); \
                                        SPI3TOTE = BYTE2(n)

/////////////////////////////////////////////////

#define QSPICR1_EN_MSK                  BIT0
#define QSPI_Enable()                   SET_REG_BIT(QSPI_CR1, QSPICR1_EN_MSK)
#define QSPI_Disable()                  CLR_REG_BIT(QSPI_CR1, QSPICR1_EN_MSK)

#define QSPICR1_ABORT_MSK               BIT1
#define QSPI_Abort()                    SET_REG_BIT(QSPI_CR1, QSPICR1_ABORT_MSK)

#define QSPICR1_SSHIFT_MSK              BIT4
#define QSPI_ReadNoDelay()              CLR_REG_BIT(QSPI_CR1, QSPICR1_SSHIFT_MSK)
#define QSPI_ReadDelayHalfCycle()       SET_REG_BIT(QSPI_CR1, QSPICR1_SSHIFT_MSK)

#define QSPICR2_FTHRES_MSK              (BIT4 | BIT_LN)
#define QSPI_SetFIFOLevel(n)            MODIFY_REG(QSPI_CR2, QSPICR2_FTHRES_MSK, ((n) << 0))

#define QSPICR3_PMM_MSK                 BIT7
#define QSPI_PollingMatchAND()          CLR_REG_BIT(QSPI_CR3, QSPICR3_PMM_MSK)
#define QSPI_PollingMatchOR()           SET_REG_BIT(QSPI_CR3, QSPICR3_PMM_MSK)

#define QSPICR3_APMS_MSK                BIT6
#define QSPI_PollingManualStop()        CLR_REG_BIT(QSPI_CR3, QSPICR3_APMS_MSK)
#define QSPI_PollingAutoStop()          SET_REG_BIT(QSPI_CR3, QSPICR3_APMS_MSK)

#define QSPICR3_TOIE_MSK                BIT4
#define QSPICR3_SMIE_MSK                BIT3
#define QSPICR3_FTIE_MSK                BIT2
#define QSPICR3_TCIE_MSK                BIT1
#define QSPICR3_TEIE_MSK                BIT0
#define QSPI_EnableTimeoutInt()         SET_REG_BIT(QSPI_CR3, QSPICR3_TOIE_MSK)
#define QSPI_EnableMatchInt()           SET_REG_BIT(QSPI_CR3, QSPICR3_SMIE_MSK)
#define QSPI_EnableFIFOInt()            SET_REG_BIT(QSPI_CR3, QSPICR3_FTIE_MSK)
#define QSPI_EnableTransferInt()        SET_REG_BIT(QSPI_CR3, QSPICR3_TCIE_MSK)
#define QSPI_EnableErrorInt()           SET_REG_BIT(QSPI_CR3, QSPICR3_TEIE_MSK)

#define QSPI_SetClockDivider(n)         (QSPI_CR4 = (n))

#define QSPIDCR1_CSHT_MSK               (BIT6 | BIT5 | BIT4)
#define QSPI_SetCSHold(n)               MODIFY_REG(QSPI_DCR1, QSPIDCR1_CSHT_MSK, ((n) << 4))

#define QSPIDCR1_CKMODE_MSK             (BIT0)
#define QSPI_SetSCKNormalHigh()         SET_REG_BIT(QSPI_DCR1, QSPIDCR1_CKMODE_MSK)
#define QSPI_SetSCKNormalLow()          CLR_REG_BIT(QSPI_DCR1, QSPIDCR1_CKMODE_MSK)

#define QSPIDCR2_FSIZE_MSK              (BIT4 | BIT_LN)
#define QSPI_SetFlashSize(n)            MODIFY_REG(QSPI_DCR2, QSPIDCR2_FSIZE_MSK, ((n) << 0))

#define QSPISR1_BUSY_MSK                BIT5
#define QSPI_CheckBusy()                READ_REG_BIT(QSPI_SR1, QSPISR1_BUSY_MSK)

#define QSPISR2_FLEVEL_MSK              (BIT5 | BIT4 | BIT_LN)
#define QSPI_CheckFIFOLevel()           READ_REG_BIT(QSPI_SR2, QSPISR2_FLEVEL_MSK)

