fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
/*
#define QSPI_SetDataLength(n)           QSPI_DLR4 = BYTE3(n);       \
                                        QSPI_DLR3 = BYTE2(n);       \
                                        QSPI_DLR2 = BYTE1(n);       \
                                        QSPI_DLR1 = BYTE0(n)
*/

#define QSPI_SetDataLength(n)           QSPI_DLR2 = BYTE1(n);       \
                                        QSPI_DLR1 = BYTE0(n)

#define QSPI_SetAddress(n)              QSPI_AR4 = BYTE3(n);        \
                                        QSPI_AR3 = BYTE2(n);        \
                                        QSPI_AR2 = BYTE1(n);        \
                                        QSPI_AR1 = BYTE0(n)

#define QSPI_SetAlternate(n)            QSPI_ABR4 = BYTE3(n);       \
                                        QSPI_ABR3 = BYTE2(n);       \
                                        QSPI_ABR2 = BYTE1(n);       \
                                        QSPI_ABR1 = BYTE0(n)

#define QSPI_SetInstruction(n)          (QSPI_CCR1 = (n))

#define QSPICCR2_ADSIZE_MSK             (BIT5 | BIT4)
#define QSPI_SetAddressSize(n)          MODIFY_REG(QSPI_CCR2, QSPICCR2_ADSIZE_MSK, ((n) << 4))
#define QSPI_SetAddressSize_8B()        QSPI_SetAddressSize(0)
#define QSPI_SetAddressSize_16B()       QSPI_SetAddressSize(1)
#define QSPI_SetAddressSize_24B()       QSPI_SetAddressSize(2)
#define QSPI_SetAddressSize_32B()       QSPI_SetAddressSize(3)

#define QSPICCR3_ABSIZE_MSK             (BIT1 | BIT0)
#define QSPI_SetAlternateSize(n)        MODIFY_REG(QSPI_CCR3, QSPICCR3_ABSIZE_MSK, ((n) << 0))
#define QSPI_SetAlternateSize_8B()      QSPI_SetAlternateSize(0)
#define QSPI_SetAlternateSize_16B()     QSPI_SetAlternateSize(1)
#define QSPI_SetAlternateSize_24B()     QSPI_SetAlternateSize(2)
#define QSPI_SetAlternateSize_32B()     QSPI_SetAlternateSize(3)

#define QSPICCR3_DCYC_MSK               (BIT6 | BIT5 | BIT4 | BIT3 | BIT2)
#define QSPI_SetDummyCycles(n)          MODIFY_REG(QSPI_CCR3, QSPICCR3_DCYC_MSK, ((n) << 2))

#define QSPICCR2_IMODE_MSK              (BIT1 | BIT0)
#define QSPI_SetInstructionMode(n)      MODIFY_REG(QSPI_CCR2, QSPICCR2_IMODE_MSK, ((n) << 0))
#define QSPI_NoInstruction()            QSPI_SetInstructionMode(0)
#define QSPI_InstructionSingMode()      QSPI_SetInstructionMode(1)
#define QSPI_InstructionDualMode()      QSPI_SetInstructionMode(2)
#define QSPI_InstructionQuadMode()      QSPI_SetInstructionMode(3)

#define QSPICCR2_ADMODE_MSK             (BIT3 | BIT2)
#define QSPI_SetAddressMode(n)          MODIFY_REG(QSPI_CCR2, QSPICCR2_ADMODE_MSK, ((n) << 2))
#define QSPI_NoAddress()                QSPI_SetAddressMode(0)
#define QSPI_AddressSingMode()          QSPI_SetAddressMode(1)
#define QSPI_AddressDualMode()          QSPI_SetAddressMode(2)
#define QSPI_AddressQuadMode()          QSPI_SetAddressMode(3)

#define QSPICCR2_ABMODE_MSK             (BIT7 | BIT6)
#define QSPI_SetAlternateMode(n)        MODIFY_REG(QSPI_CCR2, QSPICCR2_ABMODE_MSK, ((n) << 6))
#define QSPI_NoAlternate()              QSPI_SetAlternateMode(0)
#define QSPI_AlternateSingMode()        QSPI_SetAlternateMode(1)
#define QSPI_AlternateDualMode()        QSPI_SetAlternateMode(2)
#define QSPI_AlternateQuadMode()        QSPI_SetAlternateMode(3)

#define QSPICCR4_DMODE_MSK              (BIT1 | BIT0)
#define QSPI_SetDataMode(n)             MODIFY_REG(QSPI_CCR4, QSPICCR4_DMODE_MSK, ((n) << 0))
#define QSPI_NoData()                   QSPI_SetDataMode(0)
#define QSPI_DataSingMode()             QSPI_SetDataMode(1)
#define QSPI_DataDualMode()             QSPI_SetDataMode(2)
#define QSPI_DataQuadMode()             QSPI_SetDataMode(3)

#define QSPICCR4_FMODE_MSK              (BIT3 | BIT2)
#define QSPI_SetFunctionMode(n)         MODIFY_REG(QSPI_CCR4, QSPICCR4_FMODE_MSK, ((n) << 2))
#define QSPI_SetWriteMode()             QSPI_SetFunctionMode(0)
#define QSPI_SetReadMode()              QSPI_SetFunctionMode(1)
#define QSPI_SetPollingMode()           QSPI_SetFunctionMode(2)

#define QSPICCR4_SIOO_MSK               BIT4
#define QSPI_InstructionOnce()          SET_REG_BIT(QSPI_CCR4, QSPICCR4_SIOO_MSK)
#define QSPI_InstructionAlways()        CLR_REG_BIT(QSPI_CCR4, QSPICCR4_SIOO_MSK)

#define QSPI_ReadData()                 (ACC = QSPI_DR)
#define QSPI_WriteData(d)               (QSPI_DR = (d))

#define QSPI_SetPollingMask(n)          /* QSPI_PSMKR4 = BYTE3(n); */   \
                                        /* QSPI_PSMKR3 = BYTE2(n); */   \
                                        /* QSPI_PSMKR2 = BYTE1(n);  */  \
                                        QSPI_PSMKR1 = BYTE0(n)

#define QSPI_SetPollingMatch(n)         /* QSPI_PSMAR4 = BYTE3(n); */   \
                                        /* QSPI_PSMAR3 = BYTE2(n); */   \
                                        /* QSPI_PSMAR2 = BYTE1(n);  */  \
                                        QSPI_PSMAR1 = BYTE0(n)

#define QSPI_SetPollingInterval(n)      QSPI_PIR2 = BYTE1(n);           \
                                        QSPI_PIR1 = BYTE0(n)

/////////////////////////////////////////////////

#define I2CCFG_ENI2C_MSK                BIT7
#define I2C1_Enable()                   SET_REG_BIT(I2CCFG, I2CCFG_ENI2C_MSK)
#define I2C1_Disable()                  CLR_REG_BIT(I2CCFG, I2CCFG_ENI2C_MSK)

#define I2CCFG_MSSL_MSK                 BIT6
#define I2C1_MasterMode()               SET_REG_BIT(I2CCFG, I2CCFG_MSSL_MSK)
#define I2C1_SlaveMode()                CLR_REG_BIT(I2CCFG, I2CCFG_MSSL_MSK)

#define I2CCFG_SPEED_MSK                (BIT5 | BIT4 |BIT_LN)
#define I2C1_SetClockDivider(n)         MODIFY_REG(I2CCFG, I2CCFG_SPEED_MSK, ((n) << 0)); \
                                        I2CPSCR = ((n) >> 6)

#define I2CMSCR_MSCMD_MSK               (BIT_LN)
#define I2C1_SetMasterCommand(n)        MODIFY_REG(I2CMSCR, I2CMSCR_MSCMD_MSK, ((n) << 0))

#define I2CCMD_IDLE                     0
#define I2CCMD_START                    1
#define I2CCMD_SENDDATA                 2
#define I2CCMD_RECVACK                  3
#define I2CCMD_RECVDATA                 4
#define I2CCMD_SENDACK                  5
#define I2CCMD_STOP                     6
#define I2CCMD_START_SENDDATA_RECVACK   9
#define I2CCMD_SENDDATA_RECVACK         10
#define I2CCMD_RECVDATA_SENDACK         11
#define I2CCMD_RECVDATA_SENDNAK         12
#define I2C1_Idle()                     I2C1_SetMasterCommand(I2CCMD_IDLE)
#define I2C1_Start()                    I2C1_SetMasterCommand(I2CCMD_START)
#define I2C1_SendData()                 I2C1_SetMasterCommand(I2CCMD_SENDDATA)
#define I2C1_RecvACK()                  I2C1_SetMasterCommand(I2CCMD_RECVACK)
#define I2C1_RecvData()                 I2C1_SetMasterCommand(I2CCMD_RECVDATA)
#define I2C1_SendACK()                  I2C1_SetMasterCommand(I2CCMD_SENDACK)
#define I2C1_Stop()                     I2C1_SetMasterCommand(I2CCMD_STOP)
#define I2C1_StartSendDataRecvACK()     I2C1_SetMasterCommand(I2CCMD_START_SENDDATA_RECVACK)
#define I2C1_SendDataRecvACK()          I2C1_SetMasterCommand(I2CCMD_SENDDATA_RECVACK)
#define I2C1_RecvDataSendACK()          I2C1_SetMasterCommand(I2CCMD_RECVDATA_SENDACK)
#define I2C1_RecvDataSendNAK()          I2C1_SetMasterCommand(I2CCMD_RECVDATA_SENDNAK)

#define I2CMSST_BUSY_MSK                BIT7
#define I2C1_CheckMasterBusy()          READ_REG_BIT(I2CMSST, I2CMSST_BUSY_MSK)

#define I2CMSST_MSIF_MSK                BIT6
#define I2C1_CheckMasterFlag()          READ_REG_BIT(I2CMSST, I2CMSST_MSIF_MSK)
#define I2C1_ClearMasterFlag()          CLR_REG_BIT(I2CMSST, I2CMSST_MSIF_MSK)

#define I2C1_WriteData(d)               (I2CTXD = (d))
#define I2C1_ReadData()                 (I2CRXD)

#define I2CMSST_ACKI_MSK                BIT1
#define I2CMSST_ACKO_MSK                BIT0
#define I2C1_MasterSetACK()             CLR_REG_BIT(I2CMSST, I2CMSST_ACKO_MSK)
#define I2C1_MasterSetNAK()             SET_REG_BIT(I2CMSST, I2CMSST_ACKO_MSK)
#define I2C1_MasterReadACK()            READ_REG_BIT(I2CMSST, I2CMSST_ACKI_MSK)

