fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define I2CSLCR_SLRST_MSK               BIT0
#define I2C1_SlaveReset()               SET_REG_BIT(I2CSLCR, I2CSLCR_SLRST_MSK)

#define I2CSLST_BUSY_MSK                BIT7
#define I2C1_CheckSlaveBusy()           READ_REG_BIT(I2CSLST, I2CSLST_BUSY_MSK)

#define I2CSLST_ACKI_MSK                BIT1
#define I2CSLST_ACKO_MSK                BIT0
#define I2C1_SlaveSetACK()              CLR_REG_BIT(I2CSLST, I2CSLST_ACKO_MSK)
#define I2C1_SlaveSetNAK()              SET_REG_BIT(I2CSLST, I2CSLST_ACKO_MSK)
#define I2C1_SlaveReadACK()             READ_REG_BIT(I2CSLST, I2CSLST_ACKI_MSK)

#define I2CSLADR_SLADR_MSK              (BIT_HN | BIT3 | BIT2 | BIT1)
#define I2C1_SetSlaveAddress(n)         I2CSLADR = ((n) << 1)

#define I2CSLADR_MA_MSK                 (BIT0)
#define I2C1_SetSlaveBroadcast()        SET_REG_BIT(I2CSLADR, I2CSLADR_MA_MSK)

#define I2CTOCR_ENTO_MSK                BIT7
#define I2C1_EnableTimeout()            SET_REG_BIT(I2CTOCR, I2CTOCR_ENTO_MSK)
#define I2C1_DisableTimeout()           CLR_REG_BIT(I2CTOCR, I2CTOCR_ENTO_MSK)

#define I2CTOCR_SCALE_MSK               BIT5
#define I2C1_TimeoutScale_SYSCLK()      SET_REG_BIT(I2CTOCR, I2CTOCR_SCALE_MSK)
#define I2C1_TimeoutScale_1us()         CLR_REG_BIT(I2CTOCR, I2CTOCR_SCALE_MSK)

#define I2C1_SetTimeoutInterval(n)      I2CTOTL = BYTE0(n); \
                                        I2CTOTH = BYTE1(n); \
                                        I2CTOTE = BYTE2(n)

////////////////////////

#define I2C2CFG_ENI2C_MSK               BIT7
#define I2C2_Enable()                   SET_REG_BIT(I2C2CFG, I2C2CFG_ENI2C_MSK)
#define I2C2_Disable()                  CLR_REG_BIT(I2C2CFG, I2C2CFG_ENI2C_MSK)

#define I2C2CFG_MSSL_MSK                BIT6
#define I2C2_MasterMode()               SET_REG_BIT(I2C2CFG, I2C2CFG_MSSL_MSK)
#define I2C2_SlaveMode()                CLR_REG_BIT(I2C2CFG, I2C2CFG_MSSL_MSK)

#define I2C2CFG_SPEED_MSK               (BIT5 | BIT4 |BIT_LN)
#define I2C2_SetClockDivider(n)         MODIFY_REG(I2C2CFG, I2C2CFG_SPEED_MSK, ((n) << 0)); \
                                        I2C2PSCR = ((n) >> 6)

#define I2C2MSCR_MSCMD_MSK              (BIT_LN)
#define I2C2_SetMasterCommand(n)        MODIFY_REG(I2C2MSCR, I2C2MSCR_MSCMD_MSK, ((n) << 0))

#define I2C2CMD_IDLE                    0
#define I2C2CMD_START                   1
#define I2C2CMD_SENDDATA                2
#define I2C2CMD_RECVACK                 3
#define I2C2CMD_RECVDATA                4
#define I2C2CMD_SENDACK                 5
#define I2C2CMD_STOP                    6
#define I2C2CMD_START_SENDDATA_RECVACK  9
#define I2C2CMD_SENDDATA_RECVACK        10
#define I2C2CMD_RECVDATA_SENDACK        11
#define I2C2CMD_RECVDATA_SENDNAK        12
#define I2C2_Idle()                     I2C2_SetMasterCommand(I2C2CMD_IDLE)
#define I2C2_Start()                    I2C2_SetMasterCommand(I2C2CMD_START)
#define I2C2_SendData()                 I2C2_SetMasterCommand(I2C2CMD_SENDDATA)
#define I2C2_RecvACK()                  I2C2_SetMasterCommand(I2C2CMD_RECVACK)
#define I2C2_RecvData()                 I2C2_SetMasterCommand(I2C2CMD_RECVDATA)
#define I2C2_SendACK()                  I2C2_SetMasterCommand(I2C2CMD_SENDACK)
#define I2C2_Stop()                     I2C2_SetMasterCommand(I2C2CMD_STOP)
#define I2C2_StartSendDataRecvACK()     I2C2_SetMasterCommand(I2C2CMD_START_SENDDATA_RECVACK)
#define I2C2_SendDataRecvACK()          I2C2_SetMasterCommand(I2C2CMD_SENDDATA_RECVACK)
#define I2C2_RecvDataSendACK()          I2C2_SetMasterCommand(I2C2CMD_RECVDATA_SENDACK)
#define I2C2_RecvDataSendNAK()          I2C2_SetMasterCommand(I2C2CMD_RECVDATA_SENDNAK)

#define I2C2MSST_BUSY_MSK               BIT7
#define I2C2_CheckMasterBusy()          READ_REG_BIT(I2C2MSST, I2C2MSST_BUSY_MSK)

#define I2C2MSST_MSIF_MSK               BIT6
#define I2C2_CheckMasterFlag()          READ_REG_BIT(I2C2MSST, I2C2MSST_MSIF_MSK)
#define I2C2_ClearMasterFlag()          CLR_REG_BIT(I2C2MSST, I2C2MSST_MSIF_MSK)

#define I2C2_WriteData(d)               (I2C2TXD = (d))
#define I2C2_ReadData()                 (I2C2RXD)

#define I2C2MSST_ACKI_MSK               BIT1
#define I2C2MSST_ACKO_MSK               BIT0
#define I2C2_MasterSetACK()             CLR_REG_BIT(I2C2MSST, I2C2MSST_ACKO_MSK)
#define I2C2_MasterSetNAK()             SET_REG_BIT(I2C2MSST, I2C2MSST_ACKO_MSK)
#define I2C2_MasterReadACK()            READ_REG_BIT(I2C2MSST, I2C2MSST_ACKI_MSK)

#define I2C2SLCR_SLRST_MSK              BIT0
#define I2C2_SlaveReset()               SET_REG_BIT(I2C2SLCR, I2C2SLCR_SLRST_MSK)

#define I2C2SLST_BUSY_MSK               BIT7
#define I2C2_CheckSlaveBusy()           READ_REG_BIT(I2C2SLST, I2C2SLST_BUSY_MSK)

#define I2C2SLST_ACKI_MSK               BIT1
#define I2C2SLST_ACKO_MSK               BIT0
#define I2C2_SlaveSetACK()              CLR_REG_BIT(I2C2SLST, I2C2SLST_ACKO_MSK)
#define I2C2_SlaveSetNAK()              SET_REG_BIT(I2C2SLST, I2C2SLST_ACKO_MSK)
#define I2C2_SlaveReadACK()             READ_REG_BIT(I2C2SLST, I2C2SLST_ACKI_MSK)

#define I2C2SLADR_SLADR_MSK             (BIT_HN | BIT3 | BIT2 | BIT1)
#define I2C2_SetSlaveAddress(n)         I2C2SLADR = ((n) << 1)

#define I2C2SLADR_MA_MSK                (BIT0)
#define I2C2_SetSlaveBroadcast()        SET_REG_BIT(I2C2SLADR, I2C2SLADR_MA_MSK)

#define I2C2TOCR_ENTO_MSK               BIT7
#define I2C2_EnableTimeout()            SET_REG_BIT(I2C2TOCR, I2C2TOCR_ENTO_MSK)
#define I2C2_DisableTimeout()           CLR_REG_BIT(I2C2TOCR, I2C2TOCR_ENTO_MSK)

#define I2C2TOCR_SCALE_MSK              BIT5
#define I2C2_TimeoutScale_SYSCLK()      SET_REG_BIT(I2C2TOCR, I2C2TOCR_SCALE_MSK)
#define I2C2_TimeoutScale_1us()         CLR_REG_BIT(I2C2TOCR, I2C2TOCR_SCALE_MSK)

#define I2C2_SetTimeoutInterval(n)      I2C2TOTL = BYTE0(n); \
                                        I2C2TOTH = BYTE1(n); \
                                        I2C2TOTE = BYTE2(n)

/////////////////////////////////////////////////

#define RTCCR_RUNRTC_MSK                BIT0
#define RTC_Run()                       SET_REG_BIT(RTCCR, RTCCR_RUNRTC_MSK)
#define RTC_Stop()                      CLR_REG_BIT(RTCCR, RTCCR_RUNRTC_MSK)

#define RTCCFG_RTCCKS_MSK               BIT1
#define RTC_CLK_X32K()                  CLR_REG_BIT(RTCCFG, RTCCFG_RTCCKS_MSK)
#define RTC_CLK_LIRC()                  SET_REG_BIT(RTCCFG, RTCCFG_RTCCKS_MSK)

#define RTCCFG_SETRTC_MSK               BIT0
#define RTC_SyncInitial()               SET_REG_BIT(RTCCFG, RTCCFG_SETRTC_MSK)
#define RTC_IsSyncing()                 READ_REG_BIT(RTCCFG, RTCCFG_SETRTC_MSK)

#define RTC_SetAlarmHour(n)             (ALAHOUR = (n))
#define RTC_SetAlarmMinute(n)           (ALAMIN = (n))
#define RTC_SetAlarmSecond(n)           (ALASEC = (n))
#define RTC_SetAlarmSSecond(n)          (ALASSEC = (n))

