fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define RTC_SetYear(n)                  (INIYEAR = (n))
#define RTC_SetMonth(n)                 (INIMONTH = (n))
#define RTC_SetDay(n)                   (INIDAY = (n))
#define RTC_SetHour(n)                  (INIHOUR = (n))
#define RTC_SetMinute(n)                (INIMIN = (n))
#define RTC_SetSecond(n)                (INISEC = (n))
#define RTC_SetSSecond(n)               (INISSEC = (n))

#define RTC_ReadYear()                  (RTCYEAR)
#define RTC_ReadMonth()                 (RTCMONTH)
#define RTC_ReadDay()                   (RTCDAY)
#define RTC_ReadWeek()                  (RTCWEEK)
#define RTC_ReadHour()                  (RTCHOUR)
#define RTC_ReadMinute()                (RTCMIN)
#define RTC_ReadSecond()                (RTCSEC)
#define RTC_ReadSSecond()               (RTCSSEC)

/////////////////////////////////////////////////

#define LCMIFCR_EN_MSK                  BIT7
#define LCM_Enable()                    SET_REG_BIT(LCMIFCR, LCMIFCR_EN_MSK)
#define LCM_Disable()                   CLR_REG_BIT(LCMIFCR, LCMIFCR_EN_MSK)

#define LCMIFCFG_BW_MSK                 BIT1
#define LCM_SetBitWidth_8B()            CLR_REG_BIT(LCMIFCFG, LCMIFCFG_BW_MSK)
#define LCM_SetBitWidth_16B()           SET_REG_BIT(LCMIFCFG, LCMIFCFG_BW_MSK)

#define LCMIFCFG_MODE_MSK               BIT0
#define LCM_SetMode_i8080()             CLR_REG_BIT(LCMIFCFG, LCMIFCFG_MODE_MSK)
#define LCM_SetMode_M6800()             SET_REG_BIT(LCMIFCFG, LCMIFCFG_MODE_MSK)

#define LCMIFCFG2_SETUPT_MSK            (BIT4 | BIT3 | BIT2)
#define LCMIFCFG2_HOLDT_MSK             (BIT1 | BIT0)
#define LCM_SetSetupTime(n)             MODIFY_REG(LCMIFCFG2, LCMIFCFG2_SETUPT_MSK, ((n) << 2))
#define LCM_SetHoldTime(n)              MODIFY_REG(LCMIFCFG2, LCMIFCFG2_HOLDT_MSK, ((n) << 0))

#define LCMIFCR_ENDIAN_MSK              BIT4
#define LCM_SetDataBigEndian()          CLR_REG_BIT(LCMIFCR, LCMIFCR_ENDIAN_MSK)
#define LCM_SetDataLittleEndian()       SET_REG_BIT(LCMIFCR, LCMIFCR_ENDIAN_MSK)

#define LCMIFCR_CMD_MSK                 (BIT2 | BIT1 | BIT0)
#define LCM_SetCommand(n)               MODIFY_REG(LCMIFCR, LCMIFCR_CMD_MSK, ((n) << 0))

#define LCMCMD_IDLE                     0
#define LCMCMD_SENDCMD                  4
#define LCMCMD_SENDDATA                 5
#define LCMCMD_READSTAT                 6
#define LCMCMD_READDATA                 7
#define LCM_Idle()                      LCM_SetCommand(LCMCMD_IDLE)
#define LCM_TrigSendCommand()           LCM_SetCommand(LCMCMD_SENDCMD)
#define LCM_TrigSendData()              LCM_SetCommand(LCMCMD_SENDDATA)
#define LCM_TrigReadStatus()            LCM_SetCommand(LCMCMD_READSTAT)
#define LCM_TrigReadData()              LCM_SetCommand(LCMCMD_READDATA)

#define LCM_WriteData_8B(d)             WRITE_REG(LCMIFDATL, (d))
#define LCM_ReadData_8B()               (LCMIFDATL)

#define LCM_WriteData_16B(d)            (LCMIFDATH = HIBYTE(d), LCMIFDATL = LOBYTE(d))
#define LCM_ReadData_16B()              MAKEWORD(LCMIFDATL, LCMIFDATH)

#define LCM_SetClockDivider(n)          WRITE_REG(LCMIFPSCR, (n))

/////////////////////////////////////////////////

#define I2SCR_FRF_MSK                   BIT4
#define I2S1_SetMOTOROLAFrame()         CLR_REG_BIT(I2SCR, I2SCR_FRF_MSK)
#define I2S1_SetTIFrame()               SET_REG_BIT(I2SCR, I2SCR_FRF_MSK)

#define I2SCR_TXDMAEN_MSK               BIT1
#define I2SCR_RXDMAEN_MSK               BIT0
#define I2S1_EnableTxDMA()              SET_REG_BIT(I2SCR, I2SCR_TXDMAEN_MSK)
#define I2S1_DisableTxDMA()             CLR_REG_BIT(I2SCR, I2SCR_TXDMAEN_MSK)
#define I2S1_EnableRxDMA()              SET_REG_BIT(I2SCR, I2SCR_RXDMAEN_MSK)
#define I2S1_DisableRxDMA()             CLR_REG_BIT(I2SCR, I2SCR_RXDMAEN_MSK)

#define I2SSR_FRE_MSK                   BIT6
#define I2SSR_BUY_MSK                   BIT5
#define I2SSR_OVR_MSK                   BIT4
#define I2SSR_UDR_MSK                   BIT3
#define I2SSR_CHSID_MSK                 BIT2
#define I2S1_CheckFREFlag()             READ_REG_BIT(I2SSR, I2SSR_FRE_MSK)
#define I2S1_CheckBUYFlag()             READ_REG_BIT(I2SSR, I2SSR_BUY_MSK)
#define I2S1_CheckOVRFlag()             READ_REG_BIT(I2SSR, I2SSR_OVR_MSK)
#define I2S1_CheckUDRFlag()             READ_REG_BIT(I2SSR, I2SSR_UDR_MSK)
#define I2S1_CheckCHSIDFlag()           READ_REG_BIT(I2SSR, I2SSR_CHSID_MSK)

#define I2S1_WriteData_16B(d)           (I2SDRH = HIBYTE(d), I2SDRL = LOBYTE(d))
#define I2S1_ReadData_16B()             MAKEWORD(I2SDRL, I2SDRH)

#define I2SPRH_MCKOE_MSK                BIT1
#define I2S1_EnableMCKOutput()          SET_REG_BIT(I2SPRH, I2SPRH_MCKOE_MSK)
#define I2S1_DisableMCKOutput()         CLR_REG_BIT(I2SPRH, I2SPRH_MCKOE_MSK)

#define I2SPRH_ODD_MSK                  BIT0
#define I2S1_SetClockDivider(n)         MODIFY_REG(I2SPRH, I2SPRH_ODD_MSK, ((n) << 0)); \
                                        I2SPRL = ((n) >> 1)

#define I2SCFGH_I2SE_MSK                BIT2
#define I2S1_Enable()                   SET_REG_BIT(I2SCFGH, I2SCFGH_I2SE_MSK)
#define I2S1_Disable()                  CLR_REG_BIT(I2SCFGH, I2SCFGH_I2SE_MSK)

#define I2SCFGH_MODE_MSK                (BIT1 | BIT0)
#define I2S1_SetMode(n)                 MODIFY_REG(I2SCFGH, I2SCFGH_MODE_MSK, ((n) << 0))
#define I2S1_SlaveSendMode()            I2S1_SetMode(0)
#define I2S1_SlaveReceiveMode()         I2S1_SetMode(1)
#define I2S1_MasterSendMode()           I2S1_SetMode(2)
#define I2S1_MasterReceiveMode()        I2S1_SetMode(3)

#define I2SCFGL_PCMSYNC_MSK             BIT7
#define I2S1_ShortFrameSync()           CLR_REG_BIT(I2SCFGL, I2SCFGL_PCMSYNC_MSK)
#define I2S1_LongFrameSync()            SET_REG_BIT(I2SCFGL, I2SCFGL_PCMSYNC_MSK)

#define I2SCFGL_STD_MSK                 (BIT5 | BIT4)
#define I2S1_SetStandard(n)             MODIFY_REG(I2SCFGL, I2SCFGL_STD_MSK, ((n) << 4))
#define I2S1_PhilipsStandard()          I2S1_SetStandard(0)
#define I2S1_LeftAlignStandard()        I2S1_SetStandard(1)
#define I2S1_RightAlignStandard()       I2S1_SetStandard(2)
#define I2S1_PCMStandard()              I2S1_SetStandard(3)

#define I2SCFGL_CKPOL_MSK               BIT3
#define I2S1_ClkNormalLow()             CLR_REG_BIT(I2SCFGL, I2SCFGL_CKPOL_MSK)
#define I2S1_ClkNormalHigh()            SET_REG_BIT(I2SCFGL, I2SCFGL_CKPOL_MSK)

#define I2SCFGL_DATLEN_MSK              (BIT2 | BIT1)
#define I2S1_SetDataLength(n)           MODIFY_REG(I2SCFGL, I2SCFGL_DATLEN_MSK, ((n) << 1))
#define I2S1_SetData16Bit()             I2S1_SetDataLength(0)
#define I2S1_SetData24Bit()             I2S1_SetDataLength(1)
#define I2S1_SetData32Bit()             I2S1_SetDataLength(2)

#define I2SCFGL_CHLEN_MSK               BIT0
#define I2S1_SetChannel16Bit()          CLR_REG_BIT(I2SCFGL, I2SCFGL_CHLEN_MSK)
#define I2S1_SetChannel32Bit()          SET_REG_BIT(I2SCFGL, I2SCFGL_CHLEN_MSK)

