fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define I2S1_SetMCKDivider(n)           WRITE_REG(I2SMCKDIV, (n))

////////////////////////

#define I2S2CR_FRF_MSK                  BIT4
#define I2S2_SetMOTOROLAFrame()         CLR_REG_BIT(I2S2CR, I2S2CR_FRF_MSK)
#define I2S2_SetTIFrame()               SET_REG_BIT(I2S2CR, I2S2CR_FRF_MSK)

#define I2S2CR_TXDMAEN_MSK              BIT1
#define I2S2CR_RXDMAEN_MSK              BIT0
#define I2S2_EnableTxDMA()              SET_REG_BIT(I2S2CR, I2S2CR_TXDMAEN_MSK)
#define I2S2_DisableTxDMA()             CLR_REG_BIT(I2S2CR, I2S2CR_TXDMAEN_MSK)
#define I2S2_EnableRxDMA()              SET_REG_BIT(I2S2CR, I2S2CR_RXDMAEN_MSK)
#define I2S2_DisableRxDMA()             CLR_REG_BIT(I2S2CR, I2S2CR_RXDMAEN_MSK)

#define I2S2SR_FRE_MSK                  BIT6
#define I2S2SR_BUY_MSK                  BIT5
#define I2S2SR_OVR_MSK                  BIT4
#define I2S2SR_UDR_MSK                  BIT3
#define I2S2SR_CHSID_MSK                BIT2
#define I2S2_CheckFREFlag()             READ_REG_BIT(I2S2SR, I2S2SR_FRE_MSK)
#define I2S2_CheckBUYFlag()             READ_REG_BIT(I2S2SR, I2S2SR_BUY_MSK)
#define I2S2_CheckOVRFlag()             READ_REG_BIT(I2S2SR, I2S2SR_OVR_MSK)
#define I2S2_CheckUDRFlag()             READ_REG_BIT(I2S2SR, I2S2SR_UDR_MSK)
#define I2S2_CheckCHSIDFlag()           READ_REG_BIT(I2S2SR, I2S2SR_CHSID_MSK)

#define I2S2_WriteData_16B(d)           (I2S2DRH = HIBYTE(d), I2S2DRL = LOBYTE(d))
#define I2S2_ReadData_16B()             MAKEWORD(I2S2DRL, I2S2DRH)

#define I2S2PRH_MCKOE_MSK               BIT1
#define I2S2_EnableMCKOutput()          SET_REG_BIT(I2S2PRH, I2S2PRH_MCKOE_MSK)
#define I2S2_DisableMCKOutput()         CLR_REG_BIT(I2S2PRH, I2S2PRH_MCKOE_MSK)

#define I2S2PRH_ODD_MSK                 BIT0
#define I2S2_SetClockDivider(n)         MODIFY_REG(I2S2PRH, I2S2PRH_ODD_MSK, ((n) << 0)); \
                                        I2S2PRL = ((n) >> 1)

#define I2S2CFGH_I2S2E_MSK              BIT2
#define I2S2_Enable()                   SET_REG_BIT(I2S2CFGH, I2S2CFGH_I2S2E_MSK)
#define I2S2_Disable()                  CLR_REG_BIT(I2S2CFGH, I2S2CFGH_I2S2E_MSK)

#define I2S2CFGH_MODE_MSK               (BIT1 | BIT0)
#define I2S2_SetMode(n)                 MODIFY_REG(I2S2CFGH, I2S2CFGH_MODE_MSK, ((n) << 0))
#define I2S2_SlaveSendMode()            I2S2_SetMode(0)
#define I2S2_SlaveReceiveMode()         I2S2_SetMode(1)
#define I2S2_MasterSendMode()           I2S2_SetMode(2)
#define I2S2_MasterReceiveMode()        I2S2_SetMode(3)

#define I2S2CFGL_PCMSYNC_MSK            BIT7
#define I2S2_ShortFrameSync()           CLR_REG_BIT(I2S2CFGL, I2S2CFGL_PCMSYNC_MSK)
#define I2S2_LongFrameSync()            SET_REG_BIT(I2S2CFGL, I2S2CFGL_PCMSYNC_MSK)

#define I2S2CFGL_STD_MSK                (BIT5 | BIT4)
#define I2S2_SetStandard(n)             MODIFY_REG(I2S2CFGL, I2S2CFGL_STD_MSK, ((n) << 4))
#define I2S2_PhilipsStandard()          I2S2_SetStandard(0)
#define I2S2_LeftAlignStandard()        I2S2_SetStandard(1)
#define I2S2_RightAlignStandard()       I2S2_SetStandard(2)
#define I2S2_PCMStandard()              I2S2_SetStandard(3)

#define I2S2CFGL_CKPOL_MSK              BIT3
#define I2S2_ClkNormalLow()             CLR_REG_BIT(I2S2CFGL, I2S2CFGL_CKPOL_MSK)
#define I2S2_ClkNormalHigh()            SET_REG_BIT(I2S2CFGL, I2S2CFGL_CKPOL_MSK)

#define I2S2CFGL_DATLEN_MSK             (BIT2 | BIT1)
#define I2S2_SetDataLength(n)           MODIFY_REG(I2S2CFGL, I2S2CFGL_DATLEN_MSK, ((n) << 1))
#define I2S2_SetData16Bit()             I2S2_SetDataLength(0)
#define I2S2_SetData24Bit()             I2S2_SetDataLength(1)
#define I2S2_SetData32Bit()             I2S2_SetDataLength(2)

#define I2S2CFGL_CHLEN_MSK              BIT0
#define I2S2_SetChannel16Bit()          CLR_REG_BIT(I2S2CFGL, I2S2CFGL_CHLEN_MSK)
#define I2S2_SetChannel32Bit()          SET_REG_BIT(I2S2CFGL, I2S2CFGL_CHLEN_MSK)

#define I2S2_SetMCKDivider(n)           WRITE_REG(I2S2MCKDIV, (n))

/////////////////////////////////////////////////

#define TFPU_CLK_SYSCLK()               WRITE_REG(DMAIR, (0x3e))
#define TFPU_CLK_HSIOCK()               WRITE_REG(DMAIR, (0x3f))

/////////////////////////////////////////////////

#define DMAUR1TCFG_UR1TPTY_MSK          (BIT1 | BIT0)
#define DMAUR2TCFG_UR2TPTY_MSK          (BIT1 | BIT0)
#define DMAUR3TCFG_UR3TPTY_MSK          (BIT1 | BIT0)
#define DMAUR4TCFG_UR4TPTY_MSK          (BIT1 | BIT0)
#define DMAUR5TCFG_UR5TPTY_MSK          (BIT1 | BIT0)
#define DMAUR6TCFG_UR6TPTY_MSK          (BIT1 | BIT0)
#define DMAUR7TCFG_UR7TPTY_MSK          (BIT1 | BIT0)
#define DMAUR8TCFG_UR8TPTY_MSK          (BIT1 | BIT0)
#define DMA_UART1_SetTxBusPriority(n)   MODIFY_REG(DMA_UR1T_CFG,  DMAUR1TCFG_UR1TPTY_MSK, ((n) << 0))
#define DMA_UART2_SetTxBusPriority(n)   MODIFY_REG(DMA_UR2T_CFG,  DMAUR2TCFG_UR2TPTY_MSK, ((n) << 0))
#define DMA_UART3_SetTxBusPriority(n)   MODIFY_REG(DMA_UR3T_CFG,  DMAUR3TCFG_UR3TPTY_MSK, ((n) << 0))
#define DMA_UART4_SetTxBusPriority(n)   MODIFY_REG(DMA_UR4T_CFG,  DMAUR4TCFG_UR4TPTY_MSK, ((n) << 0))
#define DMA_UART5_SetTxBusPriority(n)   MODIFY_REG(DMA_UR5T_CFG,  DMAUR5TCFG_UR5TPTY_MSK, ((n) << 0))
#define DMA_UART6_SetTxBusPriority(n)   MODIFY_REG(DMA_UR6T_CFG,  DMAUR6TCFG_UR6TPTY_MSK, ((n) << 0))
#define DMA_UART7_SetTxBusPriority(n)   MODIFY_REG(DMA_UR7T_CFG,  DMAUR7TCFG_UR7TPTY_MSK, ((n) << 0))
#define DMA_UART8_SetTxBusPriority(n)   MODIFY_REG(DMA_UR8T_CFG,  DMAUR8TCFG_UR8TPTY_MSK, ((n) << 0))

#define DMAUR1RCFG_UR1RPTY_MSK          (BIT1 | BIT0)
#define DMAUR2RCFG_UR2RPTY_MSK          (BIT1 | BIT0)
#define DMAUR3RCFG_UR3RPTY_MSK          (BIT1 | BIT0)
#define DMAUR4RCFG_UR4RPTY_MSK          (BIT1 | BIT0)
#define DMAUR5RCFG_UR5RPTY_MSK          (BIT1 | BIT0)
#define DMAUR6RCFG_UR6RPTY_MSK          (BIT1 | BIT0)
#define DMAUR7RCFG_UR7RPTY_MSK          (BIT1 | BIT0)
#define DMAUR8RCFG_UR8RPTY_MSK          (BIT1 | BIT0)
#define DMA_UART1_SetRxBusPriority(n)   MODIFY_REG(DMA_UR1R_CFG,  DMAUR1RCFG_UR1RPTY_MSK, ((n) << 0))
#define DMA_UART2_SetRxBusPriority(n)   MODIFY_REG(DMA_UR2R_CFG,  DMAUR2RCFG_UR2RPTY_MSK, ((n) << 0))
#define DMA_UART3_SetRxBusPriority(n)   MODIFY_REG(DMA_UR3R_CFG,  DMAUR3RCFG_UR3RPTY_MSK, ((n) << 0))
#define DMA_UART4_SetRxBusPriority(n)   MODIFY_REG(DMA_UR4R_CFG,  DMAUR4RCFG_UR4RPTY_MSK, ((n) << 0))
#define DMA_UART5_SetRxBusPriority(n)   MODIFY_REG(DMA_UR5R_CFG,  DMAUR5RCFG_UR5RPTY_MSK, ((n) << 0))
#define DMA_UART6_SetRxBusPriority(n)   MODIFY_REG(DMA_UR6R_CFG,  DMAUR6RCFG_UR6RPTY_MSK, ((n) << 0))
#define DMA_UART7_SetRxBusPriority(n)   MODIFY_REG(DMA_UR7R_CFG,  DMAUR7RCFG_UR7RPTY_MSK, ((n) << 0))
#define DMA_UART8_SetRxBusPriority(n)   MODIFY_REG(DMA_UR8R_CFG,  DMAUR8RCFG_UR8RPTY_MSK, ((n) << 0))

#define DMAUR1TCR_ENUR1T_MSK            BIT7
#define DMAUR2TCR_ENUR2T_MSK            BIT7
#define DMAUR3TCR_ENUR3T_MSK            BIT7
#define DMAUR4TCR_ENUR4T_MSK            BIT7
#define DMAUR5TCR_ENUR5T_MSK            BIT7
#define DMAUR6TCR_ENUR6T_MSK            BIT7
#define DMAUR7TCR_ENUR7T_MSK            BIT7
#define DMAUR8TCR_ENUR8T_MSK            BIT7
#define DMA_UART1_EnableTx()            SET_REG_BIT(DMA_UR1T_CR, DMAUR1TCR_ENUR1T_MSK)
#define DMA_UART2_EnableTx()            SET_REG_BIT(DMA_UR2T_CR, DMAUR2TCR_ENUR2T_MSK)
#define DMA_UART3_EnableTx()            SET_REG_BIT(DMA_UR3T_CR, DMAUR3TCR_ENUR3T_MSK)
#define DMA_UART4_EnableTx()            SET_REG_BIT(DMA_UR4T_CR, DMAUR4TCR_ENUR4T_MSK)
#define DMA_UART5_EnableTx()            SET_REG_BIT(DMA_UR5T_CR, DMAUR5TCR_ENUR5T_MSK)
#define DMA_UART6_EnableTx()            SET_REG_BIT(DMA_UR6T_CR, DMAUR6TCR_ENUR6T_MSK)
#define DMA_UART7_EnableTx()            SET_REG_BIT(DMA_UR7T_CR, DMAUR7TCR_ENUR7T_MSK)
#define DMA_UART8_EnableTx()            SET_REG_BIT(DMA_UR8T_CR, DMAUR8TCR_ENUR8T_MSK)
#define DMA_UART1_DisableTx()           CLR_REG_BIT(DMA_UR1T_CR, DMAUR1TCR_ENUR1T_MSK)
#define DMA_UART2_DisableTx()           CLR_REG_BIT(DMA_UR2T_CR, DMAUR2TCR_ENUR2T_MSK)
#define DMA_UART3_DisableTx()           CLR_REG_BIT(DMA_UR3T_CR, DMAUR3TCR_ENUR3T_MSK)
#define DMA_UART4_DisableTx()           CLR_REG_BIT(DMA_UR4T_CR, DMAUR4TCR_ENUR4T_MSK)
#define DMA_UART5_DisableTx()           CLR_REG_BIT(DMA_UR5T_CR, DMAUR5TCR_ENUR5T_MSK)
#define DMA_UART6_DisableTx()           CLR_REG_BIT(DMA_UR6T_CR, DMAUR6TCR_ENUR6T_MSK)
#define DMA_UART7_DisableTx()           CLR_REG_BIT(DMA_UR7T_CR, DMAUR7TCR_ENUR7T_MSK)
#define DMA_UART8_DisableTx()           CLR_REG_BIT(DMA_UR8T_CR, DMAUR8TCR_ENUR8T_MSK)

#define DMAUR1RCR_ENUR1R_MSK            BIT7
#define DMAUR2RCR_ENUR2R_MSK            BIT7
#define DMAUR3RCR_ENUR3R_MSK            BIT7
#define DMAUR4RCR_ENUR4R_MSK            BIT7
#define DMAUR5RCR_ENUR5R_MSK            BIT7
#define DMAUR6RCR_ENUR6R_MSK            BIT7
#define DMAUR7RCR_ENUR7R_MSK            BIT7
#define DMAUR8RCR_ENUR8R_MSK            BIT7
#define DMA_UART1_EnableRx()            SET_REG_BIT(DMA_UR1R_CR, DMAUR1RCR_ENUR1R_MSK)
#define DMA_UART2_EnableRx()            SET_REG_BIT(DMA_UR2R_CR, DMAUR2RCR_ENUR2R_MSK)
#define DMA_UART3_EnableRx()            SET_REG_BIT(DMA_UR3R_CR, DMAUR3RCR_ENUR3R_MSK)
#define DMA_UART4_EnableRx()            SET_REG_BIT(DMA_UR4R_CR, DMAUR4RCR_ENUR4R_MSK)
#define DMA_UART5_EnableRx()            SET_REG_BIT(DMA_UR5R_CR, DMAUR5RCR_ENUR5R_MSK)
#define DMA_UART6_EnableRx()            SET_REG_BIT(DMA_UR6R_CR, DMAUR6RCR_ENUR6R_MSK)
#define DMA_UART7_EnableRx()            SET_REG_BIT(DMA_UR7R_CR, DMAUR7RCR_ENUR7R_MSK)
#define DMA_UART8_EnableRx()            SET_REG_BIT(DMA_UR8R_CR, DMAUR8RCR_ENUR8R_MSK)
#define DMA_UART1_DisableRx()           CLR_REG_BIT(DMA_UR1R_CR, DMAUR1RCR_ENUR1R_MSK)
#define DMA_UART2_DisableRx()           CLR_REG_BIT(DMA_UR2R_CR, DMAUR2RCR_ENUR2R_MSK)
#define DMA_UART3_DisableRx()           CLR_REG_BIT(DMA_UR3R_CR, DMAUR3RCR_ENUR3R_MSK)
#define DMA_UART4_DisableRx()           CLR_REG_BIT(DMA_UR4R_CR, DMAUR4RCR_ENUR4R_MSK)
#define DMA_UART5_DisableRx()           CLR_REG_BIT(DMA_UR5R_CR, DMAUR5RCR_ENUR5R_MSK)
#define DMA_UART6_DisableRx()           CLR_REG_BIT(DMA_UR6R_CR, DMAUR6RCR_ENUR6R_MSK)
#define DMA_UART7_DisableRx()           CLR_REG_BIT(DMA_UR7R_CR, DMAUR7RCR_ENUR7R_MSK)
#define DMA_UART8_DisableRx()           CLR_REG_BIT(DMA_UR8R_CR, DMAUR8RCR_ENUR8R_MSK)

#define DMAUR1TCR_TRIG_MSK              BIT6
#define DMAUR2TCR_TRIG_MSK              BIT6
#define DMAUR3TCR_TRIG_MSK              BIT6
#define DMAUR4TCR_TRIG_MSK              BIT6
#define DMAUR5TCR_TRIG_MSK              BIT6
#define DMAUR6TCR_TRIG_MSK              BIT6
#define DMAUR7TCR_TRIG_MSK              BIT6
#define DMAUR8TCR_TRIG_MSK              BIT6
#define DMA_UART1_TriggerTx()           SET_REG_BIT(DMA_UR1T_CR, DMAUR1TCR_TRIG_MSK)
#define DMA_UART2_TriggerTx()           SET_REG_BIT(DMA_UR2T_CR, DMAUR2TCR_TRIG_MSK)
#define DMA_UART3_TriggerTx()           SET_REG_BIT(DMA_UR3T_CR, DMAUR3TCR_TRIG_MSK)
#define DMA_UART4_TriggerTx()           SET_REG_BIT(DMA_UR4T_CR, DMAUR4TCR_TRIG_MSK)
#define DMA_UART5_TriggerTx()           SET_REG_BIT(DMA_UR5T_CR, DMAUR5TCR_TRIG_MSK)
#define DMA_UART6_TriggerTx()           SET_REG_BIT(DMA_UR6T_CR, DMAUR6TCR_TRIG_MSK)
#define DMA_UART7_TriggerTx()           SET_REG_BIT(DMA_UR7T_CR, DMAUR7TCR_TRIG_MSK)
#define DMA_UART8_TriggerTx()           SET_REG_BIT(DMA_UR8T_CR, DMAUR8TCR_TRIG_MSK)

#define DMAUR1RCR_TRIG_MSK              BIT5
#define DMAUR2RCR_TRIG_MSK              BIT5
#define DMAUR3RCR_TRIG_MSK              BIT5
#define DMAUR4RCR_TRIG_MSK              BIT5
#define DMAUR5RCR_TRIG_MSK              BIT5
#define DMAUR6RCR_TRIG_MSK              BIT5
#define DMAUR7RCR_TRIG_MSK              BIT5
#define DMAUR8RCR_TRIG_MSK              BIT5
#define DMA_UART1_TriggerRx()           SET_REG_BIT(DMA_UR1R_CR, DMAUR1RCR_TRIG_MSK)
#define DMA_UART2_TriggerRx()           SET_REG_BIT(DMA_UR2R_CR, DMAUR2RCR_TRIG_MSK)
#define DMA_UART3_TriggerRx()           SET_REG_BIT(DMA_UR3R_CR, DMAUR3RCR_TRIG_MSK)
#define DMA_UART4_TriggerRx()           SET_REG_BIT(DMA_UR4R_CR, DMAUR4RCR_TRIG_MSK)
#define DMA_UART5_TriggerRx()           SET_REG_BIT(DMA_UR5R_CR, DMAUR5RCR_TRIG_MSK)
#define DMA_UART6_TriggerRx()           SET_REG_BIT(DMA_UR6R_CR, DMAUR6RCR_TRIG_MSK)
#define DMA_UART7_TriggerRx()           SET_REG_BIT(DMA_UR7R_CR, DMAUR7RCR_TRIG_MSK)
#define DMA_UART8_TriggerRx()           SET_REG_BIT(DMA_UR8R_CR, DMAUR8RCR_TRIG_MSK)

