fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMAUR1RCR_CLRFIFO_MSK           BIT0
#define DMAUR2RCR_CLRFIFO_MSK           BIT0
#define DMAUR3RCR_CLRFIFO_MSK           BIT0
#define DMAUR4RCR_CLRFIFO_MSK           BIT0
#define DMAUR5RCR_CLRFIFO_MSK           BIT0
#define DMAUR6RCR_CLRFIFO_MSK           BIT0
#define DMAUR7RCR_CLRFIFO_MSK           BIT0
#define DMAUR8RCR_CLRFIFO_MSK           BIT0
#define DMA_UART1_ClearFIFO()           SET_REG_BIT(DMA_UR1R_CR, DMAUR1RCR_CLRFIFO_MSK)
#define DMA_UART2_ClearFIFO()           SET_REG_BIT(DMA_UR2R_CR, DMAUR2RCR_CLRFIFO_MSK)
#define DMA_UART3_ClearFIFO()           SET_REG_BIT(DMA_UR3R_CR, DMAUR3RCR_CLRFIFO_MSK)
#define DMA_UART4_ClearFIFO()           SET_REG_BIT(DMA_UR4R_CR, DMAUR4RCR_CLRFIFO_MSK)
#define DMA_UART5_ClearFIFO()           SET_REG_BIT(DMA_UR5R_CR, DMAUR5RCR_CLRFIFO_MSK)
#define DMA_UART6_ClearFIFO()           SET_REG_BIT(DMA_UR6R_CR, DMAUR6RCR_CLRFIFO_MSK)
#define DMA_UART7_ClearFIFO()           SET_REG_BIT(DMA_UR7R_CR, DMAUR7RCR_CLRFIFO_MSK)
#define DMA_UART8_ClearFIFO()           SET_REG_BIT(DMA_UR8R_CR, DMAUR8RCR_CLRFIFO_MSK)

#define DMAUR1TSTA_TXOVW_MSK            BIT2
#define DMAUR2TSTA_TXOVW_MSK            BIT2
#define DMAUR3TSTA_TXOVW_MSK            BIT2
#define DMAUR4TSTA_TXOVW_MSK            BIT2
#define DMAUR5TSTA_TXOVW_MSK            BIT2
#define DMAUR6TSTA_TXOVW_MSK            BIT2
#define DMAUR7TSTA_TXOVW_MSK            BIT2
#define DMAUR8TSTA_TXOVW_MSK            BIT2
#define DMA_UART1_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR1T_STA,  DMAUR1TSTA_TXOVW_MSK)
#define DMA_UART2_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR2T_STA,  DMAUR2TSTA_TXOVW_MSK)
#define DMA_UART3_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR3T_STA,  DMAUR3TSTA_TXOVW_MSK)
#define DMA_UART4_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR4T_STA,  DMAUR4TSTA_TXOVW_MSK)
#define DMA_UART5_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR5T_STA,  DMAUR5TSTA_TXOVW_MSK)
#define DMA_UART6_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR6T_STA,  DMAUR6TSTA_TXOVW_MSK)
#define DMA_UART7_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR7T_STA,  DMAUR7TSTA_TXOVW_MSK)
#define DMA_UART8_CheckOverWriteFlag()  READ_REG_BIT(DMA_UR8T_STA,  DMAUR8TSTA_TXOVW_MSK)
#define DMA_UART1_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR1T_STA,   DMAUR1TSTA_TXOVW_MSK)
#define DMA_UART2_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR2T_STA,   DMAUR2TSTA_TXOVW_MSK)
#define DMA_UART3_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR3T_STA,   DMAUR3TSTA_TXOVW_MSK)
#define DMA_UART4_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR4T_STA,   DMAUR4TSTA_TXOVW_MSK)
#define DMA_UART5_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR5T_STA,   DMAUR5TSTA_TXOVW_MSK)
#define DMA_UART6_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR6T_STA,   DMAUR6TSTA_TXOVW_MSK)
#define DMA_UART7_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR7T_STA,   DMAUR7TSTA_TXOVW_MSK)
#define DMA_UART8_ClearOverWriteFlag()  CLR_REG_BIT(DMA_UR8T_STA,   DMAUR8TSTA_TXOVW_MSK)

#define DMAUR1RSTA_RXLOSS_MSK           BIT1
#define DMAUR2RSTA_RXLOSS_MSK           BIT1
#define DMAUR3RSTA_RXLOSS_MSK           BIT1
#define DMAUR4RSTA_RXLOSS_MSK           BIT1
#define DMAUR5RSTA_RXLOSS_MSK           BIT1
#define DMAUR6RSTA_RXLOSS_MSK           BIT1
#define DMAUR7RSTA_RXLOSS_MSK           BIT1
#define DMAUR8RSTA_RXLOSS_MSK           BIT1
#define DMA_UART1_CheckRxLossFlag()     READ_REG_BIT(DMA_UR1R_STA,  DMAUR1RSTA_RXLOSS_MSK)
#define DMA_UART2_CheckRxLossFlag()     READ_REG_BIT(DMA_UR2R_STA,  DMAUR2RSTA_RXLOSS_MSK)
#define DMA_UART3_CheckRxLossFlag()     READ_REG_BIT(DMA_UR3R_STA,  DMAUR3RSTA_RXLOSS_MSK)
#define DMA_UART4_CheckRxLossFlag()     READ_REG_BIT(DMA_UR4R_STA,  DMAUR4RSTA_RXLOSS_MSK)
#define DMA_UART5_CheckRxLossFlag()     READ_REG_BIT(DMA_UR5R_STA,  DMAUR5RSTA_RXLOSS_MSK)
#define DMA_UART6_CheckRxLossFlag()     READ_REG_BIT(DMA_UR6R_STA,  DMAUR6RSTA_RXLOSS_MSK)
#define DMA_UART7_CheckRxLossFlag()     READ_REG_BIT(DMA_UR7R_STA,  DMAUR7RSTA_RXLOSS_MSK)
#define DMA_UART8_CheckRxLossFlag()     READ_REG_BIT(DMA_UR8R_STA,  DMAUR8RSTA_RXLOSS_MSK)
#define DMA_UART1_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR1R_STA,   DMAUR1RSTA_RXLOSS_MSK)
#define DMA_UART2_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR2R_STA,   DMAUR2RSTA_RXLOSS_MSK)
#define DMA_UART3_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR3R_STA,   DMAUR3RSTA_RXLOSS_MSK)
#define DMA_UART4_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR4R_STA,   DMAUR4RSTA_RXLOSS_MSK)
#define DMA_UART5_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR5R_STA,   DMAUR5RSTA_RXLOSS_MSK)
#define DMA_UART6_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR6R_STA,   DMAUR6RSTA_RXLOSS_MSK)
#define DMA_UART7_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR7R_STA,   DMAUR7RSTA_RXLOSS_MSK)
#define DMA_UART8_ClearRxLossFlag()     CLR_REG_BIT(DMA_UR8R_STA,   DMAUR8RSTA_RXLOSS_MSK)

#define DMA_UART1_SetTxAmount(d)        (DMA_UR1T_AMTH = HIBYTE(d), DMA_UR1T_AMT = LOBYTE(d))
#define DMA_UART2_SetTxAmount(d)        (DMA_UR2T_AMTH = HIBYTE(d), DMA_UR2T_AMT = LOBYTE(d))
#define DMA_UART3_SetTxAmount(d)        (DMA_UR3T_AMTH = HIBYTE(d), DMA_UR3T_AMT = LOBYTE(d))
#define DMA_UART4_SetTxAmount(d)        (DMA_UR4T_AMTH = HIBYTE(d), DMA_UR4T_AMT = LOBYTE(d))
#define DMA_UART5_SetTxAmount(d)        (DMA_UR5T_AMTH = HIBYTE(d), DMA_UR5T_AMT = LOBYTE(d))
#define DMA_UART6_SetTxAmount(d)        (DMA_UR6T_AMTH = HIBYTE(d), DMA_UR6T_AMT = LOBYTE(d))
#define DMA_UART7_SetTxAmount(d)        (DMA_UR7T_AMTH = HIBYTE(d), DMA_UR7T_AMT = LOBYTE(d))
#define DMA_UART8_SetTxAmount(d)        (DMA_UR8T_AMTH = HIBYTE(d), DMA_UR8T_AMT = LOBYTE(d))

#define DMA_UART1_SetRxAmount(d)        (DMA_UR1R_AMTH = HIBYTE(d), DMA_UR1R_AMT = LOBYTE(d))
#define DMA_UART2_SetRxAmount(d)        (DMA_UR2R_AMTH = HIBYTE(d), DMA_UR2R_AMT = LOBYTE(d))
#define DMA_UART3_SetRxAmount(d)        (DMA_UR3R_AMTH = HIBYTE(d), DMA_UR3R_AMT = LOBYTE(d))
#define DMA_UART4_SetRxAmount(d)        (DMA_UR4R_AMTH = HIBYTE(d), DMA_UR4R_AMT = LOBYTE(d))
#define DMA_UART5_SetRxAmount(d)        (DMA_UR5R_AMTH = HIBYTE(d), DMA_UR5R_AMT = LOBYTE(d))
#define DMA_UART6_SetRxAmount(d)        (DMA_UR6R_AMTH = HIBYTE(d), DMA_UR6R_AMT = LOBYTE(d))
#define DMA_UART7_SetRxAmount(d)        (DMA_UR7R_AMTH = HIBYTE(d), DMA_UR7R_AMT = LOBYTE(d))
#define DMA_UART8_SetRxAmount(d)        (DMA_UR8R_AMTH = HIBYTE(d), DMA_UR8R_AMT = LOBYTE(d))

#define DMA_UART1_ReadTxDone()          MAKEWORD(DMA_UR1T_DONE, DMA_UR1T_DONEH)
#define DMA_UART2_ReadTxDone()          MAKEWORD(DMA_UR2T_DONE, DMA_UR2T_DONEH)
#define DMA_UART3_ReadTxDone()          MAKEWORD(DMA_UR3T_DONE, DMA_UR3T_DONEH)
#define DMA_UART4_ReadTxDone()          MAKEWORD(DMA_UR4T_DONE, DMA_UR4T_DONEH)
#define DMA_UART5_ReadTxDone()          MAKEWORD(DMA_UR5T_DONE, DMA_UR5T_DONEH)
#define DMA_UART6_ReadTxDone()          MAKEWORD(DMA_UR6T_DONE, DMA_UR6T_DONEH)
#define DMA_UART7_ReadTxDone()          MAKEWORD(DMA_UR7T_DONE, DMA_UR7T_DONEH)
#define DMA_UART8_ReadTxDone()          MAKEWORD(DMA_UR8T_DONE, DMA_UR8T_DONEH)

#define DMA_UART1_ReadRxDone()          MAKEWORD(DMA_UR1R_DONE, DMA_UR1R_DONEH)
#define DMA_UART2_ReadRxDone()          MAKEWORD(DMA_UR2R_DONE, DMA_UR2R_DONEH)
#define DMA_UART3_ReadRxDone()          MAKEWORD(DMA_UR3R_DONE, DMA_UR3R_DONEH)
#define DMA_UART4_ReadRxDone()          MAKEWORD(DMA_UR4R_DONE, DMA_UR4R_DONEH)
#define DMA_UART5_ReadRxDone()          MAKEWORD(DMA_UR5R_DONE, DMA_UR5R_DONEH)
#define DMA_UART6_ReadRxDone()          MAKEWORD(DMA_UR6R_DONE, DMA_UR6R_DONEH)
#define DMA_UART7_ReadRxDone()          MAKEWORD(DMA_UR7R_DONE, DMA_UR7R_DONEH)
#define DMA_UART8_ReadRxDone()          MAKEWORD(DMA_UR8R_DONE, DMA_UR8R_DONEH)

#define DMA_UART1_SetTxAddress(d)       (DMA_UR1T_TXAH = HIBYTE(d), DMA_UR1T_TXAL = LOBYTE(d))
#define DMA_UART2_SetTxAddress(d)       (DMA_UR2T_TXAH = HIBYTE(d), DMA_UR2T_TXAL = LOBYTE(d))
#define DMA_UART3_SetTxAddress(d)       (DMA_UR3T_TXAH = HIBYTE(d), DMA_UR3T_TXAL = LOBYTE(d))
#define DMA_UART4_SetTxAddress(d)       (DMA_UR4T_TXAH = HIBYTE(d), DMA_UR4T_TXAL = LOBYTE(d))
#define DMA_UART5_SetTxAddress(d)       (DMA_UR5T_TXAH = HIBYTE(d), DMA_UR5T_TXAL = LOBYTE(d))
#define DMA_UART6_SetTxAddress(d)       (DMA_UR6T_TXAH = HIBYTE(d), DMA_UR6T_TXAL = LOBYTE(d))
#define DMA_UART7_SetTxAddress(d)       (DMA_UR7T_TXAH = HIBYTE(d), DMA_UR7T_TXAL = LOBYTE(d))
#define DMA_UART8_SetTxAddress(d)       (DMA_UR8T_TXAH = HIBYTE(d), DMA_UR8T_TXAL = LOBYTE(d))

#define DMA_UART1_SetRxAddress(d)       (DMA_UR1R_RXAH = HIBYTE(d), DMA_UR1R_RXAL = LOBYTE(d))
#define DMA_UART2_SetRxAddress(d)       (DMA_UR2R_RXAH = HIBYTE(d), DMA_UR2R_RXAL = LOBYTE(d))
#define DMA_UART3_SetRxAddress(d)       (DMA_UR3R_RXAH = HIBYTE(d), DMA_UR3R_RXAL = LOBYTE(d))
#define DMA_UART4_SetRxAddress(d)       (DMA_UR4R_RXAH = HIBYTE(d), DMA_UR4R_RXAL = LOBYTE(d))
#define DMA_UART5_SetRxAddress(d)       (DMA_UR5R_RXAH = HIBYTE(d), DMA_UR5R_RXAL = LOBYTE(d))
#define DMA_UART6_SetRxAddress(d)       (DMA_UR6R_RXAH = HIBYTE(d), DMA_UR6R_RXAL = LOBYTE(d))
#define DMA_UART7_SetRxAddress(d)       (DMA_UR7R_RXAH = HIBYTE(d), DMA_UR7R_RXAL = LOBYTE(d))
#define DMA_UART8_SetRxAddress(d)       (DMA_UR8R_RXAH = HIBYTE(d), DMA_UR8R_RXAL = LOBYTE(d))

