fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMA_UART1_SetInterval(d)        (DMA_UR1_ITVH = HIBYTE(d), DMA_UR1_ITVL = LOBYTE(d))
#define DMA_UART2_SetInterval(d)        (DMA_UR2_ITVH = HIBYTE(d), DMA_UR2_ITVL = LOBYTE(d))
#define DMA_UART3_SetInterval(d)        (DMA_UR3_ITVH = HIBYTE(d), DMA_UR3_ITVL = LOBYTE(d))
#define DMA_UART4_SetInterval(d)        (DMA_UR4_ITVH = HIBYTE(d), DMA_UR4_ITVL = LOBYTE(d))
#define DMA_UART5_SetInterval(d)        (DMA_UR5_ITVH = HIBYTE(d), DMA_UR5_ITVL = LOBYTE(d))
#define DMA_UART6_SetInterval(d)        (DMA_UR6_ITVH = HIBYTE(d), DMA_UR6_ITVL = LOBYTE(d))
#define DMA_UART7_SetInterval(d)        (DMA_UR7_ITVH = HIBYTE(d), DMA_UR7_ITVL = LOBYTE(d))
#define DMA_UART8_SetInterval(d)        (DMA_UR8_ITVH = HIBYTE(d), DMA_UR8_ITVL = LOBYTE(d))

/////////////////////////////////////////////////

#define DMAADCCFG_ADCPTY_MSK            (BIT1 | BIT0)
#define DMA_ADC1_SetBusPriority(n)      MODIFY_REG(DMA_ADC_CFG,  DMAADCCFG_ADCPTY_MSK, ((n) << 0))

#define DMAADCCR_ENADC_MSK              BIT7
#define DMA_ADC1_Enable()               SET_REG_BIT(DMA_ADC_CR, DMAADCCR_ENADC_MSK)
#define DMA_ADC1_Disable()              CLR_REG_BIT(DMA_ADC_CR, DMAADCCR_ENADC_MSK)

#define DMAADCCR_TRIG_MSK               BIT6
#define DMA_ADC1_Trigger()              SET_REG_BIT(DMA_ADC_CR, DMAADCCR_TRIG_MSK)

#define DMA_ADC1_SetAmount(d)           (DMA_ADC_AMTH = HIBYTE(d), DMA_ADC_AMT = LOBYTE(d))
#define DMA_ADC1_ReadDone()             MAKEWORD(DMA_ADC_DONE, DMA_ADC_DONEH)
#define DMA_ADC1_SetAddress(d)          (DMA_ADC_RXAH = HIBYTE(d), DMA_ADC_RXAL = LOBYTE(d))
#define DMA_ADC1_SetInterval(d)         (DMA_ADC_ITVH = HIBYTE(d), DMA_ADC_ITVL = LOBYTE(d))
#define DMA_ADC1_SetChannels(d)         (DMA_ADC_CHSW1 = HIBYTE(d), DMA_ADC_CHSW0 = LOBYTE(d))

#define DMAADCCFG2_CVTIMES_MSK          (BIT_LN)
#define DAM_ADC1_SetRepeatTimes(n)      MODIFY_REG(DMA_ADC_CFG2,  DMAADCCFG2_CVTIMES_MSK, ((n) << 0))
#define DMA_ADC1_DisableRepeatConv()    DAM_ADC1_SetRepeatTimes(0)
#define DMA_ADC1_SetRepeat2Times()      DAM_ADC1_SetRepeatTimes(8)
#define DMA_ADC1_SetRepeat4Times()      DAM_ADC1_SetRepeatTimes(9)
#define DMA_ADC1_SetRepeat8Times()      DAM_ADC1_SetRepeatTimes(10)
#define DMA_ADC1_SetRepeat16Times()     DAM_ADC1_SetRepeatTimes(11)
#define DMA_ADC1_SetRepeat32Times()     DAM_ADC1_SetRepeatTimes(12)
#define DMA_ADC1_SetRepeat64Times()     DAM_ADC1_SetRepeatTimes(13)
#define DMA_ADC1_SetRepeat128Times()    DAM_ADC1_SetRepeatTimes(14)
#define DMA_ADC1_SetRepeat256Times()    DAM_ADC1_SetRepeatTimes(15)

////////////////////////

#define DMAADC2CFG_ADCPTY_MSK           (BIT1 | BIT0)
#define DMA_ADC2_SetBusPriority(n)      MODIFY_REG(DMA_ADC2_CFG,  DMAADC2CFG_ADCPTY_MSK, ((n) << 0))

#define DMAADC2CR_ENADC_MSK             BIT7
#define DMA_ADC2_Enable()               SET_REG_BIT(DMA_ADC2_CR, DMAADC2CR_ENADC_MSK)
#define DMA_ADC2_Disable()              CLR_REG_BIT(DMA_ADC2_CR, DMAADC2CR_ENADC_MSK)

#define DMAADC2CR_TRIG_MSK              BIT6
#define DMA_ADC2_Trigger()              SET_REG_BIT(DMA_ADC2_CR, DMAADC2CR_TRIG_MSK)

#define DMA_ADC2_SetAmount(d)           (DMA_ADC2_AMTH = HIBYTE(d), DMA_ADC2_AMT = LOBYTE(d))
#define DMA_ADC2_ReadDone()             MAKEWORD(DMA_ADC2_DONE, DMA_ADC2_DONEH)
#define DMA_ADC2_SetAddress(d)          (DMA_ADC2_RXAH = HIBYTE(d), DMA_ADC2_RXAL = LOBYTE(d))
#define DMA_ADC2_SetInterval(d)         (DMA_ADC2_ITVH = HIBYTE(d), DMA_ADC2_ITVL = LOBYTE(d))
#define DMA_ADC2_SetChannels(d)         (DMA_ADC2_CHSW1 = HIBYTE(d), DMA_ADC2_CHSW0 = LOBYTE(d))

#define DMAADC2CFG2_CVTIMES_MSK         (BIT_LN)
#define DAM_ADC2_SetRepeatTimes(n)      MODIFY_REG(DMA_ADC2_CFG2,  DMAADC2CFG2_CVTIMES_MSK, ((n) << 0))
#define DMA_ADC2_DisableRepeatConv()    DAM_ADC2_SetRepeatTimes(0)
#define DMA_ADC2_SetRepeat2Times()      DAM_ADC2_SetRepeatTimes(8)
#define DMA_ADC2_SetRepeat4Times()      DAM_ADC2_SetRepeatTimes(9)
#define DMA_ADC2_SetRepeat8Times()      DAM_ADC2_SetRepeatTimes(10)
#define DMA_ADC2_SetRepeat16Times()     DAM_ADC2_SetRepeatTimes(11)
#define DMA_ADC2_SetRepeat32Times()     DAM_ADC2_SetRepeatTimes(12)
#define DMA_ADC2_SetRepeat64Times()     DAM_ADC2_SetRepeatTimes(13)
#define DMA_ADC2_SetRepeat128Times()    DAM_ADC2_SetRepeatTimes(14)
#define DMA_ADC2_SetRepeat256Times()    DAM_ADC2_SetRepeatTimes(15)

/////////////////////////////////////////////////

#define DMASPICFG_ACTTX_MSK             BIT6
#define DMASPICFG_ACTRX_MSK             BIT5
#define DMA_SPI1_EnableTx()             SET_REG_BIT(DMA_SPI_CFG, DMASPICFG_ACTTX_MSK)
#define DMA_SPI1_DisableTx()            CLR_REG_BIT(DMA_SPI_CFG, DMASPICFG_ACTTX_MSK)
#define DMA_SPI1_EnableRx()             SET_REG_BIT(DMA_SPI_CFG, DMASPICFG_ACTRX_MSK)
#define DMA_SPI1_DisableRx()            CLR_REG_BIT(DMA_SPI_CFG, DMASPICFG_ACTRX_MSK)

#define DMASPICFG_SPIPTY_MSK            (BIT1 | BIT0)
#define DMA_SPI1_SetBusPriority(n)      MODIFY_REG(DMA_SPI_CFG,  DMASPICFG_SPIPTY_MSK, ((n) << 0))

#define DMASPICFG2_WRPSS_MSK            BIT2
#define DMA_SPI1_AutoSS()               SET_REG_BIT(DMA_SPI_CFG2, DMASPICFG2_WRPSS_MSK)
#define DMA_SPI1_ManualSS()             CLR_REG_BIT(DMA_SPI_CFG2, DMASPICFG2_WRPSS_MSK)

#define DMASPICFG2_SSS_MSK              (BIT1 | BIT0)
#define DMA_SPI1_SetAutoSSPort(n)       MODIFY_REG(DMA_SPI_CFG2,  DMASPICFG2_SSS_MSK, ((n) << 0))
#define DMA_SPI1_SetAutoSSP12()         DMA_SPI1_SetAutoSSPort(0)
#define DMA_SPI1_SetAutoSSP22()         DMA_SPI1_SetAutoSSPort(1)
#define DMA_SPI1_SetAutoSSP54()         DMA_SPI1_SetAutoSSPort(2)
#define DMA_SPI1_SetAutoSSP35()         DMA_SPI1_SetAutoSSPort(3)

#define DMASPICR_ENSPI_MSK              BIT7
#define DMA_SPI1_Enable()               SET_REG_BIT(DMA_SPI_CR, DMASPICR_ENSPI_MSK)
#define DMA_SPI1_Disable()              CLR_REG_BIT(DMA_SPI_CR, DMASPICR_ENSPI_MSK)

#define DMASPICR_TRIGM_MSK              BIT6
#define DMASPICR_TRIGS_MSK              BIT5
#define DMA_SPI1_MasterTrigger()        SET_REG_BIT(DMA_SPI_CR, DMASPICR_TRIGM_MSK)
#define DMA_SPI1_SlaveTrigger()         SET_REG_BIT(DMA_SPI_CR, DMASPICR_TRIGS_MSK)

#define DMASPICR_CLRFIFO_MSK            BIT0
#define DMA_SPI1_ClearFIFO()            SET_REG_BIT(DMA_SPI_CR, DMASPICR_CLRFIFO_MSK)

#define DMASPISTA_TXOVW_MSK             BIT2
#define DMASPISTA_RXLOSS_MSK            BIT1
#define DMA_SPI1_CheckOverWriteFlag()   READ_REG_BIT(DMA_SPI_STA,  DMASPISTA_TXOVW_MSK)
#define DMA_SPI1_ClearOverWriteFlag()   CLR_REG_BIT(DMA_SPI_STA,   DMASPISTA_TXOVW_MSK)
#define DMA_SPI1_CheckRxLossFlag()      READ_REG_BIT(DMA_SPI_STA,  DMASPISTA_RXLOSS_MSK)
#define DMA_SPI1_ClearRxLossFlag()      CLR_REG_BIT(DMA_SPI_STA,   DMASPISTA_RXLOSS_MSK)

#define DMA_SPI1_SetAmount(d)           (DMA_SPI_AMTH = HIBYTE(d), DMA_SPI_AMT = LOBYTE(d))
#define DMA_SPI1_ReadDone()             MAKEWORD(DMA_SPI_DONE, DMA_SPI_DONEH)
#define DMA_SPI1_SetTxAddress(d)        (DMA_SPI_TXAH = HIBYTE(d), DMA_SPI_TXAL = LOBYTE(d))
#define DMA_SPI1_SetRxAddress(d)        (DMA_SPI_RXAH = HIBYTE(d), DMA_SPI_RXAL = LOBYTE(d))
#define DMA_SPI1_SetInterval(d)         (DMA_SPI_ITVH = HIBYTE(d), DMA_SPI_ITVL = LOBYTE(d))

