fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
////////////////////////

#define DMASPI2CFG_ACTTX_MSK            BIT6
#define DMASPI2CFG_ACTRX_MSK            BIT5
#define DMA_SPI2_EnableTx()             SET_REG_BIT(DMA_SPI2_CFG, DMASPI2CFG_ACTTX_MSK)
#define DMA_SPI2_DisableTx()            CLR_REG_BIT(DMA_SPI2_CFG, DMASPI2CFG_ACTTX_MSK)
#define DMA_SPI2_EnableRx()             SET_REG_BIT(DMA_SPI2_CFG, DMASPI2CFG_ACTRX_MSK)
#define DMA_SPI2_DisableRx()            CLR_REG_BIT(DMA_SPI2_CFG, DMASPI2CFG_ACTRX_MSK)

#define DMASPI2CFG_SPIPTY_MSK           (BIT1 | BIT0)
#define DMA_SPI2_SetBusPriority(n)      MODIFY_REG(DMA_SPI2_CFG,  DMASPI2CFG_SPIPTY_MSK, ((n) << 0))

#define DMASPI2CFG2_WRPSS_MSK           BIT2
#define DMA_SPI2_AutoSS()               SET_REG_BIT(DMA_SPI2_CFG2, DMASPI2CFG2_WRPSS_MSK)
#define DMA_SPI2_ManualSS()             CLR_REG_BIT(DMA_SPI2_CFG2, DMASPI2CFG2_WRPSS_MSK)

#define DMASPI2CFG2_SSS_MSK             (BIT1 | BIT0)
#define DMA_SPI2_SetAutoSSPort(n)       MODIFY_REG(DMA_SPI2_CFG2,  DMASPI2CFG2_SSS_MSK, ((n) << 0))
#define DMA_SPI2_SetAutoSSP64()         DMA_SPI2_SetAutoSSPort(0)
#define DMA_SPI2_SetAutoSSP02()         DMA_SPI2_SetAutoSSPort(1)
#define DMA_SPI2_SetAutoSSPB1()         DMA_SPI2_SetAutoSSPort(2)
#define DMA_SPI2_SetAutoSSP80()         DMA_SPI2_SetAutoSSPort(3)

#define DMASPI2CR_ENSPI_MSK             BIT7
#define DMA_SPI2_Enable()               SET_REG_BIT(DMA_SPI2_CR, DMASPI2CR_ENSPI_MSK)
#define DMA_SPI2_Disable()              CLR_REG_BIT(DMA_SPI2_CR, DMASPI2CR_ENSPI_MSK)

#define DMASPI2CR_TRIGM_MSK             BIT6
#define DMASPI2CR_TRIGS_MSK             BIT5
#define DMA_SPI2_MasterTrigger()        SET_REG_BIT(DMA_SPI2_CR, DMASPI2CR_TRIGM_MSK)
#define DMA_SPI2_SlaveTrigger()         SET_REG_BIT(DMA_SPI2_CR, DMASPI2CR_TRIGS_MSK)

#define DMASPI2CR_CLRFIFO_MSK           BIT0
#define DMA_SPI2_ClearFIFO()            SET_REG_BIT(DMA_SPI2_CR, DMASPI2CR_CLRFIFO_MSK)

#define DMASPI2STA_TXOVW_MSK            BIT2
#define DMASPI2STA_RXLOSS_MSK           BIT1
#define DMA_SPI2_CheckOverWriteFlag()   READ_REG_BIT(DMA_SPI2_STA,  DMASPI2STA_TXOVW_MSK)
#define DMA_SPI2_ClearOverWriteFlag()   CLR_REG_BIT(DMA_SPI2_STA,   DMASPI2STA_TXOVW_MSK)
#define DMA_SPI2_CheckRxLossFlag()      READ_REG_BIT(DMA_SPI2_STA,  DMASPI2STA_RXLOSS_MSK)
#define DMA_SPI2_ClearRxLossFlag()      CLR_REG_BIT(DMA_SPI2_STA,   DMASPI2STA_RXLOSS_MSK)

#define DMA_SPI2_SetAmount(d)           (DMA_SPI2_AMTH = HIBYTE(d), DMA_SPI2_AMT = LOBYTE(d))
#define DMA_SPI2_ReadDone()             MAKEWORD(DMA_SPI2_DONE, DMA_SPI2_DONEH)
#define DMA_SPI2_SetTxAddress(d)        (DMA_SPI2_TXAH = HIBYTE(d), DMA_SPI2_TXAL = LOBYTE(d))
#define DMA_SPI2_SetRxAddress(d)        (DMA_SPI2_RXAH = HIBYTE(d), DMA_SPI2_RXAL = LOBYTE(d))
#define DMA_SPI2_SetInterval(d)         (DMA_SPI2_ITVH = HIBYTE(d), DMA_SPI2_ITVL = LOBYTE(d))

////////////////////////

#define DMASPI3CFG_ACTTX_MSK            BIT6
#define DMASPI3CFG_ACTRX_MSK            BIT5
#define DMA_SPI3_EnableTx()             SET_REG_BIT(DMA_SPI3_CFG, DMASPI3CFG_ACTTX_MSK)
#define DMA_SPI3_DisableTx()            CLR_REG_BIT(DMA_SPI3_CFG, DMASPI3CFG_ACTTX_MSK)
#define DMA_SPI3_EnableRx()             SET_REG_BIT(DMA_SPI3_CFG, DMASPI3CFG_ACTRX_MSK)
#define DMA_SPI3_DisableRx()            CLR_REG_BIT(DMA_SPI3_CFG, DMASPI3CFG_ACTRX_MSK)

#define DMASPI3CFG_SPIPTY_MSK           (BIT1 | BIT0)
#define DMA_SPI3_SetBusPriority(n)      MODIFY_REG(DMA_SPI3_CFG,  DMASPI3CFG_SPIPTY_MSK, ((n) << 0))

#define DMASPI3CFG2_WRPSS_MSK           BIT2
#define DMA_SPI3_AutoSS()               SET_REG_BIT(DMA_SPI3_CFG2, DMASPI3CFG2_WRPSS_MSK)
#define DMA_SPI3_ManualSS()             CLR_REG_BIT(DMA_SPI3_CFG2, DMASPI3CFG2_WRPSS_MSK)

#define DMASPI3CFG2_SSS_MSK             (BIT1 | BIT0)
#define DMA_SPI3_SetAutoSSPort(n)       MODIFY_REG(DMA_SPI3_CFG2,  DMASPI3CFG2_SSS_MSK, ((n) << 0))
#define DMA_SPI3_SetAutoSSP22()         DMA_SPI3_SetAutoSSPort(0)
#define DMA_SPI3_SetAutoSSP70()         DMA_SPI3_SetAutoSSPort(1)
#define DMA_SPI3_SetAutoSSP84()         DMA_SPI3_SetAutoSSPort(2)
#define DMA_SPI3_SetAutoSSP90()         DMA_SPI3_SetAutoSSPort(3)

#define DMASPI3CR_ENSPI_MSK             BIT7
#define DMA_SPI3_Enable()               SET_REG_BIT(DMA_SPI3_CR, DMASPI3CR_ENSPI_MSK)
#define DMA_SPI3_Disable()              CLR_REG_BIT(DMA_SPI3_CR, DMASPI3CR_ENSPI_MSK)

#define DMASPI3CR_TRIGM_MSK             BIT6
#define DMASPI3CR_TRIGS_MSK             BIT5
#define DMA_SPI3_MasterTrigger()        SET_REG_BIT(DMA_SPI3_CR, DMASPI3CR_TRIGM_MSK)
#define DMA_SPI3_SlaveTrigger()         SET_REG_BIT(DMA_SPI3_CR, DMASPI3CR_TRIGS_MSK)

#define DMASPI3CR_CLRFIFO_MSK           BIT0
#define DMA_SPI3_ClearFIFO()            SET_REG_BIT(DMA_SPI3_CR, DMASPI3CR_CLRFIFO_MSK)

#define DMASPI3STA_TXOVW_MSK            BIT2
#define DMASPI3STA_RXLOSS_MSK           BIT1
#define DMA_SPI3_CheckOverWriteFlag()   READ_REG_BIT(DMA_SPI3_STA,  DMASPI3STA_TXOVW_MSK)
#define DMA_SPI3_ClearOverWriteFlag()   CLR_REG_BIT(DMA_SPI3_STA,   DMASPI3STA_TXOVW_MSK)
#define DMA_SPI3_CheckRxLossFlag()      READ_REG_BIT(DMA_SPI3_STA,  DMASPI3STA_RXLOSS_MSK)
#define DMA_SPI3_ClearRxLossFlag()      CLR_REG_BIT(DMA_SPI3_STA,   DMASPI3STA_RXLOSS_MSK)

#define DMA_SPI3_SetAmount(d)           (DMA_SPI3_AMTH = HIBYTE(d), DMA_SPI3_AMT = LOBYTE(d))
#define DMA_SPI3_ReadDone()             MAKEWORD(DMA_SPI3_DONE, DMA_SPI3_DONEH)
#define DMA_SPI3_SetTxAddress(d)        (DMA_SPI3_TXAH = HIBYTE(d), DMA_SPI3_TXAL = LOBYTE(d))
#define DMA_SPI3_SetRxAddress(d)        (DMA_SPI3_RXAH = HIBYTE(d), DMA_SPI3_RXAL = LOBYTE(d))
#define DMA_SPI3_SetInterval(d)         (DMA_SPI3_ITVH = HIBYTE(d), DMA_SPI3_ITVL = LOBYTE(d))

/////////////////////////////////////////////////

#define DMALCMCFG_LCMPTY_MSK            (BIT1 | BIT0)
#define DMA_LCM_SetBusPriority(n)       MODIFY_REG(DMA_LCM_CFG,  DMALCMCFG_LCMPTY_MSK, ((n) << 0))

#define DMALCMCR_ENLCM_MSK              BIT7
#define DMA_LCM_Enable()                SET_REG_BIT(DMA_LCM_CR, DMALCMCR_ENLCM_MSK)
#define DMA_LCM_Disable()               CLR_REG_BIT(DMA_LCM_CR, DMALCMCR_ENLCM_MSK)

#define DMALCMCR_TRIGWC_MSK             BIT6
#define DMALCMCR_TRIGWD_MSK             BIT5
#define DMALCMCR_TRIGRC_MSK             BIT4
#define DMALCMCR_TRIGRD_MSK             BIT3
#define DMA_LCM_TriggerWriteCommand()   SET_REG_BIT(DMA_LCM_CR, DMALCMCR_TRIGWC_MSK)
#define DMA_LCM_TriggerWriteData()      SET_REG_BIT(DMA_LCM_CR, DMALCMCR_TRIGWD_MSK)
#define DMA_LCM_TriggerReadStatus()     SET_REG_BIT(DMA_LCM_CR, DMALCMCR_TRIGRC_MSK)
#define DMA_LCM_TriggerReadData()       SET_REG_BIT(DMA_LCM_CR, DMALCMCR_TRIGRD_MSK)

#define DMALCMSTA_TXOVW_MSK             BIT1
#define DMA_LCM_CheckOverWriteFlag()    READ_REG_BIT(DMA_LCM_STA,  DMALCMSTA_TXOVW_MSK)
#define DMA_LCM_ClearOverWriteFlag()    CLR_REG_BIT(DMA_LCM_STA,   DMALCMSTA_TXOVW_MSK)

#define DMA_LCM_SetAmount(d)            (DMA_LCM_AMTH = HIBYTE(d), DMA_LCM_AMT = LOBYTE(d))
#define DMA_LCM_ReadDone()              MAKEWORD(DMA_LCM_DONE, DMA_LCM_DONEH)
#define DMA_LCM_SetTxAddress(d)         (DMA_LCM_TXAH = HIBYTE(d), DMA_LCM_TXAL = LOBYTE(d))
#define DMA_LCM_SetRxAddress(d)         (DMA_LCM_RXAH = HIBYTE(d), DMA_LCM_RXAL = LOBYTE(d))
#define DMA_LCM_SetInterval(d)          (DMA_LCM_ITVH = HIBYTE(d), DMA_LCM_ITVL = LOBYTE(d))

/////////////////////////////////////////////////

#define DMAI2CTCFG_I2CTPTY_MSK          (BIT1 | BIT0)
#define DMAI2CRCFG_I2CRPTY_MSK          (BIT1 | BIT0)
#define DMA_I2C1_SetTxBusPriority(n)    MODIFY_REG(DMA_I2CT_CFG,  DMAI2CTCFG_I2CTPTY_MSK, ((n) << 0))
#define DMA_I2C1_SetRxBusPriority(n)    MODIFY_REG(DMA_I2CR_CFG,  DMAI2CRCFG_I2CRPTY_MSK, ((n) << 0))

