fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMAI2CTCR_ENI2CT_MSK            BIT7
#define DMAI2CRCR_ENI2CR_MSK            BIT7
#define DMA_I2C1_EnableTx()             SET_REG_BIT(DMA_I2CT_CR, DMAI2CTCR_ENI2CT_MSK)
#define DMA_I2C1_DisableTx()            CLR_REG_BIT(DMA_I2CT_CR, DMAI2CTCR_ENI2CT_MSK)
#define DMA_I2C1_EnableRx()             SET_REG_BIT(DMA_I2CR_CR, DMAI2CRCR_ENI2CR_MSK)
#define DMA_I2C1_DisableRx()            CLR_REG_BIT(DMA_I2CR_CR, DMAI2CRCR_ENI2CR_MSK)

#define DMAI2CTCR_TRIG_MSK              BIT6
#define DMAI2CRCR_TRIG_MSK              BIT6
#define DMA_I2C1_TriggerTx()            SET_REG_BIT(DMA_I2CT_CR, DMAI2CTCR_TRIG_MSK)
#define DMA_I2C1_TriggerRx()            SET_REG_BIT(DMA_I2CR_CR, DMAI2CRCR_TRIG_MSK)

#define DMAI2CRCR_CLRFIFO_MSK           BIT0
#define DMA_I2C1_ClearFIFO()            SET_REG_BIT(DMA_I2CR_CR, DMAI2CRCR_CLRFIFO_MSK)

#define DMAI2CTSTA_TXOVW_MSK            BIT2
#define DMA_I2C1_CheckOverWriteFlag()   READ_REG_BIT(DMA_I2CT_STA,  DMAI2CTSTA_TXOVW_MSK)
#define DMA_I2C1_ClearOverWriteFlag()   CLR_REG_BIT(DMA_I2CT_STA,   DMAI2CTSTA_TXOVW_MSK)

#define DMAI2CRSTA_RXLOSS_MSK           BIT1
#define DMA_I2C1_CheckRxLossFlag()      READ_REG_BIT(DMA_I2CR_STA,  DMAI2CRSTA_RXLOSS_MSK)
#define DMA_I2C1_ClearRxLossFlag()      CLR_REG_BIT(DMA_I2CR_STA,   DMAI2CRSTA_RXLOSS_MSK)

#define DMA_I2C1_SetTxAmount(d)         (DMA_I2CT_AMTH = HIBYTE(d), DMA_I2CT_AMT = LOBYTE(d))
#define DMA_I2C1_SetRxAmount(d)         (DMA_I2CR_AMTH = HIBYTE(d), DMA_I2CR_AMT = LOBYTE(d))
#define DMA_I2C1_ReadTxDone()           MAKEWORD(DMA_I2CT_DONE, DMA_I2CT_DONEH)
#define DMA_I2C1_ReadRxDone()           MAKEWORD(DMA_I2CR_DONE, DMA_I2CR_DONEH)
#define DMA_I2C1_SetTxAddress(d)        (DMA_I2CT_TXAH = HIBYTE(d), DMA_I2CT_TXAL = LOBYTE(d))
#define DMA_I2C1_SetRxAddress(d)        (DMA_I2CR_RXAH = HIBYTE(d), DMA_I2CR_RXAL = LOBYTE(d))
#define DMA_I2C1_SetInterval(d)         (DMA_I2C_ITVH = HIBYTE(d), DMA_I2C_ITVL = LOBYTE(d))

#define DMAI2CCR_RDSEL_MSK              BIT7
#define DMA_I2C1_ReadAmount()           CLR_REG_BIT(DMA_I2C_CR, DMAI2CCR_RDSEL_MSK)
#define DMA_I2C1_ReadDone()             SET_REG_BIT(DMA_I2C_CR, DMAI2CCR_RDSEL_MSK)

#define DMAI2CCR_ACKERR_MSK             BIT2
#define DMA_I2C1_CheckACK()             READ_REG_BIT(DMA_I2C_CR,  DMAI2CCR_ACKERR_MSK)

#define DMAI2CCR_ERRIE_MSK              BIT1
#define DMA_I2C1_EnableACKErrorInt()    SET_REG_BIT(DMA_I2C_CR, DMAI2CCR_ERRIE_MSK)
#define DMA_I2C1_DisableACKErrorInt()   CLR_REG_BIT(DMA_I2C_CR, DMAI2CCR_ERRIE_MSK)

#define DMAI2CCR_DMAEN_MSK              BIT0
#define DMA_I2C1_EnableDMA()            SET_REG_BIT(DMA_I2C_CR, DMAI2CCR_DMAEN_MSK)
#define DMA_I2C1_DisableDMA()           CLR_REG_BIT(DMA_I2C_CR, DMAI2CCR_DMAEN_MSK)

#define DMA_I2C1_SetDMAAmount(d)        (DMA_I2C_ST2 = HIBYTE(d), DMA_I2C_ST1 = LOBYTE(d))
#define DMA_I2C1_ReadDMAAmount()        MAKEWORD(DMA_I2C_ST1, DMA_I2C_ST2)
#define DMA_I2C1_ReadDMADone()          MAKEWORD(DMA_I2C_ST1, DMA_I2C_ST2)

////////////////////////

#define DMAI2C2TCFG_I2CTPTY_MSK         (BIT1 | BIT0)
#define DMAI2C2RCFG_I2CRPTY_MSK         (BIT1 | BIT0)
#define DMA_I2C2_SetTxBusPriority(n)    MODIFY_REG(DMA_I2C2T_CFG,  DMAI2C2TCFG_I2CTPTY_MSK, ((n) << 0))
#define DMA_I2C2_SetRxBusPriority(n)    MODIFY_REG(DMA_I2C2R_CFG,  DMAI2C2RCFG_I2CRPTY_MSK, ((n) << 0))

#define DMAI2C2TCR_ENI2CT_MSK           BIT7
#define DMAI2C2RCR_ENI2CR_MSK           BIT7
#define DMA_I2C2_EnableTx()             SET_REG_BIT(DMA_I2C2T_CR, DMAI2C2TCR_ENI2CT_MSK)
#define DMA_I2C2_DisableTx()            CLR_REG_BIT(DMA_I2C2T_CR, DMAI2C2TCR_ENI2CT_MSK)
#define DMA_I2C2_EnableRx()             SET_REG_BIT(DMA_I2C2R_CR, DMAI2C2RCR_ENI2CR_MSK)
#define DMA_I2C2_DisableRx()            CLR_REG_BIT(DMA_I2C2R_CR, DMAI2C2RCR_ENI2CR_MSK)

#define DMAI2C2TCR_TRIG_MSK             BIT6
#define DMAI2C2RCR_TRIG_MSK             BIT6
#define DMA_I2C2_TriggerTx()            SET_REG_BIT(DMA_I2C2T_CR, DMAI2C2TCR_TRIG_MSK)
#define DMA_I2C2_TriggerRx()            SET_REG_BIT(DMA_I2C2R_CR, DMAI2C2RCR_TRIG_MSK)

#define DMAI2C2RCR_CLRFIFO_MSK          BIT0
#define DMA_I2C2_ClearFIFO()            SET_REG_BIT(DMA_I2C2R_CR, DMAI2C2RCR_CLRFIFO_MSK)

#define DMAI2C2TSTA_TXOVW_MSK           BIT2
#define DMA_I2C2_CheckOverWriteFlag()   READ_REG_BIT(DMA_I2C2T_STA,  DMAI2C2TSTA_TXOVW_MSK)
#define DMA_I2C2_ClearOverWriteFlag()   CLR_REG_BIT(DMA_I2C2T_STA,   DMAI2C2TSTA_TXOVW_MSK)

#define DMAI2C2RSTA_RXLOSS_MSK          BIT1
#define DMA_I2C2_CheckRxLossFlag()      READ_REG_BIT(DMA_I2C2R_STA,  DMAI2C2RSTA_RXLOSS_MSK)
#define DMA_I2C2_ClearRxLossFlag()      CLR_REG_BIT(DMA_I2C2R_STA,   DMAI2C2RSTA_RXLOSS_MSK)

#define DMA_I2C2_SetTxAmount(d)         (DMA_I2C2T_AMTH = HIBYTE(d), DMA_I2C2T_AMT = LOBYTE(d))
#define DMA_I2C2_SetRxAmount(d)         (DMA_I2C2R_AMTH = HIBYTE(d), DMA_I2C2R_AMT = LOBYTE(d))
#define DMA_I2C2_ReadTxDone()           MAKEWORD(DMA_I2C2T_DONE, DMA_I2C2T_DONEH)
#define DMA_I2C2_ReadRxDone()           MAKEWORD(DMA_I2C2R_DONE, DMA_I2C2R_DONEH)
#define DMA_I2C2_SetTxAddress(d)        (DMA_I2C2T_TXAH = HIBYTE(d), DMA_I2C2T_TXAL = LOBYTE(d))
#define DMA_I2C2_SetRxAddress(d)        (DMA_I2C2R_RXAH = HIBYTE(d), DMA_I2C2R_RXAL = LOBYTE(d))
#define DMA_I2C2_SetInterval(d)         (DMA_I2C2_ITVH = HIBYTE(d), DMA_I2C2_ITVL = LOBYTE(d))

#define DMAI2C2CR_RDSEL_MSK             BIT7
#define DMA_I2C2_ReadAmount()           CLR_REG_BIT(DMA_I2C2_CR, DMAI2C2CR_RDSEL_MSK)
#define DMA_I2C2_ReadDone()             SET_REG_BIT(DMA_I2C2_CR, DMAI2C2CR_RDSEL_MSK)

#define DMAI2C2CR_ACKERR_MSK            BIT2
#define DMA_I2C2_CheckACK()             READ_REG_BIT(DMA_I2C2_CR,  DMAI2C2CR_ACKERR_MSK)

#define DMAI2C2CR_ERRIE_MSK             BIT1
#define DMA_I2C2_EnableACKErrorInt()    SET_REG_BIT(DMA_I2C2_CR, DMAI2C2CR_ERRIE_MSK)
#define DMA_I2C2_DisableACKErrorInt()   CLR_REG_BIT(DMA_I2C2_CR, DMAI2C2CR_ERRIE_MSK)

#define DMAI2C2CR_DMAEN_MSK             BIT0
#define DMA_I2C2_EnableDMA()            SET_REG_BIT(DMA_I2C2_CR, DMAI2C2CR_DMAEN_MSK)
#define DMA_I2C2_DisableDMA()           CLR_REG_BIT(DMA_I2C2_CR, DMAI2C2CR_DMAEN_MSK)

#define DMA_I2C2_SetDMAAmount(d)        (DMA_I2C2_ST2 = HIBYTE(d), DMA_I2C2_ST1 = LOBYTE(d))
#define DMA_I2C2_ReadDMAAmount()        MAKEWORD(DMA_I2C2_ST1, DMA_I2C2_ST2)
#define DMA_I2C2_ReadDMADone()          MAKEWORD(DMA_I2C2_ST1, DMA_I2C2_ST2)

/////////////////////////////////////////////////

#define DMAI2STCFG_I2STPTY_MSK          (BIT1 | BIT0)
#define DMAI2SRCFG_I2SRPTY_MSK          (BIT1 | BIT0)
#define DMA_I2S1_SetTxBusPriority(n)    MODIFY_REG(DMA_I2ST_CFG,  DMAI2STCFG_I2STPTY_MSK, ((n) << 0))
#define DMA_I2S1_SetRxBusPriority(n)    MODIFY_REG(DMA_I2SR_CFG,  DMAI2SRCFG_I2SRPTY_MSK, ((n) << 0))

#define DMAI2STCR_ENI2ST_MSK            BIT7
#define DMAI2SRCR_ENI2SR_MSK            BIT7
#define DMA_I2S1_EnableTx()             SET_REG_BIT(DMA_I2ST_CR, DMAI2STCR_ENI2ST_MSK)
#define DMA_I2S1_DisableTx()            CLR_REG_BIT(DMA_I2ST_CR, DMAI2STCR_ENI2ST_MSK)
#define DMA_I2S1_EnableRx()             SET_REG_BIT(DMA_I2SR_CR, DMAI2SRCR_ENI2SR_MSK)
#define DMA_I2S1_DisableRx()            CLR_REG_BIT(DMA_I2SR_CR, DMAI2SRCR_ENI2SR_MSK)

#define DMAI2STCR_TRIG_MSK              BIT6
#define DMAI2SRCR_TRIG_MSK              BIT6
#define DMA_I2S1_TriggerTx()            SET_REG_BIT(DMA_I2ST_CR, DMAI2STCR_TRIG_MSK)
#define DMA_I2S1_TriggerRx()            SET_REG_BIT(DMA_I2SR_CR, DMAI2SRCR_TRIG_MSK)

