fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMAI2SRCR_CLRFIFO_MSK           BIT0
#define DMA_I2S1_ClearFIFO()            SET_REG_BIT(DMA_I2SR_CR, DMAI2SRCR_CLRFIFO_MSK)

#define DMAI2STSTA_TXOVW_MSK            BIT2
#define DMA_I2S1_CheckOverWriteFlag()   READ_REG_BIT(DMA_I2ST_STA,  DMAI2STSTA_TXOVW_MSK)
#define DMA_I2S1_ClearOverWriteFlag()   CLR_REG_BIT(DMA_I2ST_STA,   DMAI2STSTA_TXOVW_MSK)

#define DMAI2SRSTA_RXLOSS_MSK           BIT1
#define DMA_I2S1_CheckRxLossFlag()      READ_REG_BIT(DMA_I2SR_STA,  DMAI2SRSTA_RXLOSS_MSK)
#define DMA_I2S1_ClearRxLossFlag()      CLR_REG_BIT(DMA_I2SR_STA,   DMAI2SRSTA_RXLOSS_MSK)

#define DMA_I2S1_SetTxAmount(d)         (DMA_I2ST_AMTH = HIBYTE(d), DMA_I2ST_AMT = LOBYTE(d))
#define DMA_I2S1_SetRxAmount(d)         (DMA_I2SR_AMTH = HIBYTE(d), DMA_I2SR_AMT = LOBYTE(d))
#define DMA_I2S1_ReadTxDone()           MAKEWORD(DMA_I2ST_DONE, DMA_I2ST_DONEH)
#define DMA_I2S1_ReadRxDone()           MAKEWORD(DMA_I2SR_DONE, DMA_I2SR_DONEH)
#define DMA_I2S1_SetTxAddress(d)        (DMA_I2ST_TXAH = HIBYTE(d), DMA_I2ST_TXAL = LOBYTE(d))
#define DMA_I2S1_SetRxAddress(d)        (DMA_I2SR_RXAH = HIBYTE(d), DMA_I2SR_RXAL = LOBYTE(d))
#define DMA_I2S1_SetInterval(d)         (DMA_I2S_ITVH = HIBYTE(d), DMA_I2S_ITVL = LOBYTE(d))

////////////////////////

#define DMAI2S2TCFG_I2STPTY_MSK         (BIT1 | BIT0)
#define DMAI2S2RCFG_I2SRPTY_MSK         (BIT1 | BIT0)
#define DMA_I2S2_SetTxBusPriority(n)    MODIFY_REG(DMA_I2S2T_CFG,  DMAI2S2TCFG_I2STPTY_MSK, ((n) << 0))
#define DMA_I2S2_SetRxBusPriority(n)    MODIFY_REG(DMA_I2S2R_CFG,  DMAI2S2RCFG_I2SRPTY_MSK, ((n) << 0))

#define DMAI2S2TCR_ENI2ST_MSK           BIT7
#define DMAI2S2RCR_ENI2SR_MSK           BIT7
#define DMA_I2S2_EnableTx()             SET_REG_BIT(DMA_I2S2T_CR, DMAI2S2TCR_ENI2ST_MSK)
#define DMA_I2S2_DisableTx()            CLR_REG_BIT(DMA_I2S2T_CR, DMAI2S2TCR_ENI2ST_MSK)
#define DMA_I2S2_EnableRx()             SET_REG_BIT(DMA_I2S2R_CR, DMAI2S2RCR_ENI2SR_MSK)
#define DMA_I2S2_DisableRx()            CLR_REG_BIT(DMA_I2S2R_CR, DMAI2S2RCR_ENI2SR_MSK)

#define DMAI2S2TCR_TRIG_MSK             BIT6
#define DMAI2S2RCR_TRIG_MSK             BIT6
#define DMA_I2S2_TriggerTx()            SET_REG_BIT(DMA_I2S2T_CR, DMAI2S2TCR_TRIG_MSK)
#define DMA_I2S2_TriggerRx()            SET_REG_BIT(DMA_I2S2R_CR, DMAI2S2RCR_TRIG_MSK)

#define DMAI2S2RCR_CLRFIFO_MSK          BIT0
#define DMA_I2S2_ClearFIFO()            SET_REG_BIT(DMA_I2S2R_CR, DMAI2S2RCR_CLRFIFO_MSK)

#define DMAI2S2TSTA_TXOVW_MSK           BIT2
#define DMA_I2S2_CheckOverWriteFlag()   READ_REG_BIT(DMA_I2S2T_STA,  DMAI2S2TSTA_TXOVW_MSK)
#define DMA_I2S2_ClearOverWriteFlag()   CLR_REG_BIT(DMA_I2S2T_STA,   DMAI2S2TSTA_TXOVW_MSK)

#define DMAI2S2RSTA_RXLOSS_MSK          BIT1
#define DMA_I2S2_CheckRxLossFlag()      READ_REG_BIT(DMA_I2S2R_STA,  DMAI2S2RSTA_RXLOSS_MSK)
#define DMA_I2S2_ClearRxLossFlag()      CLR_REG_BIT(DMA_I2S2R_STA,   DMAI2S2RSTA_RXLOSS_MSK)

#define DMA_I2S2_SetTxAmount(d)         (DMA_I2S2T_AMTH = HIBYTE(d), DMA_I2S2T_AMT = LOBYTE(d))
#define DMA_I2S2_SetRxAmount(d)         (DMA_I2S2R_AMTH = HIBYTE(d), DMA_I2S2R_AMT = LOBYTE(d))
#define DMA_I2S2_ReadTxDone()           MAKEWORD(DMA_I2S2T_DONE, DMA_I2S2T_DONEH)
#define DMA_I2S2_ReadRxDone()           MAKEWORD(DMA_I2S2R_DONE, DMA_I2S2R_DONEH)
#define DMA_I2S2_SetTxAddress(d)        (DMA_I2S2T_TXAH = HIBYTE(d), DMA_I2S2T_TXAL = LOBYTE(d))
#define DMA_I2S2_SetRxAddress(d)        (DMA_I2S2R_RXAH = HIBYTE(d), DMA_I2S2R_RXAL = LOBYTE(d))
#define DMA_I2S2_SetInterval(d)         (DMA_I2S2_ITVH = HIBYTE(d), DMA_I2S2_ITVL = LOBYTE(d))

/////////////////////////////////////////////////

#define DMAQSPICFG_ACTWR_MSK            BIT6
#define DMAQSPICFG_ACTRD_MSK            BIT5
#define DMA_QSPI_EnableWrite()          SET_REG_BIT(DMA_QSPI_CFG, DMAQSPICFG_ACTWR_MSK)
#define DMA_QSPI_DisableWrite()         CLR_REG_BIT(DMA_QSPI_CFG, DMAQSPICFG_ACTWR_MSK)
#define DMA_QSPI_EnableRead()           SET_REG_BIT(DMA_QSPI_CFG, DMAQSPICFG_ACTRD_MSK)
#define DMA_QSPI_DisableRead()          CLR_REG_BIT(DMA_QSPI_CFG, DMAQSPICFG_ACTRD_MSK)

#define DMAQSPICFG_QSPIPTY_MSK          (BIT1 | BIT0)
#define DMA_QSPI_SetBusPriority(n)      MODIFY_REG(DMA_QSPI_CFG,  DMAQSPICFG_QSPIPTY_MSK, ((n) << 0))

#define DMAQSPICR_ENQSPI_MSK            BIT7
#define DMA_QSPI_Enable()               SET_REG_BIT(DMA_QSPI_CR, DMAQSPICR_ENQSPI_MSK)
#define DMA_QSPI_Disable()              CLR_REG_BIT(DMA_QSPI_CR, DMAQSPICR_ENQSPI_MSK)

#define DMAQSPICR_TRIGW_MSK             BIT6
#define DMAQSPICR_TRIGR_MSK             BIT5
#define DMA_QSPI_TriggerWrite()         SET_REG_BIT(DMA_QSPI_CR, DMAQSPICR_TRIGW_MSK)
#define DMA_QSPI_TriggerRead()          SET_REG_BIT(DMA_QSPI_CR, DMAQSPICR_TRIGR_MSK)

#define DMAQSPICR_CLRRFIFO_MSK          BIT0
#define DMAQSPICR_CLRWFIFO_MSK          BIT1
#define DMA_QSPI_ClearReadFIFO()        SET_REG_BIT(DMA_QSPI_CR, DMAQSPICR_CLRRFIFO_MSK)
#define DMA_QSPI_ClearWriteFIFO()       SET_REG_BIT(DMA_QSPI_CR, DMAQSPICR_CLRWFIFO_MSK)

#define DMA_QSPI_SetAmount(d)           (DMA_QSPI_AMTH = HIBYTE(d), DMA_QSPI_AMT = LOBYTE(d))
#define DMA_QSPI_ReadDone()             MAKEWORD(DMA_QSPI_DONE, DMA_QSPI_DONEH)
#define DMA_QSPI_SetTxAddress(d)        (DMA_QSPI_TXAH = HIBYTE(d), DMA_QSPI_TXAL = LOBYTE(d))
#define DMA_QSPI_SetRxAddress(d)        (DMA_QSPI_RXAH = HIBYTE(d), DMA_QSPI_RXAL = LOBYTE(d))
#define DMA_QSPI_SetInterval(d)         (DMA_QSPI_ITVH = HIBYTE(d), DMA_QSPI_ITVL = LOBYTE(d))

/////////////////////////////////////////////////

#define DMAPWMATCFG_PWMATPTY_MSK        (BIT1 | BIT0)
#define DMAPWMARCFG_PWMARPTY_MSK        (BIT1 | BIT0)
#define DMA_PWMA_SetTxBusPriority(n)    MODIFY_REG(DMA_PWMAT_CFG,  DMAPWMATCFG_PWMATPTY_MSK, ((n) << 0))
#define DMA_PWMA_SetRxBusPriority(n)    MODIFY_REG(DMA_PWMAR_CFG,  DMAPWMARCFG_PWMARPTY_MSK, ((n) << 0))

#define DMAPWMATCR_ENPWMAT_MSK          BIT7
#define DMAPWMARCR_ENPWMAR_MSK          BIT7
#define DMA_PWMA_EnableTx()             SET_REG_BIT(DMA_PWMAT_CR, DMAPWMATCR_ENPWMAT_MSK)
#define DMA_PWMA_DisableTx()            CLR_REG_BIT(DMA_PWMAT_CR, DMAPWMATCR_ENPWMAT_MSK)
#define DMA_PWMA_EnableRx()             SET_REG_BIT(DMA_PWMAR_CR, DMAPWMARCR_ENPWMAR_MSK)
#define DMA_PWMA_DisableRx()            CLR_REG_BIT(DMA_PWMAR_CR, DMAPWMARCR_ENPWMAR_MSK)

