fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMAPWMATCR_TRIG_MSK             BIT6
#define DMAPWMARCR_TRIG_MSK             BIT6
#define DMA_PWMA_TriggerTx()            SET_REG_BIT(DMA_PWMAT_CR, DMAPWMATCR_TRIG_MSK)
#define DMA_PWMA_TriggerRx()            SET_REG_BIT(DMA_PWMAR_CR, DMAPWMARCR_TRIG_MSK)

#define DMAPWMARCR_CLRFIFO_MSK          BIT0
#define DMA_PWMA_ClearFIFO()            SET_REG_BIT(DMA_PWMAR_CR, DMAPWMARCR_CLRFIFO_MSK)

#define DMAPWMATSTA_TXOVW_MSK           BIT2
#define DMA_PWMA_CheckOverWriteFlag()   READ_REG_BIT(DMA_PWMAT_STA,  DMAPWMATSTA_TXOVW_MSK)
#define DMA_PWMA_ClearOverWriteFlag()   CLR_REG_BIT(DMA_PWMAT_STA,   DMAPWMATSTA_TXOVW_MSK)

#define DMAPWMARSTA_RXLOSS_MSK          BIT1
#define DMA_PWMA_CheckRxLossFlag()      READ_REG_BIT(DMA_PWMAR_STA,  DMAPWMARSTA_RXLOSS_MSK)
#define DMA_PWMA_ClearRxLossFlag()      CLR_REG_BIT(DMA_PWMAR_STA,   DMAPWMARSTA_RXLOSS_MSK)

#define DMA_PWMA_SetTxAmount(d)         (DMA_PWMAT_AMTH = HIBYTE(d), DMA_PWMAT_AMT = LOBYTE(d))
#define DMA_PWMA_SetRxAmount(d)         (DMA_PWMAR_AMTH = HIBYTE(d), DMA_PWMAR_AMT = LOBYTE(d))
#define DMA_PWMA_ReadTxDone()           MAKEWORD(DMA_PWMAT_DONE, DMA_PWMAT_DONEH)
#define DMA_PWMA_ReadRxDone()           MAKEWORD(DMA_PWMAR_DONE, DMA_PWMAR_DONEH)
#define DMA_PWMA_SetTxAddress(d)        (DMA_PWMAT_TXAH = HIBYTE(d), DMA_PWMAT_TXAL = LOBYTE(d))
#define DMA_PWMA_SetRxAddress(d)        (DMA_PWMAR_RXAH = HIBYTE(d), DMA_PWMAR_RXAL = LOBYTE(d))
#define DMA_PWMA_SetInterval(d)         (DMA_PWMA_ITVH = HIBYTE(d), DMA_PWMA_ITVL = LOBYTE(d))

////////////////////////

#define DMAPWMCTCFG_PWMCTPTY_MSK        (BIT1 | BIT0)
#define DMAPWMCRCFG_PWMCRPTY_MSK        (BIT1 | BIT0)
#define DMA_PWMC_SetTxBusPriority(n)    MODIFY_REG(DMA_PWMCT_CFG,  DMAPWMCTCFG_PWMCTPTY_MSK, ((n) << 0))
#define DMA_PWMC_SetRxBusPriority(n)    MODIFY_REG(DMA_PWMCR_CFG,  DMAPWMCRCFG_PWMCRPTY_MSK, ((n) << 0))

#define DMAPWMCTCR_ENPWMCT_MSK          BIT7
#define DMAPWMCRCR_ENPWMCR_MSK          BIT7
#define DMA_PWMC_EnableTx()             SET_REG_BIT(DMA_PWMCT_CR, DMAPWMCTCR_ENPWMCT_MSK)
#define DMA_PWMC_DisableTx()            CLR_REG_BIT(DMA_PWMCT_CR, DMAPWMCTCR_ENPWMCT_MSK)
#define DMA_PWMC_EnableRx()             SET_REG_BIT(DMA_PWMCR_CR, DMAPWMCRCR_ENPWMCR_MSK)
#define DMA_PWMC_DisableRx()            CLR_REG_BIT(DMA_PWMCR_CR, DMAPWMCRCR_ENPWMCR_MSK)

#define DMAPWMCTCR_TRIG_MSK             BIT6
#define DMAPWMCRCR_TRIG_MSK             BIT6
#define DMA_PWMC_TriggerTx()            SET_REG_BIT(DMA_PWMCT_CR, DMAPWMCTCR_TRIG_MSK)
#define DMA_PWMC_TriggerRx()            SET_REG_BIT(DMA_PWMCR_CR, DMAPWMCRCR_TRIG_MSK)

#define DMAPWMCRCR_CLRFIFO_MSK          BIT0
#define DMA_PWMC_ClearFIFO()            SET_REG_BIT(DMA_PWMCR_CR, DMAPWMCRCR_CLRFIFO_MSK)

#define DMAPWMCTSTA_TXOVW_MSK           BIT2
#define DMA_PWMC_CheckOverWriteFlag()   READ_REG_BIT(DMA_PWMCT_STA,  DMAPWMCTSTA_TXOVW_MSK)
#define DMA_PWMC_ClearOverWriteFlag()   CLR_REG_BIT(DMA_PWMCT_STA,   DMAPWMCTSTA_TXOVW_MSK)

#define DMAPWMCRSTA_RXLOSS_MSK          BIT1
#define DMA_PWMC_CheckRxLossFlag()      READ_REG_BIT(DMA_PWMCR_STA,  DMAPWMCRSTA_RXLOSS_MSK)
#define DMA_PWMC_ClearRxLossFlag()      CLR_REG_BIT(DMA_PWMCR_STA,   DMAPWMCRSTA_RXLOSS_MSK)

#define DMA_PWMC_SetTxAmount(d)         (DMA_PWMCT_AMTH = HIBYTE(d), DMA_PWMCT_AMT = LOBYTE(d))
#define DMA_PWMC_SetRxAmount(d)         (DMA_PWMCR_AMTH = HIBYTE(d), DMA_PWMCR_AMT = LOBYTE(d))
#define DMA_PWMC_ReadTxDone()           MAKEWORD(DMA_PWMCT_DONE, DMA_PWMCT_DONEH)
#define DMA_PWMC_ReadRxDone()           MAKEWORD(DMA_PWMCR_DONE, DMA_PWMCR_DONEH)
#define DMA_PWMC_SetTxAddress(d)        (DMA_PWMCT_TXAH = HIBYTE(d), DMA_PWMCT_TXAL = LOBYTE(d))
#define DMA_PWMC_SetRxAddress(d)        (DMA_PWMCR_RXAH = HIBYTE(d), DMA_PWMCR_RXAL = LOBYTE(d))
#define DMA_PWMC_SetInterval(d)         (DMA_PWMC_ITVH = HIBYTE(d), DMA_PWMC_ITVL = LOBYTE(d))

////////////////////////

#define DMAPWMETCFG_PWMETPTY_MSK        (BIT1 | BIT0)
#define DMAPWMERCFG_PWMERPTY_MSK        (BIT1 | BIT0)
#define DMA_PWME_SetTxBusPriority(n)    MODIFY_REG(DMA_PWMET_CFG,  DMAPWMETCFG_PWMETPTY_MSK, ((n) << 0))
#define DMA_PWME_SetRxBusPriority(n)    MODIFY_REG(DMA_PWMER_CFG,  DMAPWMERCFG_PWMERPTY_MSK, ((n) << 0))

#define DMAPWMETCR_ENPWMET_MSK          BIT7
#define DMAPWMERCR_ENPWMER_MSK          BIT7
#define DMA_PWME_EnableTx()             SET_REG_BIT(DMA_PWMET_CR, DMAPWMETCR_ENPWMET_MSK)
#define DMA_PWME_DisableTx()            CLR_REG_BIT(DMA_PWMET_CR, DMAPWMETCR_ENPWMET_MSK)
#define DMA_PWME_EnableRx()             SET_REG_BIT(DMA_PWMER_CR, DMAPWMERCR_ENPWMER_MSK)
#define DMA_PWME_DisableRx()            CLR_REG_BIT(DMA_PWMER_CR, DMAPWMERCR_ENPWMER_MSK)

#define DMAPWMETCR_TRIG_MSK             BIT6
#define DMAPWMERCR_TRIG_MSK             BIT6
#define DMA_PWME_TriggerTx()            SET_REG_BIT(DMA_PWMET_CR, DMAPWMETCR_TRIG_MSK)
#define DMA_PWME_TriggerRx()            SET_REG_BIT(DMA_PWMER_CR, DMAPWMERCR_TRIG_MSK)

#define DMAPWMERCR_CLRFIFO_MSK          BIT0
#define DMA_PWME_ClearFIFO()            SET_REG_BIT(DMA_PWMER_CR, DMAPWMERCR_CLRFIFO_MSK)

#define DMAPWMETSTA_TXOVW_MSK           BIT2
#define DMA_PWME_CheckOverWriteFlag()   READ_REG_BIT(DMA_PWMET_STA,  DMAPWMETSTA_TXOVW_MSK)
#define DMA_PWME_ClearOverWriteFlag()   CLR_REG_BIT(DMA_PWMET_STA,   DMAPWMETSTA_TXOVW_MSK)

#define DMAPWMERSTA_RXLOSS_MSK          BIT1
#define DMA_PWME_CheckRxLossFlag()      READ_REG_BIT(DMA_PWMER_STA,  DMAPWMERSTA_RXLOSS_MSK)
#define DMA_PWME_ClearRxLossFlag()      CLR_REG_BIT(DMA_PWMER_STA,   DMAPWMERSTA_RXLOSS_MSK)

#define DMA_PWME_SetTxAmount(d)         (DMA_PWMET_AMTH = HIBYTE(d), DMA_PWMET_AMT = LOBYTE(d))
#define DMA_PWME_SetRxAmount(d)         (DMA_PWMER_AMTH = HIBYTE(d), DMA_PWMER_AMT = LOBYTE(d))
#define DMA_PWME_ReadTxDone()           MAKEWORD(DMA_PWMET_DONE, DMA_PWMET_DONEH)
#define DMA_PWME_ReadRxDone()           MAKEWORD(DMA_PWMER_DONE, DMA_PWMER_DONEH)
#define DMA_PWME_SetTxAddress(d)        (DMA_PWMET_TXAH = HIBYTE(d), DMA_PWMET_TXAL = LOBYTE(d))
#define DMA_PWME_SetRxAddress(d)        (DMA_PWMER_RXAH = HIBYTE(d), DMA_PWMER_RXAL = LOBYTE(d))
#define DMA_PWME_SetInterval(d)         (DMA_PWME_ITVH = HIBYTE(d), DMA_PWME_ITVL = LOBYTE(d))

/////////////////////////////////////////////////

#define DMADAC1CFG_DAC1PTY_MSK          (BIT1 | BIT0)
#define DMA_DAC1_SetBusPriority(n)      MODIFY_REG(DMA_DAC1_CFG,  DMADAC1CFG_DAC1PTY_MSK, ((n) << 0))

