fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMADAC1CR_ENDAC1_MSK            BIT7
#define DMA_DAC1_Enable()               SET_REG_BIT(DMA_DAC1_CR, DMADAC1CR_ENDAC1_MSK)
#define DMA_DAC1_Disable()              CLR_REG_BIT(DMA_DAC1_CR, DMADAC1CR_ENDAC1_MSK)

#define DMADAC1CR_TRIG_MSK              BIT6
#define DMA_DAC1_Trigger()              SET_REG_BIT(DMA_DAC1_CR, DMADAC1CR_TRIG_MSK)

#define DMA_DAC1_SetAmount(d)           (DMA_DAC1_AMTH = HIBYTE(d), DMA_DAC1_AMT = LOBYTE(d))
#define DMA_DAC1_ReadDone()             MAKEWORD(DMA_DAC1_DONE, DMA_DAC1_DONEH)
#define DMA_DAC1_SetAddress(d)          (DMA_DAC1_TXAH = HIBYTE(d), DMA_DAC1_TXAL = LOBYTE(d))
#define DMA_DAC1_SetInterval(d)         (DMA_DAC1_ITVH = HIBYTE(d), DMA_DAC1_ITVL = LOBYTE(d))

////////////////////////

#define DMADAC2CFG_DAC2PTY_MSK          (BIT1 | BIT0)
#define DMA_DAC2_SetBusPriority(n)      MODIFY_REG(DMA_DAC2_CFG,  DMADAC2CFG_DAC2PTY_MSK, ((n) << 0))

#define DMADAC2CR_ENDAC2_MSK            BIT7
#define DMA_DAC2_Enable()               SET_REG_BIT(DMA_DAC2_CR, DMADAC2CR_ENDAC2_MSK)
#define DMA_DAC2_Disable()              CLR_REG_BIT(DMA_DAC2_CR, DMADAC2CR_ENDAC2_MSK)

#define DMADAC2CR_TRIG_MSK              BIT6
#define DMA_DAC2_Trigger()              SET_REG_BIT(DMA_DAC2_CR, DMADAC2CR_TRIG_MSK)

#define DMA_DAC2_SetAmount(d)           (DMA_DAC2_AMTH = HIBYTE(d), DMA_DAC2_AMT = LOBYTE(d))
#define DMA_DAC2_ReadDone()             MAKEWORD(DMA_DAC2_DONE, DMA_DAC2_DONEH)
#define DMA_DAC2_SetAddress(d)          (DMA_DAC2_TXAH = HIBYTE(d), DMA_DAC2_TXAL = LOBYTE(d))
#define DMA_DAC2_SetInterval(d)         (DMA_DAC2_ITVH = HIBYTE(d), DMA_DAC2_ITVL = LOBYTE(d))

/////////////////////////////////////////////////

#define DMACAN1TCFG_CAN1TPTY_MSK        (BIT1 | BIT0)
#define DMACAN2TCFG_CAN2TPTY_MSK        (BIT1 | BIT0)
#define DMA_CAN1_SetTxBusPriority(n)    MODIFY_REG(DMA_CAN1T_CFG,  DMACAN1TCFG_CAN1TPTY_MSK, ((n) << 0))
#define DMA_CAN2_SetTxBusPriority(n)    MODIFY_REG(DMA_CAN2T_CFG,  DMACAN2TCFG_CAN2TPTY_MSK, ((n) << 0))

#define DMACAN1RCFG_CAN1RPTY_MSK        (BIT1 | BIT0)
#define DMACAN2RCFG_CAN2RPTY_MSK        (BIT1 | BIT0)
#define DMA_CAN1_SetRxBusPriority(n)    MODIFY_REG(DMA_CAN1R_CFG,  DMACAN1RCFG_CAN1RPTY_MSK, ((n) << 0))
#define DMA_CAN2_SetRxBusPriority(n)    MODIFY_REG(DMA_CAN2R_CFG,  DMACAN2RCFG_CAN2RPTY_MSK, ((n) << 0))

#define DMACAN1TCFG_TADRALIGN_MSK       BIT5
#define DMACAN2TCFG_TADRALIGN_MSK       BIT5
#define DMA_CAN1_TxDataAlign()          SET_REG_BIT(DMA_CAN1T_CFG, DMACAN1TCFG_TADRALIGN_MSK)
#define DMA_CAN2_TxDataAlign()          SET_REG_BIT(DMA_CAN2T_CFG, DMACAN2TCFG_TADRALIGN_MSK)
#define DMA_CAN1_TxDataContinue()       CLR_REG_BIT(DMA_CAN1T_CFG, DMACAN1TCFG_TADRALIGN_MSK)
#define DMA_CAN2_TxDataContinue()       CLR_REG_BIT(DMA_CAN2T_CFG, DMACAN2TCFG_TADRALIGN_MSK)

#define DMACAN1TCFG_TXBW_MSK            BIT4
#define DMACAN2TCFG_TXBW_MSK            BIT4
#define DMA_CAN1_Tx8BitWidth()          CLR_REG_BIT(DMA_CAN1T_CFG, DMACAN1TCFG_TXBW_MSK)
#define DMA_CAN2_Tx8BitWidth()          CLR_REG_BIT(DMA_CAN2T_CFG, DMACAN2TCFG_TXBW_MSK)
#define DMA_CAN1_Tx32BitWidth()         SET_REG_BIT(DMA_CAN1T_CFG, DMACAN1TCFG_TXBW_MSK)
#define DMA_CAN2_Tx32BitWidth()         SET_REG_BIT(DMA_CAN2T_CFG, DMACAN2TCFG_TXBW_MSK)

#define DMACAN1RCFG_RAMTALIGN_MSK       BIT6
#define DMACAN2RCFG_RAMTALIGN_MSK       BIT6
#define DMA_CAN1_RxAmountAlign()        CLR_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_RAMTALIGN_MSK)
#define DMA_CAN2_RxAmountAlign()        CLR_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_RAMTALIGN_MSK)
#define DMA_CAN1_RxDoneAlign()          SET_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_RAMTALIGN_MSK)
#define DMA_CAN2_RxDoneAlign()          SET_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_RAMTALIGN_MSK)

#define DMACAN1RCFG_RADRALIGN_MSK       BIT5
#define DMACAN2RCFG_RADRALIGN_MSK       BIT5
#define DMA_CAN1_RxDataAlign()          SET_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_RADRALIGN_MSK)
#define DMA_CAN2_RxDataAlign()          SET_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_RADRALIGN_MSK)
#define DMA_CAN1_RxDataContinue()       CLR_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_RADRALIGN_MSK)
#define DMA_CAN2_RxDataContinue()       CLR_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_RADRALIGN_MSK)

#define DMACAN1RCFG_RXBW_MSK            BIT4
#define DMACAN2RCFG_RXBW_MSK            BIT4
#define DMA_CAN1_Rx8BitWidth()          CLR_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_RXBW_MSK)
#define DMA_CAN2_Rx8BitWidth()          CLR_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_RXBW_MSK)
#define DMA_CAN1_Rx32BitWidth()         SET_REG_BIT(DMA_CAN1R_CFG, DMACAN1RCFG_RXBW_MSK)
#define DMA_CAN2_Rx32BitWidth()         SET_REG_BIT(DMA_CAN2R_CFG, DMACAN2RCFG_RXBW_MSK)

#define DMACAN1TCR_ENCAN1T_MSK          BIT7
#define DMACAN2TCR_ENCAN2T_MSK          BIT7
#define DMA_CAN1_EnableTx()             SET_REG_BIT(DMA_CAN1T_CR, DMACAN1TCR_ENCAN1T_MSK)
#define DMA_CAN2_EnableTx()             SET_REG_BIT(DMA_CAN2T_CR, DMACAN2TCR_ENCAN2T_MSK)
#define DMA_CAN1_DisableTx()            CLR_REG_BIT(DMA_CAN1T_CR, DMACAN1TCR_ENCAN1T_MSK)
#define DMA_CAN2_DisableTx()            CLR_REG_BIT(DMA_CAN2T_CR, DMACAN2TCR_ENCAN2T_MSK)

#define DMACAN1RCR_ENCAN1R_MSK          BIT7
#define DMACAN2RCR_ENCAN2R_MSK          BIT7
#define DMA_CAN1_EnableRx()             SET_REG_BIT(DMA_CAN1R_CR, DMACAN1RCR_ENCAN1R_MSK)
#define DMA_CAN2_EnableRx()             SET_REG_BIT(DMA_CAN2R_CR, DMACAN2RCR_ENCAN2R_MSK)
#define DMA_CAN1_DisableRx()            CLR_REG_BIT(DMA_CAN1R_CR, DMACAN1RCR_ENCAN1R_MSK)
#define DMA_CAN2_DisableRx()            CLR_REG_BIT(DMA_CAN2R_CR, DMACAN2RCR_ENCAN2R_MSK)

#define DMACAN1TCR_TRIG_MSK             BIT6
#define DMACAN2TCR_TRIG_MSK             BIT6
#define DMA_CAN1_TriggerTx()            SET_REG_BIT(DMA_CAN1T_CR, DMACAN1TCR_TRIG_MSK)
#define DMA_CAN2_TriggerTx()            SET_REG_BIT(DMA_CAN2T_CR, DMACAN2TCR_TRIG_MSK)

#define DMACAN1RCR_TRIG_MSK             BIT6
#define DMACAN2RCR_TRIG_MSK             BIT6
#define DMA_CAN1_TriggerRx()            SET_REG_BIT(DMA_CAN1R_CR, DMACAN1RCR_TRIG_MSK)
#define DMA_CAN2_TriggerRx()            SET_REG_BIT(DMA_CAN2R_CR, DMACAN2RCR_TRIG_MSK)

