fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMACAN1RCR_CLRFIFO_MSK          BIT0
#define DMACAN2RCR_CLRFIFO_MSK          BIT0
#define DMA_CAN1_ClearFIFO()            SET_REG_BIT(DMA_CAN1R_CR, DMACAN1RCR_CLRFIFO_MSK)
#define DMA_CAN2_ClearFIFO()            SET_REG_BIT(DMA_CAN2R_CR, DMACAN2RCR_CLRFIFO_MSK)

#define DMACAN1TSTA_TXOVW_MSK           BIT2
#define DMACAN2TSTA_TXOVW_MSK           BIT2
#define DMA_CAN1_CheckOverWriteFlag()   READ_REG_BIT(DMA_CAN1T_STA,  DMACAN1TSTA_TXOVW_MSK)
#define DMA_CAN2_CheckOverWriteFlag()   READ_REG_BIT(DMA_CAN2T_STA,  DMACAN2TSTA_TXOVW_MSK)
#define DMA_CAN1_ClearOverWriteFlag()   CLR_REG_BIT(DMA_CAN1T_STA,   DMACAN1TSTA_TXOVW_MSK)
#define DMA_CAN2_ClearOverWriteFlag()   CLR_REG_BIT(DMA_CAN2T_STA,   DMACAN2TSTA_TXOVW_MSK)

#define DMACAN1RSTA_RXLOSS_MSK          BIT1
#define DMACAN2RSTA_RXLOSS_MSK          BIT1
#define DMA_CAN1_CheckRxLossFlag()      READ_REG_BIT(DMA_CAN1R_STA,  DMACAN1RSTA_RXLOSS_MSK)
#define DMA_CAN2_CheckRxLossFlag()      READ_REG_BIT(DMA_CAN2R_STA,  DMACAN2RSTA_RXLOSS_MSK)
#define DMA_CAN1_ClearRxLossFlag()      CLR_REG_BIT(DMA_CAN1R_STA,   DMACAN1RSTA_RXLOSS_MSK)
#define DMA_CAN2_ClearRxLossFlag()      CLR_REG_BIT(DMA_CAN2R_STA,   DMACAN2RSTA_RXLOSS_MSK)

#define DMA_CAN1_SetTxAmount(d)         (DMA_CAN1T_AMTH = HIBYTE(d), DMA_CAN1T_AMT = LOBYTE(d))
#define DMA_CAN2_SetTxAmount(d)         (DMA_CAN2T_AMTH = HIBYTE(d), DMA_CAN2T_AMT = LOBYTE(d))

#define DMA_CAN1_SetRxAmount(d)         (DMA_CAN1R_AMTH = HIBYTE(d), DMA_CAN1R_AMT = LOBYTE(d))
#define DMA_CAN2_SetRxAmount(d)         (DMA_CAN2R_AMTH = HIBYTE(d), DMA_CAN2R_AMT = LOBYTE(d))

#define DMA_CAN1_ReadTxDone()           MAKEWORD(DMA_CAN1T_DONE, DMA_CAN1T_DONEH)
#define DMA_CAN2_ReadTxDone()           MAKEWORD(DMA_CAN2T_DONE, DMA_CAN2T_DONEH)

#define DMA_CAN1_ReadRxDone()           MAKEWORD(DMA_CAN1R_DONE, DMA_CAN1R_DONEH)
#define DMA_CAN2_ReadRxDone()           MAKEWORD(DMA_CAN2R_DONE, DMA_CAN2R_DONEH)

#define DMA_CAN1_SetTxAddress(d)        (DMA_CAN1T_TXAH = HIBYTE(d), DMA_CAN1T_TXAL = LOBYTE(d))
#define DMA_CAN2_SetTxAddress(d)        (DMA_CAN2T_TXAH = HIBYTE(d), DMA_CAN2T_TXAL = LOBYTE(d))

#define DMA_CAN1_SetRxAddress(d)        (DMA_CAN1R_RXAH = HIBYTE(d), DMA_CAN1R_RXAL = LOBYTE(d))
#define DMA_CAN2_SetRxAddress(d)        (DMA_CAN2R_RXAH = HIBYTE(d), DMA_CAN2R_RXAL = LOBYTE(d))

#define DMA_CAN1_SetInterval(d)         (DMA_CAN1_ITVH = HIBYTE(d), DMA_CAN1_ITVL = LOBYTE(d))
#define DMA_CAN2_SetInterval(d)         (DMA_CAN2_ITVH = HIBYTE(d), DMA_CAN2_ITVL = LOBYTE(d))

#define DMA_CAN1_SetTxFrameSize(d)      (DMA_CAN1T_FRM = BYTE(d))
#define DMA_CAN2_SetTxFrameSize(d)      (DMA_CAN2T_FRM = BYTE(d))

#define DMA_CAN1_SetRxFrameSize(d)      (DMA_CAN1R_FRM = BYTE(d))
#define DMA_CAN2_SetRxFrameSize(d)      (DMA_CAN2R_FRM = BYTE(d))

#define DMA_CAN1_SetRxAddress(d)        (DMA_CAN1R_RXAH = HIBYTE(d), DMA_CAN1R_RXAL = LOBYTE(d))
#define DMA_CAN2_SetRxAddress(d)        (DMA_CAN2R_RXAH = HIBYTE(d), DMA_CAN2R_RXAL = LOBYTE(d))

#define DMA_CAN1_ReadTxFrameCount()     MAKEWORD(DMA_CAN1T_FCNTL, DMA_CAN1T_FCNTH)
#define DMA_CAN2_ReadTxFrameCount()     MAKEWORD(DMA_CAN2T_FCNTL, DMA_CAN2T_FCNTH)

#define DMA_CAN1_ReadRxFrameCount()     MAKEWORD(DMA_CAN1R_FCNTL, DMA_CAN1R_FCNTH)
#define DMA_CAN2_ReadRxFrameCount()     MAKEWORD(DMA_CAN2R_FCNTL, DMA_CAN2R_FCNTH)

#define CAN1AUXCR_AUTOTRANS_MSK         BIT5
#define CAN2AUXCR_AUTOTRANS_MSK         BIT5
#define DMA_CAN1_AutoTransmit()         CLR_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_AUTOTRANS_MSK)
#define DMA_CAN2_AutoTransmit()         CLR_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_AUTOTRANS_MSK)
#define DMA_CAN1_ManualTransmit()       SET_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_AUTOTRANS_MSK)
#define DMA_CAN2_ManualTransmit()       SET_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_AUTOTRANS_MSK)

#define CAN1AUXCR_DMATXEN_MSK           BIT4
#define CAN2AUXCR_DMATXEN_MSK           BIT4
#define CAN1_EnableTxDMA()              SET_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_DMATXEN_MSK)
#define CAN2_EnableTxDMA()              SET_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_DMATXEN_MSK)
#define CAN1_DisableTxDMA()             CLR_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_DMATXEN_MSK)
#define CAN2_DisableTxDMA()             CLR_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_DMATXEN_MSK)

#define CAN1AUXCR_DMARXEN_MSK           BIT0
#define CAN2AUXCR_DMARXEN_MSK           BIT0
#define CAN1_EnableRxDMA()              SET_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_DMARXEN_MSK)
#define CAN2_EnableRxDMA()              SET_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_DMARXEN_MSK)
#define CAN1_DisableRxDMA()             CLR_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_DMARXEN_MSK)
#define CAN2_DisableRxDMA()             CLR_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_DMARXEN_MSK)

/////////////////////////////////////////////////

#define RSTCFG_P47RST_MSK               BIT4
#define RST_EnableResetPin()            SET_REG_BIT(RSTCFG, RSTCFG_P47RST_MSK)
#define RST_ResetPinAsGPIO()            CLR_REG_BIT(RSTCFG, RSTCFG_P47RST_MSK)

#define RSTCFG_ENLVR_MSK                BIT7
#define LVR_EnableLVR()                 SET_REG_BIT(RSTCFG, RSTCFG_ENLVR_MSK)
#define LVR_DisableLVR()                CLR_REG_BIT(RSTCFG, RSTCFG_ENLVR_MSK)

#define RSTCFG_LVDS_MSK                 (BIT1 | BIT0)
#define LVR_SetLVDS(n)                  MODIFY_REG(RSTCFG,  RSTCFG_LVDS_MSK, ((n) << 0))
#define LVR_SetLVDLevelV2p0()           LVR_SetLVDS(0)
#define LVR_SetLVDLevelV2p4()           LVR_SetLVDS(1)
#define LVR_SetLVDLevelV2p7()           LVR_SetLVDS(2)
#define LVR_SetLVDLevelV3p0()           LVR_SetLVDS(3)

/////////////////////////////////////////////////

#ifndef READ_LIN
#define READ_LIN(r)                     (LINAR = (r), READ_REG(LINDR))
#endif
#ifndef WRITE_LIN
#define WRITE_LIN(r, dat)               (LINAR = (r), WRITE_REG(LINDR, (dat)))
#endif
#ifndef MODIFY_LIN
#define MODIFY_LIN(r, clr, set)         (LINAR = (r), MODIFY_REG(LINDR, (clr), (set)))
#endif
#ifndef CLR_LIN_BIT
#define CLR_LIN_BIT(r, b)               (LINAR = (r), CLR_REG_BIT(LINDR, (b)))
#endif
#ifndef SET_LIN_BIT
#define SET_LIN_BIT(r, b)               (LINAR = (r), SET_REG_BIT(LINDR, (b)))
#endif

