fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define AUXR2_LIN1EN_MSK                BIT0
#define LIN1_Enable()                   SET_REG_BIT(AUXR2, AUXR2_LIN1EN_MSK)
#define LIN1_Disable()                  CLR_REG_BIT(AUXR2, AUXR2_LIN1EN_MSK)

#define AUXR2_LIN2EN_MSK                BIT4
#define LIN2_Enable()                   SET_REG_BIT(AUXR2, AUXR2_LIN2EN_MSK)
#define LIN2_Disable()                  CLR_REG_BIT(AUXR2, AUXR2_LIN2EN_MSK)

#define AUXR2_LINSEL_MSK                BIT5
#define LIN1_SEL()                      CLR_REG_BIT(AUXR2, AUXR2_LINSEL_MSK)
#define LIN2_SEL()                      SET_REG_BIT(AUXR2, AUXR2_LINSEL_MSK)
#define LIN1_ACTIVE()                   (READ_REG_BIT(AUXR2, AUXR2_LINSEL_MSK) == 0)
#define LIN2_ACTIVE()                   (READ_REG_BIT(AUXR2, AUXR2_LINSEL_MSK) != 0)

#define LINICR_LIN1IE_MSK               BIT1
#define LIN1_EnableInt()                SET_REG_BIT(LINICR, LINICR_LIN1IE_MSK)
#define LIN1_DisableInt()               CLR_REG_BIT(LINICR, LINICR_LIN1IE_MSK)

#define LINICR_PLIN1L_MSK               BIT0
#define LINICR_PLIN1H_MSK               BIT3
#define LIN1_SetIntPriority(n)          MODIFY_REG(LINICR, LINICR_PLIN1L_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(LINICR, LINICR_PLIN1H_MSK, ((((n) >> 1) & 1) << 3))

#define LINICR_LIN2IE_MSK               BIT5
#define LIN2_EnableInt()                SET_REG_BIT(LINICR, LINICR_LIN2IE_MSK)
#define LIN2_DisableInt()               CLR_REG_BIT(LINICR, LINICR_LIN2IE_MSK)

#define LINICR_PLIN2L_MSK               BIT4
#define LINICR_PLIN2H_MSK               BIT7
#define LIN2_SetIntPriority(n)          MODIFY_REG(LINICR, LINICR_PLIN2L_MSK, (((n) & 1) << 4)); \
                                        MODIFY_REG(LINICR, LINICR_PLIN2H_MSK, ((((n) >> 1) & 1) << 7))

#define LIN_ReadData()                  READ_LIN(LBUF)
#define LIN_WriteData(d)                WRITE_LIN(LBUF, (d))

#define LSEL_AINC_MSK                   BIT7
#define LIN_EnableAutoIncIndex()        SET_LIN_BIT(LSEL, LSEL_AINC_MSK)
#define LIN_DisableAutoIncIndex()       CLR_LIN_BIT(LSEL, LSEL_AINC_MSK)

#define LSEL_INDEX_MSK                  (BIT_LN)
#define LIN_SetDataIndex(i)             MODIFY_LIN(LSEL, LSEL_INDEX_MSK, ((i) << 0))

#define LID_ID_MSK                      (BIT5 | BIT4 | BIT_LN)
#define LIN_SetFrameID(n)               WRITE_LIN(LID, ((n) & LID_ID_MSK))
#define LIN_ReadFrameID()               (READ_LIN(LID) & LID_ID_MSK)

#define LER_OV_MSK                      BIT6
#define LER_SYN_MSK                     BIT5
#define LER_TOV_MSK                     BIT4
#define LER_CHK_MSK                     BIT3
#define LER_PER_MSK                     BIT2
#define LER_BIT_MSK                     BIT1
#define LER_FER_MSK                     BIT0
#define LIN_ReadAndClearError()         READ_LIN(LER)
#define LIN_CheckOVError(f)             READ_REG_BIT((f), LER_OV_MSK)
#define LIN_CheckSYNError(f)            READ_REG_BIT((f), LER_SYN_MSK)
#define LIN_CheckTOVError(f)            READ_REG_BIT((f), LER_TOV_MSK)
#define LIN_CheckCHKError(f)            READ_REG_BIT((f), LER_CHK_MSK)
#define LIN_CheckPERError(f)            READ_REG_BIT((f), LER_PER_MSK)
#define LIN_CheckBITError(f)            READ_REG_BIT((f), LER_BIT_MSK)
#define LIN_CheckFERError(f)            READ_REG_BIT((f), LER_FER_MSK)

#define LIE_ABORTE_MSK                  BIT3
#define LIE_ERRE_MSK                    BIT2
#define LIE_RDYE_MSK                    BIT1
#define LIE_LIDE_MSK                    BIT0
#define LIN_EnableAbortInt()            SET_LIN_BIT(LIE, LIE_ABORTE_MSK)
#define LIN_EnableErrorInt()            SET_LIN_BIT(LIE, LIE_ERRE_MSK)
#define LIN_EnableReadyInt()            SET_LIN_BIT(LIE, LIE_RDYE_MSK)
#define LIN_EnableHeaderInt()           SET_LIN_BIT(LIE, LIE_LIDE_MSK)
#define LIN_DisableAbortInt()           CLR_LIN_BIT(LIE, LIE_ABORTE_MSK)
#define LIN_DisableErrorInt()           CLR_LIN_BIT(LIE, LIE_ERRE_MSK)
#define LIN_DisableReadyInt()           CLR_LIN_BIT(LIE, LIE_RDYE_MSK)
#define LIN_DisableHeaderInt()          CLR_LIN_BIT(LIE, LIE_LIDE_MSK)

#define LSR_LOGSIZE_MSK                 (BIT_HN)
#define LSR_ABORT_MSK                   BIT3
#define LSR_ERR_MSK                     BIT2
#define LSR_RDY_MSK                     BIT1
#define LSR_LID_MSK                     BIT0
#define LIN_ReadAndClearStatus()        READ_LIN(LSR)
#define LIN_CheckAbort(f)               READ_REG_BIT((f), LSR_ABORT_MSK)
#define LIN_CheckError(f)               READ_REG_BIT((f), LSR_ERR_MSK)
#define LIN_CheckReady(f)               READ_REG_BIT((f), LSR_RDY_MSK)
#define LIN_CheckHeader(f)              READ_REG_BIT((f), LSR_LID_MSK)
#define LIN_GetLogSize(f)               (READ_REG_BIT((f), LSR_LOGSIZE_MSK) >> 4)

#define LCR_MODE_MSK                    BIT7
#define LIN_MASTER_MODE                 ((1 << 7) & LCR_MODE_MSK)
#define LIN_SLAVE_MODE                  ((0 << 7) & LCR_MODE_MSK)

#define LCR_LIN13_MSK                   BIT6
#define LIN_R1p3POTOCOL                 ((1 << 6) & LCR_LIN13_MSK)
#define LIN_R2p1POTOCOL                 ((0 << 6) & LCR_LIN13_MSK)

#define LCR_SIZE_MSK                    (BIT5 | BIT4 | BIT3 | BIT2)
#define LIN_FRAMESIZE(n)                (((n) << 2) & LCR_SIZE_MSK)

#define LCR_CMD_MSK                     (BIT1 | BIT0)
#define LIN_ABORTCMD                    (0 & LCR_CMD_MSK)
#define LIN_SENDHEADERCMD               (1 & LCR_CMD_MSK)
#define LIN_TXRESPONSECMD               (2 & LCR_CMD_MSK)
#define LIN_RXRESPONSECMD               (3 & LCR_CMD_MSK)

#define LIN_SendCommand(n)              WRITE_LIN(LCR, (n))

#define DLH_SYNC_MSK                    BIT7
#define LIN_EnableBaudRateSync()        SET_LIN_BIT(DLH, DLH_SYNC_MSK)
#define LIN_DisableBaudRateSync()       CLR_LIN_BIT(DLH, DLH_SYNC_MSK)

#define LIN_SetBaudRate(n)              WRITE_LIN(DLL, BYTE0(n)) ; \
                                        MODIFY_LIN(DLH, BYTE0(~DLH_SYNC_MSK), BYTE1(n))

#define LIN_SetHeaderDelay(n)           WRITE_LIN(HDRL, BYTE0(n)) ; \
                                        WRITE_LIN(HDRH, BYTE1(n))

#define HDP_PSCR_MSK                    (BIT5 | BIT4 | BIT_LN)
#define LIN_SetHeaderPrescale(n)        MODIFY_LIN(HDP, HDP_PSCR_MSK, ((n) << 0))

/////////////////////////////////////////////////

#define READ_CAN(r)                     (ACC = READ_REG(r), READ_REG(r))
#define WRITE_CAN(r, dat)               (WRITE_REG((r), (dat)))
#define MODIFY_CAN(r, clr, set)         (ACC = READ_REG(r), MODIFY_REG((r), (clr), (set)))
#define CLR_CAN_BIT(r, b)               (ACC = READ_REG(r), CLR_REG_BIT((r), (b)))
#define SET_CAN_BIT(r, b)               (ACC = READ_REG(r), SET_REG_BIT((r), (b)))
#define READ_CAN_BIT(r, b)              (ACC = READ_REG(r), READ_REG_BIT((r), (b)))

#define AUXR2_CAN1EN_MSK                BIT1
#define CAN1_Enable()                   SET_REG_BIT(AUXR2, AUXR2_CAN1EN_MSK)
#define CAN1_Disable()                  CLR_REG_BIT(AUXR2, AUXR2_CAN1EN_MSK)

