fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define AUXR2_CAN2EN_MSK                BIT2
#define CAN2_Enable()                   SET_REG_BIT(AUXR2, AUXR2_CAN2EN_MSK)
#define CAN2_Disable()                  CLR_REG_BIT(AUXR2, AUXR2_CAN2EN_MSK)

#define AUXR2_CANEDIN_MSK               BIT3
#define CAN16_LittleEndian()            CLR_REG_BIT(AUXR2, AUXR2_CANEDIN_MSK)
#define CAN16_BigEndian()               SET_REG_BIT(AUXR2, AUXR2_CANEDIN_MSK)
#define CAN16_SetEndianMode(n)          MODIFY_REG(AUXR2, AUXR2_CANEDIN_MSK, (((n) & 1) << 3))

#define CANICR_CAN1IE_MSK               BIT1
#define CAN1_EnableInt()                SET_REG_BIT(CANICR, CANICR_CAN1IE_MSK)
#define CAN1_DisableInt()               CLR_REG_BIT(CANICR, CANICR_CAN1IE_MSK)

#define CANICR_PCAN1L_MSK               BIT0
#define CANICR_PCAN1H_MSK               BIT3
#define CAN1_SetIntPriority(n)          MODIFY_REG(CANICR, CANICR_PCAN1L_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(CANICR, CANICR_PCAN1H_MSK, ((((n) >> 1) & 1) << 3))

#define CANICR_CAN2IE_MSK               BIT5
#define CAN2_EnableInt()                SET_REG_BIT(CANICR, CANICR_CAN2IE_MSK)
#define CAN2_DisableInt()               CLR_REG_BIT(CANICR, CANICR_CAN2IE_MSK)

#define CANICR_PCAN2L_MSK               BIT4
#define CANICR_PCAN2H_MSK               BIT7
#define CAN2_SetIntPriority(n)          MODIFY_REG(CANICR, CANICR_PCAN2L_MSK, (((n) & 1) << 4)); \
                                        MODIFY_REG(CANICR, CANICR_PCAN2H_MSK, ((((n) >> 1) & 1) << 7))

#define CAN1AUXCR_STBYEN_MSK            BIT6
#define CAN1_EnableStandbyPin()         SET_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_STBYEN_MSK)
#define CAN1_DisableStandbyPin()        CLR_REG_BIT(CAN1_AUX_CR, CAN1AUXCR_STBYEN_MSK)

#define CAN2AUXCR_STBYEN_MSK            BIT6
#define CAN2_EnableStandbyPin()         SET_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_STBYEN_MSK)
#define CAN2_DisableStandbyPin()        CLR_REG_BIT(CAN2_AUX_CR, CAN2AUXCR_STBYEN_MSK)

#define CAN1_WriteRBUF(n, d)            WRITE_CAN(CAN_RBUF[n], (d))
#define CAN1_ReadRBUF(n)                READ_CAN(CAN_RBUF[n])

#define CAN1_WriteTBUF(n, d)            WRITE_CAN(CAN_TBUF[n], (d))
#define CAN1_ReadTBUF(n)                READ_CAN(CAN_TBUF[n])

#define CAN1_WriteTTS(n, d)             WRITE_CAN(CAN_TTS[n], (d))
#define CAN1_ReadTTS(n)                 READ_CAN(CAN_TTS[n])

#define CANCFGSTAT_RESET_MSK            BIT7
#define CAN1_EnterResetMode()           SET_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_RESET_MSK)
#define CAN1_ExitResetMode()            CLR_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_RESET_MSK)

#define CANCFGSTAT_LBM_MSK              (BIT6 | BIT5)
#define CANTCMD_LOM_MSK                 BIT6
#define CAN1_ExternalLoopBackMode()     MODIFY_CAN(CAN_CFG_STAT, CANCFGSTAT_LBM_MSK, ((2) << 5)); \
                                        CLR_CAN_BIT(CAN_TCMD, CANTCMD_LOM_MSK)
#define CAN1_InternalLoopBackMode()     MODIFY_CAN(CAN_CFG_STAT, CANCFGSTAT_LBM_MSK, ((1) << 5)); \
                                        CLR_CAN_BIT(CAN_TCMD, CANTCMD_LOM_MSK)
#define CAN1_ListenOnlyMode()           MODIFY_CAN(CAN_CFG_STAT, CANCFGSTAT_LBM_MSK, ((0) << 5)); \
                                        SET_CAN_BIT(CAN_TCMD, CANTCMD_LOM_MSK)
#define CAN1_ExtLoopBackListenMode()    MODIFY_CAN(CAN_CFG_STAT, CANCFGSTAT_LBM_MSK, ((2) << 5)); \
                                        SET_CAN_BIT(CAN_TCMD, CANTCMD_LOM_MSK)
#define CAN1_NormalMode()               MODIFY_CAN(CAN_CFG_STAT, CANCFGSTAT_LBM_MSK, ((0) << 5)); \
                                        CLR_CAN_BIT(CAN_TCMD, CANTCMD_LOM_MSK)

#define CANCFGSTAT_TPSS_MSK             BIT4
#define CAN1_PTBSingleShotTransmit()    SET_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_TPSS_MSK)
#define CAN1_PTBAutoRetransmit()        CLR_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_TPSS_MSK)

#define CANCFGSTAT_TSSS_MSK             BIT3
#define CAN1_STBSingleShotTransmit()    SET_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_TSSS_MSK)
#define CAN1_STBAutoRetransmit()        CLR_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_TSSS_MSK)

#define CANCFGSTAT_RACTIVE_MSK          BIT2
#define CANCFGSTAT_TACTIVE_MSK          BIT1
#define CAN1_CheckReceiveStatus()       READ_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_RACTIVE_MSK)
#define CAN1_CheckTransmitStatus()      READ_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_TACTIVE_MSK)

#define CANCFGSTAT_BUSOFF_MSK           BIT0
#define CAN1_EnterBusOffStatus()        SET_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_BUSOFF_MSK)
#define CAN1_ExitBusOffStatus()         CLR_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_BUSOFF_MSK)
#define CAN1_CheckBusOffStatus()        READ_CAN_BIT(CAN_CFG_STAT, CANCFGSTAT_BUSOFF_MSK)

#define CANTCMD_TBSEL_MSK               BIT7
#define CAN1_SelectPTB()                CLR_CAN_BIT(CAN_TCMD, CANTCMD_TBSEL_MSK)
#define CAN1_SelectSTB()                SET_CAN_BIT(CAN_TCMD, CANTCMD_TBSEL_MSK)

#define CANTCMD_TPE_MSK                 BIT4
#define CAN1_TransmitPTB()              SET_CAN_BIT(CAN_TCMD, CANTCMD_TPE_MSK)

#define CANTCMD_TPA_MSK                 BIT3
#define CAN1_AbortTransmitPTB()         SET_CAN_BIT(CAN_TCMD, CANTCMD_TPA_MSK)

#define CANTCMD_TSONE_MSK               BIT2
#define CANTCMD_TSALL_MSK               BIT1
#define CAN1_TransmitOneSTB()           SET_CAN_BIT(CAN_TCMD, CANTCMD_TSONE_MSK)
#define CAN1_TransmitAllSTB()           SET_CAN_BIT(CAN_TCMD, CANTCMD_TSALL_MSK)

#define CANTCMD_TSA_MSK                 BIT0
#define CAN1_AbortTransmitSTB()         SET_CAN_BIT(CAN_TCMD, CANTCMD_TSA_MSK)

#define CANTCTRL_FDISO_MSK              BIT7
#define CAN1_FD_BoschMode()             CLR_CAN_BIT(CAN_TCTRL, CANTCTRL_FDISO_MSK)
#define CAN1_FD_ISO11898Mode()          SET_CAN_BIT(CAN_TCTRL, CANTCTRL_FDISO_MSK)

#define CANTCTRL_TSNEXT_MSK             BIT6
#define CAN1_SelectNextTBSlot()         SET_CAN_BIT(CAN_TCTRL, CANTCTRL_TSNEXT_MSK)

#define CANTCTRL_TSMODE_MSK             BIT5
#define CAN1_STBPriorityFIFO()          CLR_CAN_BIT(CAN_TCTRL, CANTCTRL_TSMODE_MSK)
#define CAN1_STBPriorityID()            SET_CAN_BIT(CAN_TCTRL, CANTCTRL_TSMODE_MSK)

#define CANTCTRL_TTTBM_MSK              BIT4
#define CAN1_TTCAN_NormalMode()         CLR_CAN_BIT(CAN_TCTRL, CANTCTRL_TTTBM_MSK)
#define CAN1_TTCAN_PtrMode()            SET_CAN_BIT(CAN_TCTRL, CANTCTRL_TTTBM_MSK)

