fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CANTCTRL_TSSTAT_MSK             (BIT1 | BIT0)
#define CAN1_CheckSTBStatus()           READ_CAN_BIT(CAN_TCTRL, CANTCTRL_TSSTAT_MSK)

#define CANRCTRL_SACK_MSK               BIT7
#define CAN1_EnableSelfACK()            SET_CAN_BIT(CAN_RCTRL, CANRCTRL_SACK_MSK)
#define CAN1_DisableSelfACK()           CLR_CAN_BIT(CAN_RCTRL, CANRCTRL_SACK_MSK)

#define CANRCTRL_ROM_MSK                BIT6
#define CAN1_OVFSaveNewest()            CLR_CAN_BIT(CAN_RCTRL, CANRCTRL_ROM_MSK)
#define CAN1_OVFDiscardNewest()         SET_CAN_BIT(CAN_RCTRL, CANRCTRL_ROM_MSK)

#define CANRCTRL_ROV_MSK                BIT5
#define CAN1_CheckRBUFOverflow()        READ_CAN_BIT(CAN_RCTRL, CANRCTRL_ROV_MSK)

#define CANRCTRL_RREL_MSK               BIT4
#define CAN1_ReleaseRBUF()              SET_CAN_BIT(CAN_RCTRL, CANRCTRL_RREL_MSK)

#define CANRCTRL_RBALL_MSK              BIT3
#define CAN1_RBStoreCorrectData()       CLR_CAN_BIT(CAN_RCTRL, CANRCTRL_RBALL_MSK)
#define CAN1_RBStoreAllEvenError()      SET_CAN_BIT(CAN_RCTRL, CANRCTRL_RBALL_MSK)

#define CANRCTRL_RSTAT_MSK              (BIT1 | BIT0)
#define CANRCTRL_RSTAT_EMPTY            ((0) << 0)
#define CANRCTRL_RSTAT_LESSLIMIT        ((1) << 0)
#define CANRCTRL_RSTAT_MORELIMIT        ((2) << 0)
#define CANRCTRL_RSTAT_FULL             ((3) << 0)
#define CAN1_CheckRBStatus()            READ_CAN_BIT(CAN_RCTRL, CANRCTRL_RSTAT_MSK)

#define CANRTIE_RIE_MSK                 BIT7
#define CANRTIE_ROIE_MSK                BIT6
#define CANRTIE_RFIE_MSK                BIT5
#define CANRTIE_RAFIE_MSK               BIT4
#define CANRTIE_TPIE_MSK                BIT3
#define CANRTIE_TSIE_MSK                BIT2
#define CANRTIE_EIE_MSK                 BIT1
#define CANERRINT_EPIE_MSK              BIT5
#define CANERRINT_ALIE_MSK              BIT3
#define CANERRINT_BEIE_MSK              BIT1
#define CAN1_EnableReceiveInt()         SET_CAN_BIT(CAN_RTIE, CANRTIE_RIE_MSK)
#define CAN1_EnableRBOverrunInt()       SET_CAN_BIT(CAN_RTIE, CANRTIE_ROIE_MSK)
#define CAN1_EnableRBFIFOFullInt()      SET_CAN_BIT(CAN_RTIE, CANRTIE_RFIE_MSK)
#define CAN1_EnableRBAlmostFullInt()    SET_CAN_BIT(CAN_RTIE, CANRTIE_RAFIE_MSK)
#define CAN1_EnablePTBTransmitInt()     SET_CAN_BIT(CAN_RTIE, CANRTIE_TPIE_MSK)
#define CAN1_EnableSTBTransmitInt()     SET_CAN_BIT(CAN_RTIE, CANRTIE_TSIE_MSK)
#define CAN1_EnableErrorInt()           SET_CAN_BIT(CAN_RTIE, CANRTIE_EIE_MSK)
#define CAN1_EnableErrorPassiveInt()    SET_CAN_BIT(CAN_ERRINT, CANERRINT_EPIE_MSK)
#define CAN1_EnableArbitrateLostInt()   SET_CAN_BIT(CAN_ERRINT, CANERRINT_ALIE_MSK)
#define CAN1_EnableBusErrorInt()        SET_CAN_BIT(CAN_ERRINT, CANERRINT_BEIE_MSK)
#define CAN1_DisableReceiveInt()        CLR_CAN_BIT(CAN_RTIE, CANRTIE_RIE_MSK)
#define CAN1_DisableRBOverrunInt()      CLR_CAN_BIT(CAN_RTIE, CANRTIE_ROIE_MSK)
#define CAN1_DisableRBFIFOFullInt()     CLR_CAN_BIT(CAN_RTIE, CANRTIE_RFIE_MSK)
#define CAN1_DisableRBAlmostFullInt()   CLR_CAN_BIT(CAN_RTIE, CANRTIE_RAFIE_MSK)
#define CAN1_DisablePTBTransmitInt()    CLR_CAN_BIT(CAN_RTIE, CANRTIE_TPIE_MSK)
#define CAN1_DisableSTBTransmitInt()    CLR_CAN_BIT(CAN_RTIE, CANRTIE_TSIE_MSK)
#define CAN1_DisableErrorInt()          CLR_CAN_BIT(CAN_RTIE, CANRTIE_EIE_MSK)
#define CAN1_DisableErrorPassiveInt()   CLR_CAN_BIT(CAN_ERRINT, CANERRINT_EPIE_MSK)
#define CAN1_DisableArbitrateLostInt()  CLR_CAN_BIT(CAN_ERRINT, CANERRINT_ALIE_MSK)
#define CAN1_DisableBusErrorInt()       CLR_CAN_BIT(CAN_ERRINT, CANERRINT_BEIE_MSK)

#define CANRTIF_RIF_MSK                 BIT7
#define CANRTIF_ROIF_MSK                BIT6
#define CANRTIF_RFIF_MSK                BIT5
#define CANRTIF_RAFIF_MSK               BIT4
#define CANRTIF_TPIF_MSK                BIT3
#define CANRTIF_TSIF_MSK                BIT2
#define CANRTIF_EIF_MSK                 BIT1
#define CANRTIF_AIF_MSK                 BIT0
#define CANERRINT_EPIF_MSK              BIT4
#define CANERRINT_ALIF_MSK              BIT2
#define CANERRINT_BEIF_MSK              BIT0
#define CANRTIF_ALL_MSK                 (BIT_ALL)
#define CANERRINT_ALL_MSK               (BIT4 | BIT2 | BIT0)
#define CAN1_CheckReceive(f)            READ_REG_BIT((f), CANRTIF_RIF_MSK)
#define CAN1_CheckRBOverrun(f)          READ_REG_BIT((f), CANRTIF_ROIF_MSK)
#define CAN1_CheckRBFIFOFull(f)         READ_REG_BIT((f), CANRTIF_RFIF_MSK)
#define CAN1_CheckRBAlmostFull(f)       READ_REG_BIT((f), CANRTIF_RAFIF_MSK)
#define CAN1_CheckPTBTransmit(f)        READ_REG_BIT((f), CANRTIF_TPIF_MSK)
#define CAN1_CheckSTBTransmit(f)        READ_REG_BIT((f), CANRTIF_TSIF_MSK)
#define CAN1_CheckError(f)              READ_REG_BIT((f), CANRTIF_EIF_MSK)
#define CAN1_CheckAbort(f)              READ_REG_BIT((f), CANRTIF_AIF_MSK)
#define CAN1_CheckErrorPassive(f)       READ_REG_BIT((f), CANERRINT_EPIF_MSK)
#define CAN1_CheckArbitrateLost(f)      READ_REG_BIT((f), CANERRINT_ALIF_MSK)
#define CAN1_CheckBusError(f)           READ_REG_BIT((f), CANERRINT_BEIF_MSK)

#define CAN1_ReadIntStatus()            (READ_CAN(CAN_RTIF) & CANRTIF_ALL_MSK)
#define CAN1_ReadErrorStatus()          (READ_CAN(CAN_ERRINT) & CANERRINT_ALL_MSK)
#define CAN1_ClearFlags(n)              WRITE_CAN(CAN_RTIF, ((n) & CANRTIF_ALL_MSK))
#define CAN1_ClearErrorFlags(n)         WRITE_CAN(CAN_ERRINT, ((n) & CANERRINT_ALL_MSK))

#define CANRTIE_TSFF_MSK                BIT0
#define CAN1_CheckTBFullFlag()          READ_CAN_BIT(CAN_RTIE, CANRTIE_TSFF_MSK)

#define CANERRINT_EWARN_MSK             BIT7
#define CAN1_CheckErrorWarningLimit()   READ_CAN_BIT(CAN_ERRINT, CANERRINT_EWARN_MSK)

#define CANLIMIT_AFWL_MSK               (BIT_HN)
#define CANLIMIT_EWL_MSK                (BIT_LN)
#define CAN1_SetAFWLimit(n)             MODIFY_CAN(CAN_LIMIT, CANLIMIT_AFWL_MSK, ((n) << 4))
#define CAN1_SetEWLimit(n)              MODIFY_CAN(CAN_LIMIT, CANLIMIT_EWL_MSK, ((n) << 0))
#define CAN1_SetEWLimit_8()             CAN1_SetEWLimit(0)
#define CAN1_SetEWLimit_16()            CAN1_SetEWLimit(1)
#define CAN1_SetEWLimit_24()            CAN1_SetEWLimit(2)
#define CAN1_SetEWLimit_32()            CAN1_SetEWLimit(3)
#define CAN1_SetEWLimit_40()            CAN1_SetEWLimit(4)
#define CAN1_SetEWLimit_48()            CAN1_SetEWLimit(5)
#define CAN1_SetEWLimit_56()            CAN1_SetEWLimit(6)
#define CAN1_SetEWLimit_64()            CAN1_SetEWLimit(7)
#define CAN1_SetEWLimit_72()            CAN1_SetEWLimit(8)
#define CAN1_SetEWLimit_80()            CAN1_SetEWLimit(9)
#define CAN1_SetEWLimit_88()            CAN1_SetEWLimit(10)
#define CAN1_SetEWLimit_96()            CAN1_SetEWLimit(11)
#define CAN1_SetEWLimit_104()           CAN1_SetEWLimit(12)
#define CAN1_SetEWLimit_112()           CAN1_SetEWLimit(13)
#define CAN1_SetEWLimit_120()           CAN1_SetEWLimit(14)
#define CAN1_SetEWLimit_128()           CAN1_SetEWLimit(15)

#define CANSBT_SEG2_MSK                 (~(BIT7))
#define CANSBT_SJW_MSK                  (~(BIT7))
#define CAN1_SetSBT_SEG1(n)             WRITE_CAN(CAN_S_SEG1, (n))
#define CAN1_SetSBT_SEG2(n)             MODIFY_CAN(CAN_S_SEG2, CANSBT_SEG2_MSK, ((n) << 0))
#define CAN1_SetSBT_SJW(n)              MODIFY_CAN(CAN_S_SJW, CANSBT_SJW_MSK, ((n) << 0))
#define CAN1_SetSBT_PRESC(n)            WRITE_CAN(CAN_S_PRESC, (n))

