fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CANFBT_SEG1_MSK                 (BIT4 | BIT_LN)
#define CANFBT_SEG2_MSK                 (BIT_LN)
#define CANFBT_SJW_MSK                  (BIT_LN)
#define CAN1_SetFBT_SEG1(n)             MODIFY_CAN(CAN_F_SEG1, CANFBT_SEG1_MSK, ((n) << 0))
#define CAN1_SetFBT_SEG2(n)             MODIFY_CAN(CAN_F_SEG2, CANFBT_SEG2_MSK, ((n) << 0))
#define CAN1_SetFBT_SJW(n)              MODIFY_CAN(CAN_F_SJW, CANFBT_SJW_MSK, ((n) << 0))
#define CAN1_SetFBT_PRESC(n)            WRITE_CAN(CAN_F_PRESC, (n))

#define CANEALCAP_KOER_MSK              (BIT7 | BIT6 | BIT5)
#define CANEALCAP_ALC_MSK               (BIT4 | BIT_LN)
#define CAN1_ReadErrorCode()            READ_CAN_BIT(CAN_EALCAP, CANEALCAP_KOER_MSK)
#define CAN1_ReadArbitrationLost()      READ_CAN_BIT(CAN_EALCAP, CANEALCAP_ALC_MSK)

#define CANTDC_TDCEN_MSK                BIT7
#define CAN1_EnableTDC()                SET_CAN_BIT(CAN_TDC, CANTDC_TDCEN_MSK)
#define CAN1_DisableTDC()               CLR_CAN_BIT(CAN_TDC, CANTDC_TDCEN_MSK)

#define CANTDC_SSPOFF_MSK               (~(BIT7))
#define CAN1_SetSSPOffset(n)            MODIFY_CAN(CAN_TDC, CANTDC_SSPOFF_MSK, ((n) << 0))

#define CAN1_GetRxErrorCouter()         READ_CAN(CAN_RECNT)
#define CAN1_GetTxErrorCouter()         READ_CAN(CAN_TECNT)

#define CANACFCTRL_SEL_MSK              BIT5
#define CAN1_SelectACFID()              CLR_CAN_BIT(CAN_ACFCTRL, CANACFCTRL_SEL_MSK)
#define CAN1_SelectACFMask()            SET_CAN_BIT(CAN_ACFCTRL, CANACFCTRL_SEL_MSK)

#define CANACFCTRL_ADR_MSK              (BIT_LN)
#define CAN1_SetACFAddress(n)           MODIFY_CAN(CAN_ACFCTRL, CANACFCTRL_ADR_MSK, ((n) << 0))

#define CANTIMECFG_TSPOS_MSK            BIT1
#define CAN1_TimeStampAtSOF()           CLR_CAN_BIT(CAN_TIMECFG, CANTIMECFG_TSPOS_MSK)
#define CAN1_TimeStampAtEOF()           SET_CAN_BIT(CAN_TIMECFG, CANTIMECFG_TSPOS_MSK)

#define CANTIMECFG_TSEN_MSK             BIT0
#define CAN1_DisableTimeStamp()         CLR_CAN_BIT(CAN_TIMECFG, CANTIMECFG_TSEN_MSK)
#define CAN1_EnableTimeStamp()          SET_CAN_BIT(CAN_TIMECFG, CANTIMECFG_TSEN_MSK)

#define CAN1_EnableACFL(n)              SET_CAN_BIT(CAN_ACF_EN0, BIT(n))
#define CAN1_EnableACFH(n)              SET_CAN_BIT(CAN_ACF_EN1, BIT(n))
#define CAN1_DisableACFL(n)             CLR_CAN_BIT(CAN_ACF_EN0, BIT(n))
#define CAN1_DisableACFH(n)             CLR_CAN_BIT(CAN_ACF_EN1, BIT(n))
#define CAN1_EnableACF(n)               SET_CAN_BIT(CAN_ACF_EN[(n) >> 3], (1 << ((n) & 0x07)))
#define CAN1_DisableACF(n)              CLR_CAN_BIT(CAN_ACF_EN[(n) >> 3], (1 << ((n) & 0x07)))

#define CANACF3_CODE_MSK                (BIT4 | BIT_LN)
#define CAN1_SetACF0(n)                 WRITE_CAN(CAN_ACF0, (n))
#define CAN1_SetACF1(n)                 WRITE_CAN(CAN_ACF1, (n))
#define CAN1_SetACF2(n)                 WRITE_CAN(CAN_ACF2, (n))
#define CAN1_SetACF3(n)                 MODIFY_CAN(CAN_ACF3, CANACF3_CODE_MSK, ((n) << 0))
#define CAN1_SetACF(n)                  CAN1_SetACF0(BYTE0(n)); \
                                        CAN1_SetACF1(BYTE1(n)); \
                                        CAN1_SetACF2(BYTE2(n)); \
                                        CAN1_SetACF3(BYTE3(n))

#define CANACF3_AIDE_MSK                BIT5
#define CANACF3_AIDEE_MSK               BIT6
#define CAN1_ACFAcceptStdFrame()        SET_CAN_BIT(CAN_ACF3, CANACF3_AIDEE_MSK); \
                                        CLR_CAN_BIT(CAN_ACF3, CANACF3_AIDE_MSK)
#define CAN1_ACFAcceptExtFrame()        SET_CAN_BIT(CAN_ACF3, CANACF3_AIDEE_MSK); \
                                        SET_CAN_BIT(CAN_ACF3, CANACF3_AIDE_MSK)
#define CAN1_ACFAcceptAllFrame()        CLR_CAN_BIT(CAN_ACF3, CANACF3_AIDEE_MSK)

#define CAN1_ReadVersion()              MAKEWORD(READ_CAN(CAN_VER0), READ_CAN(CAN_VER1))

#define CANTBSLOT_TBE_MSK               BIT7
#define CANTBSLOT_TBF_MSK               BIT6
#define CAN1_SetTBSlotToEmpty()         SET_CAN_BIT(CAN_TBSLOT, CANTBSLOT_TBE_MSK)
#define CAN1_SetTBSlotToFull()          SET_CAN_BIT(CAN_TBSLOT, CANTBSLOT_TBF_MSK)

#define CANTBSLOT_TBPTR_MSK             (BIT_LN)
#define CAN1_SetTBSlotPointer(n)        MODIFY_CAN(CAN_TBSLOT, CANTBSLOT_TBPTR_MSK, ((n) << 0))

#define CANTTCFG_WTIE_MSK               BIT7
#define CANTTCFG_WTIF_MSK               BIT6
#define CAN1_EnableWatchTriggerInt()    SET_CAN_BIT(CAN_TTCFG, CANTTCFG_WTIE_MSK)
#define CAN1_DisableWatchTriggerInt()   CLR_CAN_BIT(CAN_TTCFG, CANTTCFG_WTIE_MSK)
#define CAN1_CheckWatchTriggerFlag()    READ_CAN_BIT(CAN_TTCFG, CANTTCFG_WTIF_MSK)

#define CANTTCFG_TEIF_MSK               BIT5
#define CANTTCFG_TTIE_MSK               BIT4
#define CANTTCFG_TTIF_MSK               BIT3
#define CAN1_EnableTimeTriggerInt()     SET_CAN_BIT(CAN_TTCFG, CANTTCFG_TTIE_MSK)
#define CAN1_DisableTimeTriggerInt()    CLR_CAN_BIT(CAN_TTCFG, CANTTCFG_TTIE_MSK)
#define CAN1_CheckTimeTriggerFlag()     READ_CAN_BIT(CAN_TTCFG, CANTTCFG_TTIF_MSK)
#define CAN1_CheckTriggerErrorFlag()    READ_CAN_BIT(CAN_TTCFG, CANTTCFG_TEIF_MSK)

#define CANTTCFG_PRESC_MSK              (BIT2 | BIT1)
#define CAN1_SetTTTimerPrescale(n)      MODIFY_CAN(CAN_TTCFG, CANTTCFG_PRESC_MSK, ((n) << 1))
#define CAN1_SetTTTimerPrescale1()      CAN1_SetTTTimerPrescale(0)
#define CAN1_SetTTTimerPrescale2()      CAN1_SetTTTimerPrescale(1)
#define CAN1_SetTTTimerPrescale4()      CAN1_SetTTTimerPrescale(2)
#define CAN1_SetTTTimerPrescale8()      CAN1_SetTTTimerPrescale(3)

#define CANTTCFG_TTEN_MSK               BIT0
#define CAN1_EnableTimeTrigger()        SET_CAN_BIT(CAN_TTCFG, CANTTCFG_TTEN_MSK)
#define CAN1_DisableTimeTrigger()       CLR_CAN_BIT(CAN_TTCFG, CANTTCFG_TTEN_MSK)

#define CANREFMSG3_REFID_MSK            (BIT4 | BIT_LN)
#define CAN1_SetREFID0(n)               WRITE_CAN(CAN_REF_MSG0, (n))
#define CAN1_SetREFID1(n)               WRITE_CAN(CAN_REF_MSG1, (n))
#define CAN1_SetREFID2(n)               WRITE_CAN(CAN_REF_MSG2, (n))
#define CAN1_SetREFID3(n)               MODIFY_CAN(CAN_REF_MSG3, CANREFMSG3_REFID_MSK, ((n) << 0))
#define CAN1_SetREFID(n)                CAN1_SetREFID0(BYTE0(n)); \
                                        CAN1_SetREFID1(BYTE1(n)); \
                                        CAN1_SetREFID2(BYTE2(n)); \
                                        CAN1_SetREFID3(BYTE3(n))

