fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CANREFMSG3_REFIDE_MSK           BIT7
#define CAN1_StandardREFID()            CLR_CAN_BIT(CAN_REF_MSG3, CANREFMSG3_REFIDE_MSK)
#define CAN1_ExtendedREFID()            SET_CAN_BIT(CAN_REF_MSG3, CANREFMSG3_REFIDE_MSK)

#define CANTRIGCFG0_TTPTR_MSK           (BIT5 | BIT4 | BIT_LN)
#define CAN1_SetTTBSlotPointer(n)       MODIFY_CAN(CAN_TRIG_CFG0, CANTRIGCFG0_TTPTR_MSK, ((n) << 0))

#define CANTRIGCFG1_TTYPE_MSK           (BIT2 | BIT1 | BIT0)
#define CAN1_SetTriggerType(n)          MODIFY_CAN(CAN_TRIG_CFG1, CANTRIGCFG1_TTYPE_MSK, ((n) << 0))

#define CANTRIGCFG1_TEWE_MSK            (BIT_HN)
#define CAN1_SetTransEnableWindow(n)    MODIFY_CAN(CAN_TRIG_CFG1, CANTRIGCFG1_TEWE_MSK, ((n) << 4))

#define CAN1_SetTriggerTime(n)          (WRITE_CAN(CAN_TT_CFG0, LOBYTE(n)), WRITE_CAN(CAN_TT_CFG1, HIBYTE(n)))
#define CAN1_SetWatchTriggerTime(n)     (WRITE_CAN(CAN_TT_WTRIG0, LOBYTE(n)), WRITE_CAN(CAN_TT_WTRIG1, HIBYTE(n)))

////////////////////////

#define CAN2_WriteRBUF(n, d)            WRITE_CAN(CAN2_RBUF[n], (d))
#define CAN2_ReadRBUF(n)                READ_CAN(CAN2_RBUF[n])

#define CAN2_WriteTBUF(n, d)            WRITE_CAN(CAN2_TBUF[n], (d))
#define CAN2_ReadTBUF(n)                READ_CAN(CAN2_TBUF[n])

#define CAN2_WriteTTS(n, d)             WRITE_CAN(CAN2_TTS[n], (d))
#define CAN2_ReadTTS(n)                 READ_CAN(CAN2_TTS[n])

#define CAN2CFGSTAT_RESET_MSK           BIT7
#define CAN2_EnterResetMode()           SET_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_RESET_MSK)
#define CAN2_ExitResetMode()            CLR_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_RESET_MSK)

#define CAN2CFGSTAT_LBM_MSK             (BIT6 | BIT5)
#define CAN2TCMD_LOM_MSK                BIT6
#define CAN2_ExternalLoopBackMode()     MODIFY_CAN(CAN2_CFG_STAT, CAN2CFGSTAT_LBM_MSK, ((2) << 5)); \
                                        CLR_CAN_BIT(CAN2_TCMD, CAN2TCMD_LOM_MSK)
#define CAN2_InternalLoopBackMode()     MODIFY_CAN(CAN2_CFG_STAT, CAN2CFGSTAT_LBM_MSK, ((1) << 5)); \
                                        CLR_CAN_BIT(CAN2_TCMD, CAN2TCMD_LOM_MSK)
#define CAN2_ListenOnlyMode()           MODIFY_CAN(CAN2_CFG_STAT, CAN2CFGSTAT_LBM_MSK, ((0) << 5)); \
                                        SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_LOM_MSK)
#define CAN2_ExtLoopBackListenMode()    MODIFY_CAN(CAN2_CFG_STAT, CAN2CFGSTAT_LBM_MSK, ((2) << 5)); \
                                        SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_LOM_MSK)
#define CAN2_NormalMode()               MODIFY_CAN(CAN2_CFG_STAT, CAN2CFGSTAT_LBM_MSK, ((0) << 5)); \
                                        CLR_CAN_BIT(CAN2_TCMD, CAN2TCMD_LOM_MSK)

#define CAN2CFGSTAT_TPSS_MSK            BIT4
#define CAN2_PTBSingleShotTransmit()    SET_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_TPSS_MSK)
#define CAN2_PTBAutoRetransmit()        CLR_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_TPSS_MSK)

#define CAN2CFGSTAT_TSSS_MSK            BIT3
#define CAN2_STBSingleShotTransmit()    SET_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_TSSS_MSK)
#define CAN2_STBAutoRetransmit()        CLR_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_TSSS_MSK)

#define CAN2CFGSTAT_RACTIVE_MSK         BIT2
#define CAN2CFGSTAT_TACTIVE_MSK         BIT1
#define CAN2_CheckReceiveStatus()       READ_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_RACTIVE_MSK)
#define CAN2_CheckTransmitStatus()      READ_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_TACTIVE_MSK)

#define CAN2CFGSTAT_BUSOFF_MSK          BIT0
#define CAN2_EnterBusOffStatus()        SET_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_BUSOFF_MSK)
#define CAN2_ExitBusOffStatus()         CLR_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_BUSOFF_MSK)
#define CAN2_CheckBusOffStatus()        READ_CAN_BIT(CAN2_CFG_STAT, CAN2CFGSTAT_BUSOFF_MSK)

#define CAN2TCMD_TBSEL_MSK              BIT7
#define CAN2_SelectPTB()                CLR_CAN_BIT(CAN2_TCMD, CAN2TCMD_TBSEL_MSK)
#define CAN2_SelectSTB()                SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_TBSEL_MSK)

#define CAN2TCMD_TPE_MSK                BIT4
#define CAN2_TransmitPTB()              SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_TPE_MSK)

#define CAN2TCMD_TPA_MSK                BIT3
#define CAN2_AbortTransmitPTB()         SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_TPA_MSK)

#define CAN2TCMD_TSONE_MSK              BIT2
#define CAN2TCMD_TSALL_MSK              BIT1
#define CAN2_TransmitOneSTB()           SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_TSONE_MSK)
#define CAN2_TransmitAllSTB()           SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_TSALL_MSK)

#define CAN2TCMD_TSA_MSK                BIT0
#define CAN2_AbortTransmitSTB()         SET_CAN_BIT(CAN2_TCMD, CAN2TCMD_TSA_MSK)

#define CAN2TCTRL_FDISO_MSK             BIT7
#define CAN2_FD_BoschMode()             CLR_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_FDISO_MSK)
#define CAN2_FD_ISO11898Mode()          SET_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_FDISO_MSK)

#define CAN2TCTRL_TSNEXT_MSK            BIT6
#define CAN2_SelectNextTBSlot()         SET_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_TSNEXT_MSK)

#define CAN2TCTRL_TSMODE_MSK            BIT5
#define CAN2_STBPriorityFIFO()          CLR_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_TSMODE_MSK)
#define CAN2_STBPriorityID()            SET_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_TSMODE_MSK)

#define CAN2TCTRL_TTTBM_MSK             BIT4
#define CAN2_TTCAN2_NormalMode()         CLR_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_TTTBM_MSK)
#define CAN2_TTCAN2_PtrMode()            SET_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_TTTBM_MSK)

#define CAN2TCTRL_TSSTAT_MSK            (BIT1 | BIT0)
#define CAN2_CheckSTBStatus()           READ_CAN_BIT(CAN2_TCTRL, CAN2TCTRL_TSSTAT_MSK)

#define CAN2RCTRL_SACK_MSK              BIT7
#define CAN2_EnableSelfACK()            SET_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_SACK_MSK)
#define CAN2_DisableSelfACK()           CLR_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_SACK_MSK)

#define CAN2RCTRL_ROM_MSK               BIT6
#define CAN2_OVFSaveNewest()            CLR_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_ROM_MSK)
#define CAN2_OVFDiscardNewest()         SET_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_ROM_MSK)

#define CAN2RCTRL_ROV_MSK               BIT5
#define CAN2_CheckRBUFOverflow()        READ_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_ROV_MSK)

#define CAN2RCTRL_RREL_MSK              BIT4
#define CAN2_ReleaseRBUF()              SET_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_RREL_MSK)

