fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CAN2RCTRL_RBALL_MSK             BIT3
#define CAN2_RBStoreCorrectData()       CLR_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_RBALL_MSK)
#define CAN2_RBStoreAllEvenError()      SET_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_RBALL_MSK)

#define CAN2RCTRL_RSTAT_MSK             (BIT1 | BIT0)
#define CAN2RCTRL_RSTAT_EMPTY           ((0) << 0)
#define CAN2RCTRL_RSTAT_LESSLIMIT       ((1) << 0)
#define CAN2RCTRL_RSTAT_MORELIMIT       ((2) << 0)
#define CAN2RCTRL_RSTAT_FULL            ((3) << 0)
#define CAN2_CheckRBStatus()            READ_CAN_BIT(CAN2_RCTRL, CAN2RCTRL_RSTAT_MSK)

#define CAN2RTIE_RIE_MSK                BIT7
#define CAN2RTIE_ROIE_MSK               BIT6
#define CAN2RTIE_RFIE_MSK               BIT5
#define CAN2RTIE_RAFIE_MSK              BIT4
#define CAN2RTIE_TPIE_MSK               BIT3
#define CAN2RTIE_TSIE_MSK               BIT2
#define CAN2RTIE_EIE_MSK                BIT1
#define CAN2ERRINT_EPIE_MSK             BIT5
#define CAN2ERRINT_ALIE_MSK             BIT3
#define CAN2ERRINT_BEIE_MSK             BIT1
#define CAN2_EnableReceiveInt()         SET_CAN_BIT(CAN2_RTIE, CAN2RTIE_RIE_MSK)
#define CAN2_EnableRBOverrunInt()       SET_CAN_BIT(CAN2_RTIE, CAN2RTIE_ROIE_MSK)
#define CAN2_EnableRBFIFOFullInt()      SET_CAN_BIT(CAN2_RTIE, CAN2RTIE_RFIE_MSK)
#define CAN2_EnableRBAlmostFullInt()    SET_CAN_BIT(CAN2_RTIE, CAN2RTIE_RAFIE_MSK)
#define CAN2_EnablePTBTransmitInt()     SET_CAN_BIT(CAN2_RTIE, CAN2RTIE_TPIE_MSK)
#define CAN2_EnableSTBTransmitInt()     SET_CAN_BIT(CAN2_RTIE, CAN2RTIE_TSIE_MSK)
#define CAN2_EnableErrorInt()           SET_CAN_BIT(CAN2_RTIE, CAN2RTIE_EIE_MSK)
#define CAN2_EnableErrorPassiveInt()    SET_CAN_BIT(CAN2_ERRINT, CAN2ERRINT_EPIE_MSK)
#define CAN2_EnableArbitrateLostInt()   SET_CAN_BIT(CAN2_ERRINT, CAN2ERRINT_ALIE_MSK)
#define CAN2_EnableBusErrorInt()        SET_CAN_BIT(CAN2_ERRINT, CAN2ERRINT_BEIE_MSK)
#define CAN2_DisableReceiveInt()        CLR_CAN_BIT(CAN2_RTIE, CAN2RTIE_RIE_MSK)
#define CAN2_DisableRBOverrunInt()      CLR_CAN_BIT(CAN2_RTIE, CAN2RTIE_ROIE_MSK)
#define CAN2_DisableRBFIFOFullInt()     CLR_CAN_BIT(CAN2_RTIE, CAN2RTIE_RFIE_MSK)
#define CAN2_DisableRBAlmostFullInt()   CLR_CAN_BIT(CAN2_RTIE, CAN2RTIE_RAFIE_MSK)
#define CAN2_DisablePTBTransmitInt()    CLR_CAN_BIT(CAN2_RTIE, CAN2RTIE_TPIE_MSK)
#define CAN2_DisableSTBTransmitInt()    CLR_CAN_BIT(CAN2_RTIE, CAN2RTIE_TSIE_MSK)
#define CAN2_DisableErrorInt()          CLR_CAN_BIT(CAN2_RTIE, CAN2RTIE_EIE_MSK)
#define CAN2_DisableErrorPassiveInt()   CLR_CAN_BIT(CAN2_ERRINT, CAN2ERRINT_EPIE_MSK)
#define CAN2_DisableArbitrateLostInt()  CLR_CAN_BIT(CAN2_ERRINT, CAN2ERRINT_ALIE_MSK)
#define CAN2_DisableBusErrorInt()       CLR_CAN_BIT(CAN2_ERRINT, CAN2ERRINT_BEIE_MSK)

#define CAN2RTIF_RIF_MSK                BIT7
#define CAN2RTIF_ROIF_MSK               BIT6
#define CAN2RTIF_RFIF_MSK               BIT5
#define CAN2RTIF_RAFIF_MSK              BIT4
#define CAN2RTIF_TPIF_MSK               BIT3
#define CAN2RTIF_TSIF_MSK               BIT2
#define CAN2RTIF_EIF_MSK                BIT1
#define CAN2RTIF_AIF_MSK                BIT0
#define CAN2ERRINT_EPIF_MSK             BIT4
#define CAN2ERRINT_ALIF_MSK             BIT2
#define CAN2ERRINT_BEIF_MSK             BIT0
#define CAN2RTIF_ALL_MSK                (BIT_ALL)
#define CAN2ERRINT_ALL_MSK              (BIT4 | BIT2 | BIT0)
#define CAN2_CheckReceive(f)            READ_REG_BIT((f), CAN2RTIF_RIF_MSK)
#define CAN2_CheckRBOverrun(f)          READ_REG_BIT((f), CAN2RTIF_ROIF_MSK)
#define CAN2_CheckRBFIFOFull(f)         READ_REG_BIT((f), CAN2RTIF_RFIF_MSK)
#define CAN2_CheckRBAlmostFull(f)       READ_REG_BIT((f), CAN2RTIF_RAFIF_MSK)
#define CAN2_CheckPTBTransmit(f)        READ_REG_BIT((f), CAN2RTIF_TPIF_MSK)
#define CAN2_CheckSTBTransmit(f)        READ_REG_BIT((f), CAN2RTIF_TSIF_MSK)
#define CAN2_CheckError(f)              READ_REG_BIT((f), CAN2RTIF_EIF_MSK)
#define CAN2_CheckAbort(f)              READ_REG_BIT((f), CAN2RTIF_AIF_MSK)
#define CAN2_CheckErrorPassive(f)       READ_REG_BIT((f), CAN2ERRINT_EPIF_MSK)
#define CAN2_CheckArbitrateLost(f)      READ_REG_BIT((f), CAN2ERRINT_ALIF_MSK)
#define CAN2_CheckBusError(f)           READ_REG_BIT((f), CAN2ERRINT_BEIF_MSK)

#define CAN2_ReadIntStatus()            (READ_CAN(CAN2_RTIF) & CAN2RTIF_ALL_MSK)
#define CAN2_ReadErrorStatus()          (READ_CAN(CAN2_ERRINT) & CAN2ERRINT_ALL_MSK)
#define CAN2_ClearFlags(n)              WRITE_CAN(CAN2_RTIF, ((n) & CAN2RTIF_ALL_MSK))
#define CAN2_ClearErrorFlags(n)         WRITE_CAN(CAN2_ERRINT, ((n) & CAN2ERRINT_ALL_MSK))

#define CAN2RTIE_TSFF_MSK               BIT0
#define CAN2_CheckTBFullFlag()          READ_CAN_BIT(CAN2_RTIE, CAN2RTIE_TSFF_MSK)

#define CAN2ERRINT_EWARN_MSK            BIT7
#define CAN2_CheckErrorWarningLimit()   READ_CAN_BIT(CAN2_ERRINT, CAN2ERRINT_EWARN_MSK)

#define CAN2LIMIT_AFWL_MSK              (BIT_HN)
#define CAN2LIMIT_EWL_MSK               (BIT_LN)
#define CAN2_SetAFWLimit(n)             MODIFY_CAN(CAN2_LIMIT, CAN2LIMIT_AFWL_MSK, ((n) << 4))
#define CAN2_SetEWLimit(n)              MODIFY_CAN(CAN2_LIMIT, CAN2LIMIT_EWL_MSK, ((n) << 0))
#define CAN2_SetEWLimit_8()             CAN2_SetEWLimit(0)
#define CAN2_SetEWLimit_16()            CAN2_SetEWLimit(1)
#define CAN2_SetEWLimit_24()            CAN2_SetEWLimit(2)
#define CAN2_SetEWLimit_32()            CAN2_SetEWLimit(3)
#define CAN2_SetEWLimit_40()            CAN2_SetEWLimit(4)
#define CAN2_SetEWLimit_48()            CAN2_SetEWLimit(5)
#define CAN2_SetEWLimit_56()            CAN2_SetEWLimit(6)
#define CAN2_SetEWLimit_64()            CAN2_SetEWLimit(7)
#define CAN2_SetEWLimit_72()            CAN2_SetEWLimit(8)
#define CAN2_SetEWLimit_80()            CAN2_SetEWLimit(9)
#define CAN2_SetEWLimit_88()            CAN2_SetEWLimit(10)
#define CAN2_SetEWLimit_96()            CAN2_SetEWLimit(11)
#define CAN2_SetEWLimit_104()           CAN2_SetEWLimit(12)
#define CAN2_SetEWLimit_112()           CAN2_SetEWLimit(13)
#define CAN2_SetEWLimit_120()           CAN2_SetEWLimit(14)
#define CAN2_SetEWLimit_128()           CAN2_SetEWLimit(15)

#define CAN2SBT_SEG2_MSK                (~(BIT7))
#define CAN2SBT_SJW_MSK                 (~(BIT7))
#define CAN2_SetSBT_SEG1(n)             WRITE_CAN(CAN2_S_SEG1, (n))
#define CAN2_SetSBT_SEG2(n)             MODIFY_CAN(CAN2_S_SEG2, CAN2SBT_SEG2_MSK, ((n) << 0))
#define CAN2_SetSBT_SJW(n)              MODIFY_CAN(CAN2_S_SJW, CAN2SBT_SJW_MSK, ((n) << 0))
#define CAN2_SetSBT_PRESC(n)            WRITE_CAN(CAN2_S_PRESC, (n))

