fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CAN2FBT_SEG1_MSK                (BIT4 | BIT_LN)
#define CAN2FBT_SEG2_MSK                (BIT_LN)
#define CAN2FBT_SJW_MSK                 (BIT_LN)
#define CAN2_SetFBT_SEG1(n)             MODIFY_CAN(CAN2_F_SEG1, CAN2FBT_SEG1_MSK, ((n) << 0))
#define CAN2_SetFBT_SEG2(n)             MODIFY_CAN(CAN2_F_SEG2, CAN2FBT_SEG2_MSK, ((n) << 0))
#define CAN2_SetFBT_SJW(n)              MODIFY_CAN(CAN2_F_SJW, CAN2FBT_SJW_MSK, ((n) << 0))
#define CAN2_SetFBT_PRESC(n)            WRITE_CAN(CAN2_F_PRESC, (n))

#define CAN2EALCAP_KOER_MSK             (BIT7 | BIT6 | BIT5)
#define CAN2EALCAP_ALC_MSK              (BIT4 | BIT_LN)
#define CAN2_ReadErrorCode()            READ_CAN_BIT(CAN2_EALCAP, CAN2EALCAP_KOER_MSK)
#define CAN2_ReadArbitrationLost()      READ_CAN_BIT(CAN2_EALCAP, CAN2EALCAP_ALC_MSK)

#define CAN2TDC_TDCEN_MSK               BIT7
#define CAN2_EnableTDC()                SET_CAN_BIT(CAN2_TDC, CAN2TDC_TDCEN_MSK)
#define CAN2_DisableTDC()               CLR_CAN_BIT(CAN2_TDC, CAN2TDC_TDCEN_MSK)

#define CAN2TDC_SSPOFF_MSK              (~(BIT7))
#define CAN2_SetSSPOffset(n)            MODIFY_CAN(CAN2_TDC, CAN2TDC_SSPOFF_MSK, ((n) << 0))

#define CAN2_GetRxErrorCouter()         READ_CAN(CAN2_RECNT)
#define CAN2_GetTxErrorCouter()         READ_CAN(CAN2_TECNT)

#define CAN2ACFCTRL_SEL_MSK             BIT5
#define CAN2_SelectACFID()              CLR_CAN_BIT(CAN2_ACFCTRL, CAN2ACFCTRL_SEL_MSK)
#define CAN2_SelectACFMask()            SET_CAN_BIT(CAN2_ACFCTRL, CAN2ACFCTRL_SEL_MSK)

#define CAN2ACFCTRL_ADR_MSK             (BIT_LN)
#define CAN2_SetACFAddress(n)           MODIFY_CAN(CAN2_ACFCTRL, CAN2ACFCTRL_ADR_MSK, ((n) << 0))

#define CAN2TIMECFG_TSPOS_MSK           BIT1
#define CAN2_TimeStampAtSOF()           CLR_CAN_BIT(CAN2_TIMECFG, CAN2TIMECFG_TSPOS_MSK)
#define CAN2_TimeStampAtEOF()           SET_CAN_BIT(CAN2_TIMECFG, CAN2TIMECFG_TSPOS_MSK)

#define CAN2TIMECFG_TSEN_MSK            BIT0
#define CAN2_DisableTimeStamp()         CLR_CAN_BIT(CAN2_TIMECFG, CAN2TIMECFG_TSEN_MSK)
#define CAN2_EnableTimeStamp()          SET_CAN_BIT(CAN2_TIMECFG, CAN2TIMECFG_TSEN_MSK)

#define CAN2_EnableACFL(n)              SET_CAN_BIT(CAN2_ACF_EN0, BIT(n))
#define CAN2_EnableACFH(n)              SET_CAN_BIT(CAN2_ACF_EN1, BIT(n))
#define CAN2_DisableACFL(n)             CLR_CAN_BIT(CAN2_ACF_EN0, BIT(n))
#define CAN2_DisableACFH(n)             CLR_CAN_BIT(CAN2_ACF_EN1, BIT(n))
#define CAN2_EnableACF(n)               SET_CAN_BIT(CAN2_ACF_EN[(n) >> 3], (1 << ((n) & 0x07)))
#define CAN2_DisableACF(n)              CLR_CAN_BIT(CAN2_ACF_EN[(n) >> 3], (1 << ((n) & 0x07)))

#define CAN2ACF3_CODE_MSK               (BIT4 | BIT_LN)
#define CAN2_SetACF0(n)                 WRITE_CAN(CAN2_ACF0, (n))
#define CAN2_SetACF1(n)                 WRITE_CAN(CAN2_ACF1, (n))
#define CAN2_SetACF2(n)                 WRITE_CAN(CAN2_ACF2, (n))
#define CAN2_SetACF3(n)                 MODIFY_CAN(CAN2_ACF3, CAN2ACF3_CODE_MSK, ((n) << 0))
#define CAN2_SetACF(n)                  CAN2_SetACF0(BYTE0(n)); \
                                        CAN2_SetACF1(BYTE1(n)); \
                                        CAN2_SetACF2(BYTE2(n)); \
                                        CAN2_SetACF3(BYTE3(n))

#define CAN2ACF3_AIDE_MSK               BIT5
#define CAN2ACF3_AIDEE_MSK              BIT6
#define CAN2_ACFAcceptStdFrame()        SET_CAN_BIT(CAN2_ACF3, CAN2ACF3_AIDEE_MSK); \
                                        CLR_CAN_BIT(CAN2_ACF3, CAN2ACF3_AIDE_MSK)
#define CAN2_ACFAcceptExtFrame()        SET_CAN_BIT(CAN2_ACF3, CAN2ACF3_AIDEE_MSK); \
                                        SET_CAN_BIT(CAN2_ACF3, CAN2ACF3_AIDE_MSK)
#define CAN2_ACFAcceptAllFrame()        CLR_CAN_BIT(CAN2_ACF3, CAN2ACF3_AIDEE_MSK)

#define CAN2_ReadVersion()              MAKEWORD(READ_CAN(CAN2_VER0), READ_CAN(CAN2_VER1))

#define CAN2TBSLOT_TBE_MSK              BIT7
#define CAN2TBSLOT_TBF_MSK              BIT6
#define CAN2_SetTBSlotToEmpty()         SET_CAN_BIT(CAN2_TBSLOT, CAN2TBSLOT_TBE_MSK)
#define CAN2_SetTBSlotToFull()          SET_CAN_BIT(CAN2_TBSLOT, CAN2TBSLOT_TBF_MSK)

#define CAN2TBSLOT_TBPTR_MSK            (BIT_LN)
#define CAN2_SetTBSlotPointer(n)        MODIFY_CAN(CAN2_TBSLOT, CAN2TBSLOT_TBPTR_MSK, ((n) << 0))

#define CAN2TTCFG_WTIE_MSK              BIT7
#define CAN2TTCFG_WTIF_MSK              BIT6
#define CAN2_EnableWatchTriggerInt()    SET_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_WTIE_MSK)
#define CAN2_DisableWatchTriggerInt()   CLR_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_WTIE_MSK)
#define CAN2_CheckWatchTriggerFlag()    READ_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_WTIF_MSK)

#define CAN2TTCFG_TEIF_MSK              BIT5
#define CAN2TTCFG_TTIE_MSK              BIT4
#define CAN2TTCFG_TTIF_MSK              BIT3
#define CAN2_EnableTimeTriggerInt()     SET_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_TTIE_MSK)
#define CAN2_DisableTimeTriggerInt()    CLR_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_TTIE_MSK)
#define CAN2_CheckTimeTriggerFlag()     READ_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_TTIF_MSK)
#define CAN2_CheckTriggerErrorFlag()    READ_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_TEIF_MSK)

#define CAN2TTCFG_PRESC_MSK             (BIT2 | BIT1)
#define CAN2_SetTTTimerPrescale(n)      MODIFY_CAN(CAN2_TTCFG, CAN2TTCFG_PRESC_MSK, ((n) << 1))
#define CAN2_SetTTTimerPrescale1()      CAN2_SetTTTimerPrescale(0)
#define CAN2_SetTTTimerPrescale2()      CAN2_SetTTTimerPrescale(1)
#define CAN2_SetTTTimerPrescale4()      CAN2_SetTTTimerPrescale(2)
#define CAN2_SetTTTimerPrescale8()      CAN2_SetTTTimerPrescale(3)

#define CAN2TTCFG_TTEN_MSK              BIT0
#define CAN2_EnableTimeTrigger()        SET_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_TTEN_MSK)
#define CAN2_DisableTimeTrigger()       CLR_CAN_BIT(CAN2_TTCFG, CAN2TTCFG_TTEN_MSK)

#define CAN2REFMSG3_REFID_MSK           (BIT4 | BIT_LN)
#define CAN2_SetREFID0(n)               WRITE_CAN(CAN2_REF_MSG0, (n))
#define CAN2_SetREFID1(n)               WRITE_CAN(CAN2_REF_MSG1, (n))
#define CAN2_SetREFID2(n)               WRITE_CAN(CAN2_REF_MSG2, (n))
#define CAN2_SetREFID3(n)               MODIFY_CAN(CAN2_REF_MSG3, CAN2REFMSG3_REFID_MSK, ((n) << 0))
#define CAN2_SetREFID(n)                CAN2_SetREFID0(BYTE0(n)); \
                                        CAN2_SetREFID1(BYTE1(n)); \
                                        CAN2_SetREFID2(BYTE2(n)); \
                                        CAN2_SetREFID3(BYTE3(n))

#define CAN2REFMSG3_REFIDE_MSK          BIT7
#define CAN2_StandardREFID()            CLR_CAN_BIT(CAN2_REF_MSG3, CAN2REFMSG3_REFIDE_MSK)
#define CAN2_ExtendedREFID()            SET_CAN_BIT(CAN2_REF_MSG3, CAN2REFMSG3_REFIDE_MSK)

