fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define CAN2TRIGCFG0_TTPTR_MSK          (BIT5 | BIT4 | BIT_LN)
#define CAN2_SetTTBSlotPointer(n)       MODIFY_CAN(CAN2_TRIG_CFG0, CAN2TRIGCFG0_TTPTR_MSK, ((n) << 0))

#define CAN2TRIGCFG1_TTYPE_MSK          (BIT2 | BIT1 | BIT0)
#define CAN2_SetTriggerType(n)          MODIFY_CAN(CAN2_TRIG_CFG1, CAN2TRIGCFG1_TTYPE_MSK, ((n) << 0))

#define CAN2TRIGCFG1_TEWE_MSK           (BIT_HN)
#define CAN2_SetTransEnableWindow(n)    MODIFY_CAN(CAN2_TRIG_CFG1, CAN2TRIGCFG1_TEWE_MSK, ((n) << 4))

#define CAN2_SetTriggerTime(n)          (WRITE_CAN(CAN2_TT_CFG0, LOBYTE(n)), WRITE_CAN(CAN2_TT_CFG1, HIBYTE(n)))
#define CAN2_SetWatchTriggerTime(n)     (WRITE_CAN(CAN2_TT_WTRIG0, LOBYTE(n)), WRITE_CAN(CAN2_TT_WTRIG1, HIBYTE(n)))

/////////////////////////////////////////////////

#define PWMAENO_ENO1P_MSK               BIT0
#define PWMAENO_ENO1N_MSK               BIT1
#define PWMAENO_ENO2P_MSK               BIT2
#define PWMAENO_ENO2N_MSK               BIT3
#define PWMAENO_ENO3P_MSK               BIT4
#define PWMAENO_ENO3N_MSK               BIT5
#define PWMAENO_ENO4P_MSK               BIT6
#define PWMAENO_ENO4N_MSK               BIT7
#define PWMAENO2_ENO5P_MSK              BIT0
#define PWMAENO2_ENO6P_MSK              BIT2
#define PWMA_EnablePWM1POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define PWMA_DisablePWM1POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define PWMA_EnablePWM1NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define PWMA_DisablePWM1NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define PWMA_EnablePWM2POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define PWMA_DisablePWM2POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define PWMA_EnablePWM2NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define PWMA_DisablePWM2NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define PWMA_EnablePWM3POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define PWMA_DisablePWM3POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define PWMA_EnablePWM3NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define PWMA_DisablePWM3NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define PWMA_EnablePWM4POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define PWMA_DisablePWM4POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define PWMA_EnablePWM4NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)
#define PWMA_DisablePWM4NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)
#define PWMA_EnablePWM5POutput()        SET_REG_BIT(PWMA_ENO2, PWMAENO2_ENO5P_MSK)
#define PWMA_DisablePWM5POutput()       CLR_REG_BIT(PWMA_ENO2, PWMAENO2_ENO5P_MSK)
#define PWMA_EnablePWM6POutput()        SET_REG_BIT(PWMA_ENO2, PWMAENO2_ENO6P_MSK)
#define PWMA_DisablePWM6POutput()       CLR_REG_BIT(PWMA_ENO2, PWMAENO2_ENO6P_MSK)

#define HSPWMA_EnablePWM1POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define HSPWMA_DisablePWM1POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define HSPWMA_EnablePWM1NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define HSPWMA_DisablePWM1NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define HSPWMA_EnablePWM2POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define HSPWMA_DisablePWM2POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define HSPWMA_EnablePWM2NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define HSPWMA_DisablePWM2NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define HSPWMA_EnablePWM3POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define HSPWMA_DisablePWM3POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define HSPWMA_EnablePWM3NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define HSPWMA_DisablePWM3NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define HSPWMA_EnablePWM4POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define HSPWMA_DisablePWM4POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define HSPWMA_EnablePWM4NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)
#define HSPWMA_DisablePWM4NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)
#define HSPWMA_EnablePWM5POutput()      SET_HSPWMA_BIT(PWMA_ENO2, PWMAENO2_ENO5P_MSK)
#define HSPWMA_DisablePWM5POutput()     CLR_HSPWMA_BIT(PWMA_ENO2, PWMAENO2_ENO5P_MSK)
#define HSPWMA_EnablePWM6POutput()      SET_HSPWMA_BIT(PWMA_ENO2, PWMAENO2_ENO6P_MSK)
#define HSPWMA_DisablePWM6POutput()     CLR_HSPWMA_BIT(PWMA_ENO2, PWMAENO2_ENO6P_MSK)

#define PWMAIOAUX_AUX1P_MSK             BIT0
#define PWMAIOAUX_AUX1N_MSK             BIT1
#define PWMAIOAUX_AUX2P_MSK             BIT2
#define PWMAIOAUX_AUX2N_MSK             BIT3
#define PWMAIOAUX_AUX3P_MSK             BIT4
#define PWMAIOAUX_AUX3N_MSK             BIT5
#define PWMAIOAUX_AUX4P_MSK             BIT6
#define PWMAIOAUX_AUX4N_MSK             BIT7
#define PWMAIOAUX2_AUX5P_MSK            BIT0
#define PWMAIOAUX2_AUX6P_MSK            BIT2
#define PWMA_EnoCtrlPWM1P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define PWMA_EnoBrkCtrlPWM1P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define PWMA_EnoCtrlPWM1N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define PWMA_EnoBrkCtrlPWM1N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define PWMA_EnoCtrlPWM2P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define PWMA_EnoBrkCtrlPWM2P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define PWMA_EnoCtrlPWM2N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define PWMA_EnoBrkCtrlPWM2N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define PWMA_EnoCtrlPWM3P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define PWMA_EnoBrkCtrlPWM3P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define PWMA_EnoCtrlPWM3N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define PWMA_EnoBrkCtrlPWM3N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define PWMA_EnoCtrlPWM4P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define PWMA_EnoBrkCtrlPWM4P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define PWMA_EnoCtrlPWM4N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)
#define PWMA_EnoBrkCtrlPWM4N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)
#define PWMA_EnoCtrlPWM5P()             CLR_REG_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX5P_MSK)
#define PWMA_EnoBrkCtrlPWM5P()          SET_REG_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX5P_MSK)
#define PWMA_EnoCtrlPWM6P()             CLR_REG_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX6P_MSK)
#define PWMA_EnoBrkCtrlPWM6P()          SET_REG_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX6P_MSK)

#define HSPWMA_EnoCtrlPWM1P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define HSPWMA_EnoBrkCtrlPWM1P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define HSPWMA_EnoCtrlPWM1N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define HSPWMA_EnoBrkCtrlPWM1N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define HSPWMA_EnoCtrlPWM2P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define HSPWMA_EnoBrkCtrlPWM2P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define HSPWMA_EnoCtrlPWM2N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define HSPWMA_EnoBrkCtrlPWM2N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define HSPWMA_EnoCtrlPWM3P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define HSPWMA_EnoBrkCtrlPWM3P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define HSPWMA_EnoCtrlPWM3N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define HSPWMA_EnoBrkCtrlPWM3N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define HSPWMA_EnoCtrlPWM4P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define HSPWMA_EnoBrkCtrlPWM4P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define HSPWMA_EnoCtrlPWM4N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)
#define HSPWMA_EnoBrkCtrlPWM4N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)
#define HSPWMA_EnoCtrlPWM5P()           CLR_HSPWMA_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX5P_MSK)
#define HSPWMA_EnoBrkCtrlPWM5P()        SET_HSPWMA_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX5P_MSK)
#define HSPWMA_EnoCtrlPWM6P()           CLR_HSPWMA_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX6P_MSK)
#define HSPWMA_EnoBrkCtrlPWM6P()        SET_HSPWMA_BIT(PWMA_IOAUX2, PWMAIOAUX2_AUX6P_MSK)

#define PWMACR1_ARPE_MSK                BIT7
#define PWMA_UnbufferARR()              CLR_REG_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)
#define PWMA_BufferARR()                SET_REG_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)

#define HSPWMA_UnbufferARR()            CLR_HSPWMA_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)
#define HSPWMA_BufferARR()              SET_HSPWMA_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)

#define PWMACR1_CMS_MSK                 (BIT6 | BIT5)
#define PWMA_SetAlignMode(n)            MODIFY_REG(PWMA_CR1,  PWMACR1_CMS_MSK, ((n) << 5))
#define PWMA_EdgeAlignMode()            PWMA_SetAlignMode(0)
#define PWMA_CenterAlignMode1()         PWMA_SetAlignMode(1)
#define PWMA_CenterAlignMode2()         PWMA_SetAlignMode(2)
#define PWMA_CenterAlignMode3()         PWMA_SetAlignMode(3)

#define HSPWMA_SetAlignMode(n)          MODIFY_HSPWMA(PWMA_CR1,  PWMACR1_CMS_MSK, ((n) << 5))
#define HSPWMA_EdgeAlignMode()          HSPWMA_SetAlignMode(0)
#define HSPWMA_CenterAlignMode1()       HSPWMA_SetAlignMode(1)
#define HSPWMA_CenterAlignMode2()       HSPWMA_SetAlignMode(2)
#define HSPWMA_CenterAlignMode3()       HSPWMA_SetAlignMode(3)

#define PWMACR1_DIR_MSK                 BIT4
#define PWMA_UpCounter()                CLR_REG_BIT(PWMA_CR1, PWMACR1_DIR_MSK)
#define PWMA_DownCounter()              SET_REG_BIT(PWMA_CR1, PWMACR1_DIR_MSK)

