fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMA_UpCounter()              CLR_HSPWMA_BIT(PWMA_CR1, PWMACR1_DIR_MSK)
#define HSPWMA_DownCounter()            SET_HSPWMA_BIT(PWMA_CR1, PWMACR1_DIR_MSK)

#define PWMACR1_OPM_MSK                 BIT3
#define PWMA_ContinueMode()             CLR_REG_BIT(PWMA_CR1, PWMACR1_OPM_MSK)
#define PWMA_OnePulseMode()             SET_REG_BIT(PWMA_CR1, PWMACR1_OPM_MSK)

#define HSPWMA_ContinueMode()           CLR_HSPWMA_BIT(PWMA_CR1, PWMACR1_OPM_MSK)
#define HSPWMA_OnePulseMode()           SET_HSPWMA_BIT(PWMA_CR1, PWMACR1_OPM_MSK)

#define PWMACR1_URS_MSK                 BIT2
#define PWMA_UpdateRequestMode1()       SET_REG_BIT(PWMA_CR1, PWMACR1_URS_MSK)
#define PWMA_UpdateRequestMode2()       CLR_REG_BIT(PWMA_CR1, PWMACR1_URS_MSK)

#define HSPWMA_UpdateRequestMode1()     SET_HSPWMA_BIT(PWMA_CR1, PWMACR1_URS_MSK)
#define HSPWMA_UpdateRequestMode2()     CLR_HSPWMA_BIT(PWMA_CR1, PWMACR1_URS_MSK)

#define PWMACR1_UDIS_MSK                BIT1
#define PWMA_EnableUpdate()             CLR_REG_BIT(PWMA_CR1, PWMACR1_UDIS_MSK)
#define PWMA_DisableUpdate()            SET_REG_BIT(PWMA_CR1, PWMACR1_UDIS_MSK)

#define HSPWMA_EnableUpdate()           CLR_HSPWMA_BIT(PWMA_CR1, PWMACR1_UDIS_MSK)
#define HSPWMA_DisableUpdate()          SET_HSPWMA_BIT(PWMA_CR1, PWMACR1_UDIS_MSK)

#define PWMACR1_CEN_MSK                 BIT0
#define PWMA_Run()                      SET_REG_BIT(PWMA_CR1, PWMACR1_CEN_MSK)
#define PWMA_Stop()                     CLR_REG_BIT(PWMA_CR1, PWMACR1_CEN_MSK)

#define HSPWMA_Run()                    SET_HSPWMA_BIT(PWMA_CR1, PWMACR1_CEN_MSK)
#define HSPWMA_Stop()                   CLR_HSPWMA_BIT(PWMA_CR1, PWMACR1_CEN_MSK)

#define PWMACR2_TIS_MSK                 BIT7
#define PWMA_PWM1PToTI()                CLR_REG_BIT(PWMA_CR2, PWMACR2_TIS_MSK)
#define PWMA_Xor1P2P3PToTI()            SET_REG_BIT(PWMA_CR2, PWMACR2_TIS_MSK)

#define HSPWMA_PWM1PToTI()              CLR_HSPWMA_BIT(PWMA_CR2, PWMACR2_TIS_MSK)
#define HSPWMA_Xor1P2P3PToTI()          SET_HSPWMA_BIT(PWMA_CR2, PWMACR2_TIS_MSK)

#define PWMACR2_MMS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMA_SelectTRGO(n)              MODIFY_REG(PWMA_CR2,  PWMACR2_MMS_MSK, ((n) << 4))
#define PWMA_ResetAsTRGO()              PWMA_SelectTRGO(0)
#define PWMA_EnableAsTRGO()             PWMA_SelectTRGO(1)
#define PWMA_UpdateAsTRGO()             PWMA_SelectTRGO(2)
#define PWMA_MatchAsTRGO()              PWMA_SelectTRGO(3)
#define PWMA_OC1REFAsTRGO()             PWMA_SelectTRGO(4)
#define PWMA_OC2REFAsTRGO()             PWMA_SelectTRGO(5)
#define PWMA_OC3REFAsTRGO()             PWMA_SelectTRGO(6)
#define PWMA_OC4REFAsTRGO()             PWMA_SelectTRGO(7)

#define HSPWMA_SelectTRGO(n)            MODIFY_HSPWMA(PWMA_CR2,  PWMACR2_MMS_MSK, ((n) << 4))
#define HSPWMA_ResetAsTRGO()            HSPWMA_SelectTRGO(0)
#define HSPWMA_EnableAsTRGO()           HSPWMA_SelectTRGO(1)
#define HSPWMA_UpdateAsTRGO()           HSPWMA_SelectTRGO(2)
#define HSPWMA_MatchAsTRGO()            HSPWMA_SelectTRGO(3)
#define HSPWMA_OC1REFAsTRGO()           HSPWMA_SelectTRGO(4)
#define HSPWMA_OC2REFAsTRGO()           HSPWMA_SelectTRGO(5)
#define HSPWMA_OC3REFAsTRGO()           HSPWMA_SelectTRGO(6)
#define HSPWMA_OC4REFAsTRGO()           HSPWMA_SelectTRGO(7)

#define PWMACR2_COMS_MSK                BIT2
#define PWMA_CCOCUpdateMode0()          CLR_REG_BIT(PWMA_CR2, PWMACR2_COMS_MSK)
#define PWMA_CCOCUpdateMode1()          SET_REG_BIT(PWMA_CR2, PWMACR2_COMS_MSK)

#define HSPWMA_CCOCUpdateMode0()        CLR_HSPWMA_BIT(PWMA_CR2, PWMACR2_COMS_MSK)
#define HSPWMA_CCOCUpdateMode1()        SET_HSPWMA_BIT(PWMA_CR2, PWMACR2_COMS_MSK)

#define PWMACR2_CCPC_MSK                BIT0
#define PWMA_UnbufferCCOC()             CLR_REG_BIT(PWMA_CR2, PWMACR2_CCPC_MSK)
#define PWMA_BufferCCOC()               SET_REG_BIT(PWMA_CR2, PWMACR2_CCPC_MSK)

#define HSPWMA_UnbufferCCOC()           CLR_HSPWMA_BIT(PWMA_CR2, PWMACR2_CCPC_MSK)
#define HSPWMA_BufferCCOC()             SET_HSPWMA_BIT(PWMA_CR2, PWMACR2_CCPC_MSK)

#define PWMASMCR_MSM_MSK                BIT7
#define PWMA_StandaloneMode()           CLR_REG_BIT(PWMA_SMCR, PWMASMCR_MSM_MSK)
#define PWMA_MasterSlaveMode()          SET_REG_BIT(PWMA_SMCR, PWMASMCR_MSM_MSK)

#define HSPWMA_StandaloneMode()         CLR_HSPWMA_BIT(PWMA_SMCR, PWMASMCR_MSM_MSK)
#define HSPWMA_MasterSlaveMode()        SET_HSPWMA_BIT(PWMA_SMCR, PWMASMCR_MSM_MSK)

#define PWMASMCR_TS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMA_SelectTRGI(n)              MODIFY_REG(PWMA_SMCR,  PWMASMCR_TS_MSK, ((n) << 4))
#define PWMA_DisableTRGI()              PWMA_SelectTRGI(0)
#define PWMA_ITR2AsTRGI()               PWMA_SelectTRGI(2)
#define PWMA_TI1FEDAsTRGI()             PWMA_SelectTRGI(4)
#define PWMA_TI1FP1AsTRGI()             PWMA_SelectTRGI(5)
#define PWMA_TI2FP2AsTRGI()             PWMA_SelectTRGI(6)
#define PWMA_ETRFAsTRGI()               PWMA_SelectTRGI(7)

#define HSPWMA_SelectTRGI(n)            MODIFY_HSPWMA(PWMA_SMCR,  PWMASMCR_TS_MSK, ((n) << 4))
#define HSPWMA_DisableTRGI()            HSPWMA_SelectTRGI(0)
#define HSPWMA_ITR2AsTRGI()             HSPWMA_SelectTRGI(2)
#define HSPWMA_TI1FEDAsTRGI()           HSPWMA_SelectTRGI(4)
#define HSPWMA_TI1FP1AsTRGI()           HSPWMA_SelectTRGI(5)
#define HSPWMA_TI2FP2AsTRGI()           HSPWMA_SelectTRGI(6)
#define HSPWMA_ETRFAsTRGI()             HSPWMA_SelectTRGI(7)

#define PWMASMCR_SMS_MSK                (BIT2 | BIT1 | BIT0)
#define PWMA_SetClockMode(n)            MODIFY_REG(PWMA_SMCR,  PWMASMCR_SMS_MSK, ((n) << 0))
#define PWMA_InternalClockMode()        PWMA_SetClockMode(0)
#define PWMA_EncoderMode1()             PWMA_SetClockMode(1)
#define PWMA_EncoderMode2()             PWMA_SetClockMode(2)
#define PWMA_EncoderMode3()             PWMA_SetClockMode(3)
#define PWMA_TriggerResetMode()         PWMA_SetClockMode(4)
#define PWMA_TriggerGateMode()          PWMA_SetClockMode(5)
#define PWMA_TriggerStartMode()         PWMA_SetClockMode(6)
#define PWMA_ExternalClockMode()        PWMA_SetClockMode(7)

#define HSPWMA_SetClockMode(n)          MODIFY_HSPWMA(PWMA_SMCR,  PWMASMCR_SMS_MSK, ((n) << 0))
#define HSPWMA_InternalClockMode()      HSPWMA_SetClockMode(0)
#define HSPWMA_EncoderMode1()           HSPWMA_SetClockMode(1)
#define HSPWMA_EncoderMode2()           HSPWMA_SetClockMode(2)
#define HSPWMA_EncoderMode3()           HSPWMA_SetClockMode(3)
#define HSPWMA_TriggerResetMode()       HSPWMA_SetClockMode(4)
#define HSPWMA_TriggerGateMode()        HSPWMA_SetClockMode(5)
#define HSPWMA_TriggerStartMode()       HSPWMA_SetClockMode(6)
#define HSPWMA_ExternalClockMode()      HSPWMA_SetClockMode(7)

#define PWMAETR_ETP_MSK                 BIT7
#define PWMA_ETRNonInverted()           CLR_REG_BIT(PWMA_ETR, PWMAETR_ETP_MSK)
#define PWMA_ETRInverted()              SET_REG_BIT(PWMA_ETR, PWMAETR_ETP_MSK)

#define HSPWMA_ETRNonInverted()         CLR_HSPWMA_BIT(PWMA_ETR, PWMAETR_ETP_MSK)
#define HSPWMA_ETRInverted()            SET_HSPWMA_BIT(PWMA_ETR, PWMAETR_ETP_MSK)

#define PWMAETR_ECE_MSK                 BIT6
#define PWMA_DisableExternalClock2()    CLR_REG_BIT(PWMA_ETR, PWMAETR_ECE_MSK)
#define PWMA_EnableExternalClock2()     SET_REG_BIT(PWMA_ETR, PWMAETR_ECE_MSK)

#define HSPWMA_DisableExternalClock2()  CLR_HSPWMA_BIT(PWMA_ETR, PWMAETR_ECE_MSK)
#define HSPWMA_EnableExternalClock2()   SET_HSPWMA_BIT(PWMA_ETR, PWMAETR_ECE_MSK)

#define PWMAETR_ETPS_MSK                (BIT5 | BIT4)
#define PWMA_SetETRDivider(n)           MODIFY_REG(PWMA_ETR,  PWMAETR_ETPS_MSK, ((n) << 4))
#define PWMA_ETRDivider1()              PWMA_SetETRDivider(0)
#define PWMA_ETRDivider2()              PWMA_SetETRDivider(1)
#define PWMA_ETRDivider4()              PWMA_SetETRDivider(2)
#define PWMA_ETRDivider8()              PWMA_SetETRDivider(3)

