fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMA_SetETRDivider(n)         MODIFY_HSPWMA(PWMA_ETR,  PWMAETR_ETPS_MSK, ((n) << 4))
#define HSPWMA_ETRDivider1()            HSPWMA_SetETRDivider(0)
#define HSPWMA_ETRDivider2()            HSPWMA_SetETRDivider(1)
#define HSPWMA_ETRDivider4()            HSPWMA_SetETRDivider(2)
#define HSPWMA_ETRDivider8()            HSPWMA_SetETRDivider(3)

#define PWMAETR_ETF_MSK                 (BIT_LN)
#define PWMA_SetETRFilter(n)            MODIFY_REG(PWMA_ETR,  PWMAETR_ETF_MSK, ((n) << 0))
#define PWMA_ETRFilter1()               PWMA_SetETRFilter(0)
#define PWMA_ETRFilter2()               PWMA_SetETRFilter(1)
#define PWMA_ETRFilter4()               PWMA_SetETRFilter(2)
#define PWMA_ETRFilter8()               PWMA_SetETRFilter(3)
#define PWMA_ETRFilter12()              PWMA_SetETRFilter(4)
#define PWMA_ETRFilter16()              PWMA_SetETRFilter(5)
#define PWMA_ETRFilter24()              PWMA_SetETRFilter(6)
#define PWMA_ETRFilter32()              PWMA_SetETRFilter(7)
#define PWMA_ETRFilter48()              PWMA_SetETRFilter(8)
#define PWMA_ETRFilter64()              PWMA_SetETRFilter(9)
#define PWMA_ETRFilter80()              PWMA_SetETRFilter(10)
#define PWMA_ETRFilter96()              PWMA_SetETRFilter(11)
#define PWMA_ETRFilter128()             PWMA_SetETRFilter(12)
#define PWMA_ETRFilter160()             PWMA_SetETRFilter(13)
#define PWMA_ETRFilter192()             PWMA_SetETRFilter(14)
#define PWMA_ETRFilter256()             PWMA_SetETRFilter(15)

#define HSPWMA_SetETRFilter(n)          MODIFY_HSPWMA(PWMA_ETR,  PWMAETR_ETF_MSK, ((n) << 0))
#define HSPWMA_ETRFilter1()             HSPWMA_SetETRFilter(0)
#define HSPWMA_ETRFilter2()             HSPWMA_SetETRFilter(1)
#define HSPWMA_ETRFilter4()             HSPWMA_SetETRFilter(2)
#define HSPWMA_ETRFilter8()             HSPWMA_SetETRFilter(3)
#define HSPWMA_ETRFilter12()            HSPWMA_SetETRFilter(4)
#define HSPWMA_ETRFilter16()            HSPWMA_SetETRFilter(5)
#define HSPWMA_ETRFilter24()            HSPWMA_SetETRFilter(6)
#define HSPWMA_ETRFilter32()            HSPWMA_SetETRFilter(7)
#define HSPWMA_ETRFilter48()            HSPWMA_SetETRFilter(8)
#define HSPWMA_ETRFilter64()            HSPWMA_SetETRFilter(9)
#define HSPWMA_ETRFilter80()            HSPWMA_SetETRFilter(10)
#define HSPWMA_ETRFilter96()            HSPWMA_SetETRFilter(11)
#define HSPWMA_ETRFilter128()           HSPWMA_SetETRFilter(12)
#define HSPWMA_ETRFilter160()           HSPWMA_SetETRFilter(13)
#define HSPWMA_ETRFilter192()           HSPWMA_SetETRFilter(14)
#define HSPWMA_ETRFilter256()           HSPWMA_SetETRFilter(15)

#define PWMAEGR_BG_MSK                  BIT7
#define PWMAEGR_TG_MSK                  BIT6
#define PWMAEGR_COMG_MSK                BIT5
#define PWMAEGR_CC4G_MSK                BIT4
#define PWMAEGR_CC3G_MSK                BIT3
#define PWMAEGR_CC2G_MSK                BIT2
#define PWMAEGR_CC1G_MSK                BIT1
#define PWMAEGR_UG_MSK                  BIT0
#define PWMA_GenerateBreakEvent()       SET_REG_BIT(PWMA_EGR, PWMAEGR_BG_MSK)
#define PWMA_GenerateTriggerEvent()     SET_REG_BIT(PWMA_EGR, PWMAEGR_TG_MSK)
#define PWMA_GenerateCOMEvent()         SET_REG_BIT(PWMA_EGR, PWMAEGR_COMG_MSK)
#define PWMA_GenerateCC4Event()         SET_REG_BIT(PWMA_EGR, PWMAEGR_CC4G_MSK)
#define PWMA_GenerateCC3Event()         SET_REG_BIT(PWMA_EGR, PWMAEGR_CC3G_MSK)
#define PWMA_GenerateCC2Event()         SET_REG_BIT(PWMA_EGR, PWMAEGR_CC2G_MSK)
#define PWMA_GenerateCC1Event()         SET_REG_BIT(PWMA_EGR, PWMAEGR_CC1G_MSK)
#define PWMA_GenerateUpdateEvent()      SET_REG_BIT(PWMA_EGR, PWMAEGR_UG_MSK)

#define HSPWMA_GenerateBreakEvent()     SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_BG_MSK)
#define HSPWMA_GenerateTriggerEvent()   SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_TG_MSK)
#define HSPWMA_GenerateCOMEvent()       SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_COMG_MSK)
#define HSPWMA_GenerateCC4Event()       SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_CC4G_MSK)
#define HSPWMA_GenerateCC3Event()       SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_CC3G_MSK)
#define HSPWMA_GenerateCC2Event()       SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_CC2G_MSK)
#define HSPWMA_GenerateCC1Event()       SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_CC1G_MSK)
#define HSPWMA_GenerateUpdateEvent()    SET_HSPWMA_BIT(PWMA_EGR, PWMAEGR_UG_MSK)

#define PWMACCMR1_OC1CE_MSK             BIT7
#define PWMA_EnableETRFClearOC1REF()    SET_REG_BIT(PWMA_CCMR1, PWMACCMR1_OC1CE_MSK)
#define PWMA_DisableETRFClearOC1REF()   CLR_REG_BIT(PWMA_CCMR1, PWMACCMR1_OC1CE_MSK)

#define HSPWMA_EnableETRFClearOC1REF()  SET_HSPWMA_BIT(PWMA_CCMR1, PWMACCMR1_OC1CE_MSK)
#define HSPWMA_DisableETRFClearOC1REF() CLR_HSPWMA_BIT(PWMA_CCMR1, PWMACCMR1_OC1CE_MSK)

#define PWMACCMR1_OC1M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMACCMR1X_OC1M3_MSK            BIT0
#define PWMA_SetOC1OutputMode(n)        MODIFY_REG(PWMA_CCMR1,  PWMACCMR1_OC1M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMA_CCMR1X, PWMACCMR1X_OC1M3_MSK, (((n) >> 3) << 0))
#define PWMA_OC1REFFrozen()             PWMA_SetOC1OutputMode(0)
#define PWMA_OC1REFHighIfMatch()        PWMA_SetOC1OutputMode(1)
#define PWMA_OC1REFLowIfMatch()         PWMA_SetOC1OutputMode(2)
#define PWMA_OC1REFToggleIfMatch()      PWMA_SetOC1OutputMode(3)
#define PWMA_OC1REFForceLow()           PWMA_SetOC1OutputMode(4)
#define PWMA_OC1REFForceHigh()          PWMA_SetOC1OutputMode(5)
#define PWMA_OC1REFPWMMode1()           PWMA_SetOC1OutputMode(6)
#define PWMA_OC1REFPWMMode2()           PWMA_SetOC1OutputMode(7)
#define PWMA_OC1REFReTrigOPMPWM1()      PWMA_SetOC1OutputMode(8)
#define PWMA_OC1REFReTrigOPMPWM2()      PWMA_SetOC1OutputMode(9)
#define PWMA_OC1REFCombinedPWM1()       PWMA_SetOC1OutputMode(12)
#define PWMA_OC1REFCombinedPWM2()       PWMA_SetOC1OutputMode(13)
#define PWMA_OC1REFAsymmetricPWM1()     PWMA_SetOC1OutputMode(14)
#define PWMA_OC1REFAsymmetricPWM2()     PWMA_SetOC1OutputMode(15)

#define HSPWMA_SetOC1OutputMode(n)      MODIFY_HSPWMA(PWMA_CCMR1,  PWMACCMR1_OC1M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMA(PWMA_CCMR1X, PWMACCMR1X_OC1M3_MSK, (((n) >> 3) << 0))
#define HSPWMA_OC1REFFrozen()           HSPWMA_SetOC1OutputMode(0)
#define HSPWMA_OC1REFHighIfMatch()      HSPWMA_SetOC1OutputMode(1)
#define HSPWMA_OC1REFLowIfMatch()       HSPWMA_SetOC1OutputMode(2)
#define HSPWMA_OC1REFToggleIfMatch()    HSPWMA_SetOC1OutputMode(3)
#define HSPWMA_OC1REFForceLow()         HSPWMA_SetOC1OutputMode(4)
#define HSPWMA_OC1REFForceHigh()        HSPWMA_SetOC1OutputMode(5)
#define HSPWMA_OC1REFPWMMode1()         HSPWMA_SetOC1OutputMode(6)
#define HSPWMA_OC1REFPWMMode2()         HSPWMA_SetOC1OutputMode(7)
#define HSPWMA_OC1REFReTrigOPMPWM1()    HSPWMA_SetOC1OutputMode(8)
#define HSPWMA_OC1REFReTrigOPMPWM2()    HSPWMA_SetOC1OutputMode(9)
#define HSPWMA_OC1REFCombinedPWM1()     HSPWMA_SetOC1OutputMode(12)
#define HSPWMA_OC1REFCombinedPWM2()     HSPWMA_SetOC1OutputMode(13)
#define HSPWMA_OC1REFAsymmetricPWM1()   HSPWMA_SetOC1OutputMode(14)
#define HSPWMA_OC1REFAsymmetricPWM2()   HSPWMA_SetOC1OutputMode(15)

#define PWMACCMR1_OC1PE_MSK             BIT3
#define PWMA_UnbufferCCR1()             CLR_REG_BIT(PWMA_CCMR1, PWMACCMR1_OC1PE_MSK)
#define PWMA_BufferCCR1()               SET_REG_BIT(PWMA_CCMR1, PWMACCMR1_OC1PE_MSK)

#define HSPWMA_UnbufferCCR1()           CLR_HSPWMA_BIT(PWMA_CCMR1, PWMACCMR1_OC1PE_MSK)
#define HSPWMA_BufferCCR1()             SET_HSPWMA_BIT(PWMA_CCMR1, PWMACCMR1_OC1PE_MSK)

#define PWMACCMR1_OC1FE_MSK             BIT2
#define PWMA_DisableOC1FastMode()       CLR_REG_BIT(PWMA_CCMR1, PWMACCMR1_OC1FE_MSK)
#define PWMA_EnableOC1FastMode()        SET_REG_BIT(PWMA_CCMR1, PWMACCMR1_OC1FE_MSK)

#define HSPWMA_DisableOC1FastMode()     CLR_HSPWMA_BIT(PWMA_CCMR1, PWMACCMR1_OC1FE_MSK)
#define HSPWMA_EnableOC1FastMode()      SET_HSPWMA_BIT(PWMA_CCMR1, PWMACCMR1_OC1FE_MSK)

#define PWMACCMR1_CC1S_MSK              (BIT1 | BIT0)
#define PWMA_SetCC1Mode(n)              MODIFY_REG(PWMA_CCMR1,  PWMACCMR1_CC1S_MSK, ((n) << 0))
#define PWMA_CC1Output()                PWMA_SetCC1Mode(0)
#define PWMA_CC1CaptureTI1FP1()         PWMA_SetCC1Mode(1)
#define PWMA_CC1CaptureTI2FP1()         PWMA_SetCC1Mode(2)
#define PWMA_CC1CaptureTRC()            PWMA_SetCC1Mode(3)

#define HSPWMA_SetCC1Mode(n)            MODIFY_HSPWMA(PWMA_CCMR1,  PWMACCMR1_CC1S_MSK, ((n) << 0))
#define HSPWMA_CC1Output()              HSPWMA_SetCC1Mode(0)
#define HSPWMA_CC1CaptureTI1FP1()       HSPWMA_SetCC1Mode(1)
#define HSPWMA_CC1CaptureTI2FP1()       HSPWMA_SetCC1Mode(2)
#define HSPWMA_CC1CaptureTRC()          HSPWMA_SetCC1Mode(3)

