fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMACCMR3_OC3PE_MSK             BIT3
#define PWMA_UnbufferCCR3()             CLR_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)
#define PWMA_BufferCCR3()               SET_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)

#define HSPWMA_UnbufferCCR3()           CLR_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)
#define HSPWMA_BufferCCR3()             SET_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)

#define PWMACCMR3_OC3FE_MSK             BIT2
#define PWMA_DisableOC3FastMode()       CLR_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)
#define PWMA_EnableOC3FastMode()        SET_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)

#define HSPWMA_DisableOC3FastMode()     CLR_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)
#define HSPWMA_EnableOC3FastMode()      SET_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)

#define PWMACCMR3_CC3S_MSK              (BIT1 | BIT0)
#define PWMA_SetCC3Mode(n)              MODIFY_REG(PWMA_CCMR3,  PWMACCMR3_CC3S_MSK, ((n) << 0))
#define PWMA_CC3Output()                PWMA_SetCC3Mode(0)
#define PWMA_CC3CaptureTI3FP3()         PWMA_SetCC3Mode(1)
#define PWMA_CC3CaptureTI4FP3()         PWMA_SetCC3Mode(2)
#define PWMA_CC3CaptureTRC()            PWMA_SetCC3Mode(3)

#define HSPWMA_SetCC3Mode(n)            MODIFY_HSPWMA(PWMA_CCMR3,  PWMACCMR3_CC3S_MSK, ((n) << 0))
#define HSPWMA_CC3Output()              HSPWMA_SetCC3Mode(0)
#define HSPWMA_CC3CaptureTI3FP3()       HSPWMA_SetCC3Mode(1)
#define HSPWMA_CC3CaptureTI4FP3()       HSPWMA_SetCC3Mode(2)
#define HSPWMA_CC3CaptureTRC()          HSPWMA_SetCC3Mode(3)

#define PWMACCMR3_IC3F_MSK              (BIT_HN)
#define PWMA_SetIC3Filter(n)            MODIFY_REG(PWMA_CCMR3,  PWMACCMR3_IC3F_MSK, ((n) << 4))
#define PWMA_IC3Filter1()               PWMA_SetIC3Filter(0)
#define PWMA_IC3Filter2()               PWMA_SetIC3Filter(1)
#define PWMA_IC3Filter4()               PWMA_SetIC3Filter(2)
#define PWMA_IC3Filter8()               PWMA_SetIC3Filter(3)
#define PWMA_IC3Filter12()              PWMA_SetIC3Filter(4)
#define PWMA_IC3Filter16()              PWMA_SetIC3Filter(5)
#define PWMA_IC3Filter24()              PWMA_SetIC3Filter(6)
#define PWMA_IC3Filter32()              PWMA_SetIC3Filter(7)
#define PWMA_IC3Filter48()              PWMA_SetIC3Filter(8)
#define PWMA_IC3Filter64()              PWMA_SetIC3Filter(9)
#define PWMA_IC3Filter80()              PWMA_SetIC3Filter(10)
#define PWMA_IC3Filter96()              PWMA_SetIC3Filter(11)
#define PWMA_IC3Filter128()             PWMA_SetIC3Filter(12)
#define PWMA_IC3Filter160()             PWMA_SetIC3Filter(13)
#define PWMA_IC3Filter192()             PWMA_SetIC3Filter(14)
#define PWMA_IC3Filter256()             PWMA_SetIC3Filter(15)

#define HSPWMA_SetIC3Filter(n)          MODIFY_HSPWMA(PWMA_CCMR3,  PWMACCMR3_IC3F_MSK, ((n) << 4))
#define HSPWMA_IC3Filter1()             HSPWMA_SetIC3Filter(0)
#define HSPWMA_IC3Filter2()             HSPWMA_SetIC3Filter(1)
#define HSPWMA_IC3Filter4()             HSPWMA_SetIC3Filter(2)
#define HSPWMA_IC3Filter8()             HSPWMA_SetIC3Filter(3)
#define HSPWMA_IC3Filter12()            HSPWMA_SetIC3Filter(4)
#define HSPWMA_IC3Filter16()            HSPWMA_SetIC3Filter(5)
#define HSPWMA_IC3Filter24()            HSPWMA_SetIC3Filter(6)
#define HSPWMA_IC3Filter32()            HSPWMA_SetIC3Filter(7)
#define HSPWMA_IC3Filter48()            HSPWMA_SetIC3Filter(8)
#define HSPWMA_IC3Filter64()            HSPWMA_SetIC3Filter(9)
#define HSPWMA_IC3Filter80()            HSPWMA_SetIC3Filter(10)
#define HSPWMA_IC3Filter96()            HSPWMA_SetIC3Filter(11)
#define HSPWMA_IC3Filter128()           HSPWMA_SetIC3Filter(12)
#define HSPWMA_IC3Filter160()           HSPWMA_SetIC3Filter(13)
#define HSPWMA_IC3Filter192()           HSPWMA_SetIC3Filter(14)
#define HSPWMA_IC3Filter256()           HSPWMA_SetIC3Filter(15)

#define PWMACCMR3_IC3PS_MSK             (BIT3 | BIT2)
#define PWMA_SetIC3Divider(n)           MODIFY_REG(PWMA_CCMR3,  PWMACCMR3_IC3PS_MSK, ((n) << 2))
#define PWMA_IC3Divider1()              PWMA_SetIC3Divider(0)
#define PWMA_IC3Divider2()              PWMA_SetIC3Divider(1)
#define PWMA_IC3Divider4()              PWMA_SetIC3Divider(2)
#define PWMA_IC3Divider8()              PWMA_SetIC3Divider(3)

#define HSPWMA_SetIC3Divider(n)         MODIFY_HSPWMA(PWMA_CCMR3,  PWMACCMR3_IC3PS_MSK, ((n) << 2))
#define HSPWMA_IC3Divider1()            HSPWMA_SetIC3Divider(0)
#define HSPWMA_IC3Divider2()            HSPWMA_SetIC3Divider(1)
#define HSPWMA_IC3Divider4()            HSPWMA_SetIC3Divider(2)
#define HSPWMA_IC3Divider8()            HSPWMA_SetIC3Divider(3)

#define PWMACCMR4_OC4CE_MSK             BIT7
#define PWMA_EnableETRFClearOC4REF()    SET_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)
#define PWMA_DisableETRFClearOC4REF()   CLR_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)

#define HSPWMA_EnableETRFClearOC4REF()  SET_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)
#define HSPWMA_DisableETRFClearOC4REF() CLR_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)

#define PWMACCMR4_OC4M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMACCMR4X_OC4M3_MSK            BIT0
#define PWMA_SetOC4OutputMode(n)        MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_OC4M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMA_CCMR4X, PWMACCMR4X_OC4M3_MSK, (((n) >> 3) << 0))
#define PWMA_OC4REFFrozen()             PWMA_SetOC4OutputMode(0)
#define PWMA_OC4REFHighIfMatch()        PWMA_SetOC4OutputMode(1)
#define PWMA_OC4REFLowIfMatch()         PWMA_SetOC4OutputMode(2)
#define PWMA_OC4REFToggleIfMatch()      PWMA_SetOC4OutputMode(3)
#define PWMA_OC4REFForceLow()           PWMA_SetOC4OutputMode(4)
#define PWMA_OC4REFForceHigh()          PWMA_SetOC4OutputMode(5)
#define PWMA_OC4REFPWMMode1()           PWMA_SetOC4OutputMode(6)
#define PWMA_OC4REFPWMMode2()           PWMA_SetOC4OutputMode(7)
#define PWMA_OC4REFReTrigOPMPWM1()      PWMA_SetOC4OutputMode(8)
#define PWMA_OC4REFReTrigOPMPWM2()      PWMA_SetOC4OutputMode(9)
#define PWMA_OC4REFCombinedPWM1()       PWMA_SetOC4OutputMode(12)
#define PWMA_OC4REFCombinedPWM2()       PWMA_SetOC4OutputMode(13)
#define PWMA_OC4REFAsymmetricPWM1()     PWMA_SetOC4OutputMode(14)
#define PWMA_OC4REFAsymmetricPWM2()     PWMA_SetOC4OutputMode(15)

#define HSPWMA_SetOC4OutputMode(n)      MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_OC4M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMA(PWMA_CCMR4X, PWMACCMR4X_OC4M3_MSK, (((n) >> 3) << 0))
#define HSPWMA_OC4REFFrozen()           HSPWMA_SetOC4OutputMode(0)
#define HSPWMA_OC4REFHighIfMatch()      HSPWMA_SetOC4OutputMode(1)
#define HSPWMA_OC4REFLowIfMatch()       HSPWMA_SetOC4OutputMode(2)
#define HSPWMA_OC4REFToggleIfMatch()    HSPWMA_SetOC4OutputMode(3)
#define HSPWMA_OC4REFForceLow()         HSPWMA_SetOC4OutputMode(4)
#define HSPWMA_OC4REFForceHigh()        HSPWMA_SetOC4OutputMode(5)
#define HSPWMA_OC4REFPWMMode1()         HSPWMA_SetOC4OutputMode(6)
#define HSPWMA_OC4REFPWMMode2()         HSPWMA_SetOC4OutputMode(7)
#define HSPWMA_OC4REFReTrigOPMPWM1()    HSPWMA_SetOC4OutputMode(8)
#define HSPWMA_OC4REFReTrigOPMPWM2()    HSPWMA_SetOC4OutputMode(9)
#define HSPWMA_OC4REFCombinedPWM1()     HSPWMA_SetOC4OutputMode(12)
#define HSPWMA_OC4REFCombinedPWM2()     HSPWMA_SetOC4OutputMode(13)
#define HSPWMA_OC4REFAsymmetricPWM1()   HSPWMA_SetOC4OutputMode(14)
#define HSPWMA_OC4REFAsymmetricPWM2()   HSPWMA_SetOC4OutputMode(15)

