fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMACCMR4_OC4PE_MSK             BIT3
#define PWMA_UnbufferCCR4()             CLR_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)
#define PWMA_BufferCCR4()               SET_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)

#define HSPWMA_UnbufferCCR4()           CLR_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)
#define HSPWMA_BufferCCR4()             SET_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)

#define PWMACCMR4_OC4FE_MSK             BIT2
#define PWMA_DisableOC4FastMode()       CLR_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)
#define PWMA_EnableOC4FastMode()        SET_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)

#define HSPWMA_DisableOC4FastMode()     CLR_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)
#define HSPWMA_EnableOC4FastMode()      SET_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)

#define PWMACCMR4_CC4S_MSK              (BIT1 | BIT0)
#define PWMA_SetCC4Mode(n)              MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_CC4S_MSK, ((n) << 0))
#define PWMA_CC4Output()                PWMA_SetCC4Mode(0)
#define PWMA_CC4CaptureTI4FP4()         PWMA_SetCC4Mode(1)
#define PWMA_CC4CaptureTI3FP4()         PWMA_SetCC4Mode(2)
#define PWMA_CC4CaptureTRC()            PWMA_SetCC4Mode(3)

#define HSPWMA_SetCC4Mode(n)            MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_CC4S_MSK, ((n) << 0))
#define HSPWMA_CC4Output()              HSPWMA_SetCC4Mode(0)
#define HSPWMA_CC4CaptureTI4FP4()       HSPWMA_SetCC4Mode(1)
#define HSPWMA_CC4CaptureTI3FP4()       HSPWMA_SetCC4Mode(2)
#define HSPWMA_CC4CaptureTRC()          HSPWMA_SetCC4Mode(3)

#define PWMACCMR4_IC4F_MSK              (BIT_HN)
#define PWMA_SetIC4Filter(n)            MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_IC4F_MSK, ((n) << 4))
#define PWMA_IC4Filter1()               PWMA_SetIC4Filter(0)
#define PWMA_IC4Filter2()               PWMA_SetIC4Filter(1)
#define PWMA_IC4Filter4()               PWMA_SetIC4Filter(2)
#define PWMA_IC4Filter8()               PWMA_SetIC4Filter(3)
#define PWMA_IC4Filter12()              PWMA_SetIC4Filter(4)
#define PWMA_IC4Filter16()              PWMA_SetIC4Filter(5)
#define PWMA_IC4Filter24()              PWMA_SetIC4Filter(6)
#define PWMA_IC4Filter32()              PWMA_SetIC4Filter(7)
#define PWMA_IC4Filter48()              PWMA_SetIC4Filter(8)
#define PWMA_IC4Filter64()              PWMA_SetIC4Filter(9)
#define PWMA_IC4Filter80()              PWMA_SetIC4Filter(10)
#define PWMA_IC4Filter96()              PWMA_SetIC4Filter(11)
#define PWMA_IC4Filter128()             PWMA_SetIC4Filter(12)
#define PWMA_IC4Filter160()             PWMA_SetIC4Filter(13)
#define PWMA_IC4Filter192()             PWMA_SetIC4Filter(14)
#define PWMA_IC4Filter256()             PWMA_SetIC4Filter(15)

#define HSPWMA_SetIC4Filter(n)          MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_IC4F_MSK, ((n) << 4))
#define HSPWMA_IC4Filter1()             HSPWMA_SetIC4Filter(0)
#define HSPWMA_IC4Filter2()             HSPWMA_SetIC4Filter(1)
#define HSPWMA_IC4Filter4()             HSPWMA_SetIC4Filter(2)
#define HSPWMA_IC4Filter8()             HSPWMA_SetIC4Filter(3)
#define HSPWMA_IC4Filter12()            HSPWMA_SetIC4Filter(4)
#define HSPWMA_IC4Filter16()            HSPWMA_SetIC4Filter(5)
#define HSPWMA_IC4Filter24()            HSPWMA_SetIC4Filter(6)
#define HSPWMA_IC4Filter32()            HSPWMA_SetIC4Filter(7)
#define HSPWMA_IC4Filter48()            HSPWMA_SetIC4Filter(8)
#define HSPWMA_IC4Filter64()            HSPWMA_SetIC4Filter(9)
#define HSPWMA_IC4Filter80()            HSPWMA_SetIC4Filter(10)
#define HSPWMA_IC4Filter96()            HSPWMA_SetIC4Filter(11)
#define HSPWMA_IC4Filter128()           HSPWMA_SetIC4Filter(12)
#define HSPWMA_IC4Filter160()           HSPWMA_SetIC4Filter(13)
#define HSPWMA_IC4Filter192()           HSPWMA_SetIC4Filter(14)
#define HSPWMA_IC4Filter256()           HSPWMA_SetIC4Filter(15)

#define PWMACCMR4_IC4PS_MSK             (BIT3 | BIT2)
#define PWMA_SetIC4Divider(n)           MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_IC4PS_MSK, ((n) << 2))
#define PWMA_IC4Divider1()              PWMA_SetIC4Divider(0)
#define PWMA_IC4Divider2()              PWMA_SetIC4Divider(1)
#define PWMA_IC4Divider4()              PWMA_SetIC4Divider(2)
#define PWMA_IC4Divider8()              PWMA_SetIC4Divider(3)

#define HSPWMA_SetIC4Divider(n)         MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_IC4PS_MSK, ((n) << 2))
#define HSPWMA_IC4Divider1()            HSPWMA_SetIC4Divider(0)
#define HSPWMA_IC4Divider2()            HSPWMA_SetIC4Divider(1)
#define HSPWMA_IC4Divider4()            HSPWMA_SetIC4Divider(2)
#define HSPWMA_IC4Divider8()            HSPWMA_SetIC4Divider(3)

#define PWMACCMR5_OC5CE_MSK             BIT7
#define PWMA_EnableETRFClearOC5REF()    SET_REG_BIT(PWMA_CCMR5, PWMACCMR5_OC5CE_MSK)
#define PWMA_DisableETRFClearOC5REF()   CLR_REG_BIT(PWMA_CCMR5, PWMACCMR5_OC5CE_MSK)

#define HSPWMA_EnableETRFClearOC5REF()  SET_HSPWMA_BIT(PWMA_CCMR5, PWMACCMR5_OC5CE_MSK)
#define HSPWMA_DisableETRFClearOC5REF() CLR_HSPWMA_BIT(PWMA_CCMR5, PWMACCMR5_OC5CE_MSK)

#define PWMACCMR5_OC5M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMACCMR5X_OC5M3_MSK            BIT0
#define PWMA_SetOC5OutputMode(n)        MODIFY_REG(PWMA_CCMR5,  PWMACCMR5_OC5M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMA_CCMR5X, PWMACCMR5X_OC5M3_MSK, (((n) >> 3) << 0))
#define PWMA_OC5REFFrozen()             PWMA_SetOC5OutputMode(0)
#define PWMA_OC5REFHighIfMatch()        PWMA_SetOC5OutputMode(1)
#define PWMA_OC5REFLowIfMatch()         PWMA_SetOC5OutputMode(2)
#define PWMA_OC5REFToggleIfMatch()      PWMA_SetOC5OutputMode(3)
#define PWMA_OC5REFForceLow()           PWMA_SetOC5OutputMode(4)
#define PWMA_OC5REFForceHigh()          PWMA_SetOC5OutputMode(5)
#define PWMA_OC5REFPWMMode1()           PWMA_SetOC5OutputMode(6)
#define PWMA_OC5REFPWMMode2()           PWMA_SetOC5OutputMode(7)
#define PWMA_OC5REFReTrigOPMPWM1()      PWMA_SetOC5OutputMode(8)
#define PWMA_OC5REFReTrigOPMPWM2()      PWMA_SetOC5OutputMode(9)
#define PWMA_OC5REFCombinedPWM1()       PWMA_SetOC5OutputMode(12)
#define PWMA_OC5REFCombinedPWM2()       PWMA_SetOC5OutputMode(13)
#define PWMA_OC5REFAsymmetricPWM1()     PWMA_SetOC5OutputMode(14)
#define PWMA_OC5REFAsymmetricPWM2()     PWMA_SetOC5OutputMode(15)

