fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMA_SetOC5OutputMode(n)      MODIFY_HSPWMA(PWMA_CCMR5,  PWMACCMR5_OC5M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMA(PWMA_CCMR5X, PWMACCMR5X_OC5M3_MSK, (((n) >> 3) << 0))
#define HSPWMA_OC5REFFrozen()           HSPWMA_SetOC5OutputMode(0)
#define HSPWMA_OC5REFHighIfMatch()      HSPWMA_SetOC5OutputMode(1)
#define HSPWMA_OC5REFLowIfMatch()       HSPWMA_SetOC5OutputMode(2)
#define HSPWMA_OC5REFToggleIfMatch()    HSPWMA_SetOC5OutputMode(3)
#define HSPWMA_OC5REFForceLow()         HSPWMA_SetOC5OutputMode(4)
#define HSPWMA_OC5REFForceHigh()        HSPWMA_SetOC5OutputMode(5)
#define HSPWMA_OC5REFPWMMode1()         HSPWMA_SetOC5OutputMode(6)
#define HSPWMA_OC5REFPWMMode2()         HSPWMA_SetOC5OutputMode(7)
#define HSPWMA_OC5REFReTrigOPMPWM1()    HSPWMA_SetOC5OutputMode(8)
#define HSPWMA_OC5REFReTrigOPMPWM2()    HSPWMA_SetOC5OutputMode(9)
#define HSPWMA_OC5REFCombinedPWM1()     HSPWMA_SetOC5OutputMode(12)
#define HSPWMA_OC5REFCombinedPWM2()     HSPWMA_SetOC5OutputMode(13)
#define HSPWMA_OC5REFAsymmetricPWM1()   HSPWMA_SetOC5OutputMode(14)
#define HSPWMA_OC5REFAsymmetricPWM2()   HSPWMA_SetOC5OutputMode(15)

#define PWMACCMR5_OC5PE_MSK             BIT3
#define PWMA_UnbufferCCR5()             CLR_REG_BIT(PWMA_CCMR5, PWMACCMR5_OC5PE_MSK)
#define PWMA_BufferCCR5()               SET_REG_BIT(PWMA_CCMR5, PWMACCMR5_OC5PE_MSK)

#define HSPWMA_UnbufferCCR5()           CLR_HSPWMA_BIT(PWMA_CCMR5, PWMACCMR5_OC5PE_MSK)
#define HSPWMA_BufferCCR5()             SET_HSPWMA_BIT(PWMA_CCMR5, PWMACCMR5_OC5PE_MSK)

#define PWMACCMR6_OC6CE_MSK             BIT7
#define PWMA_EnableETRFClearOC6REF()    SET_REG_BIT(PWMA_CCMR6, PWMACCMR6_OC6CE_MSK)
#define PWMA_DisableETRFClearOC6REF()   CLR_REG_BIT(PWMA_CCMR6, PWMACCMR6_OC6CE_MSK)

#define HSPWMA_EnableETRFClearOC6REF()  SET_HSPWMA_BIT(PWMA_CCMR6, PWMACCMR6_OC6CE_MSK)
#define HSPWMA_DisableETRFClearOC6REF() CLR_HSPWMA_BIT(PWMA_CCMR6, PWMACCMR6_OC6CE_MSK)

#define PWMACCMR6_OC6M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMACCMR6X_OC6M3_MSK            BIT0
#define PWMA_SetOC6OutputMode(n)        MODIFY_REG(PWMA_CCMR6,  PWMACCMR6_OC6M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMA_CCMR6X, PWMACCMR6X_OC6M3_MSK, (((n) >> 3) << 0))
#define PWMA_OC6REFFrozen()             PWMA_SetOC6OutputMode(0)
#define PWMA_OC6REFHighIfMatch()        PWMA_SetOC6OutputMode(1)
#define PWMA_OC6REFLowIfMatch()         PWMA_SetOC6OutputMode(2)
#define PWMA_OC6REFToggleIfMatch()      PWMA_SetOC6OutputMode(3)
#define PWMA_OC6REFForceLow()           PWMA_SetOC6OutputMode(4)
#define PWMA_OC6REFForceHigh()          PWMA_SetOC6OutputMode(5)
#define PWMA_OC6REFPWMMode1()           PWMA_SetOC6OutputMode(6)
#define PWMA_OC6REFPWMMode2()           PWMA_SetOC6OutputMode(7)
#define PWMA_OC6REFReTrigOPMPWM1()      PWMA_SetOC6OutputMode(8)
#define PWMA_OC6REFReTrigOPMPWM2()      PWMA_SetOC6OutputMode(9)
#define PWMA_OC6REFCombinedPWM1()       PWMA_SetOC6OutputMode(12)
#define PWMA_OC6REFCombinedPWM2()       PWMA_SetOC6OutputMode(13)
#define PWMA_OC6REFAsymmetricPWM1()     PWMA_SetOC6OutputMode(14)
#define PWMA_OC6REFAsymmetricPWM2()     PWMA_SetOC6OutputMode(15)

#define HSPWMA_SetOC6OutputMode(n)      MODIFY_HSPWMA(PWMA_CCMR6,  PWMACCMR6_OC6M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMA(PWMA_CCMR6X, PWMACCMR6X_OC6M3_MSK, (((n) >> 3) << 0))
#define HSPWMA_OC6REFFrozen()           HSPWMA_SetOC6OutputMode(0)
#define HSPWMA_OC6REFHighIfMatch()      HSPWMA_SetOC6OutputMode(1)
#define HSPWMA_OC6REFLowIfMatch()       HSPWMA_SetOC6OutputMode(2)
#define HSPWMA_OC6REFToggleIfMatch()    HSPWMA_SetOC6OutputMode(3)
#define HSPWMA_OC6REFForceLow()         HSPWMA_SetOC6OutputMode(4)
#define HSPWMA_OC6REFForceHigh()        HSPWMA_SetOC6OutputMode(5)
#define HSPWMA_OC6REFPWMMode1()         HSPWMA_SetOC6OutputMode(6)
#define HSPWMA_OC6REFPWMMode2()         HSPWMA_SetOC6OutputMode(7)
#define HSPWMA_OC6REFReTrigOPMPWM1()    HSPWMA_SetOC6OutputMode(8)
#define HSPWMA_OC6REFReTrigOPMPWM2()    HSPWMA_SetOC6OutputMode(9)
#define HSPWMA_OC6REFCombinedPWM1()     HSPWMA_SetOC6OutputMode(12)
#define HSPWMA_OC6REFCombinedPWM2()     HSPWMA_SetOC6OutputMode(13)
#define HSPWMA_OC6REFAsymmetricPWM1()   HSPWMA_SetOC6OutputMode(14)
#define HSPWMA_OC6REFAsymmetricPWM2()   HSPWMA_SetOC6OutputMode(15)

#define PWMACCMR6_OC6PE_MSK             BIT3
#define PWMA_UnbufferCCR6()             CLR_REG_BIT(PWMA_CCMR6, PWMACCMR6_OC6PE_MSK)
#define PWMA_BufferCCR6()               SET_REG_BIT(PWMA_CCMR6, PWMACCMR6_OC6PE_MSK)

#define HSPWMA_UnbufferCCR6()           CLR_HSPWMA_BIT(PWMA_CCMR6, PWMACCMR6_OC6PE_MSK)
#define HSPWMA_BufferCCR6()             SET_HSPWMA_BIT(PWMA_CCMR6, PWMACCMR6_OC6PE_MSK)

#define PWMACCER1_CC1E_MSK              BIT0
#define PWMA_CC1PEnable()               SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)
#define PWMA_CC1PDisable()              CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)

#define HSPWMA_CC1PEnable()             SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)
#define HSPWMA_CC1PDisable()            CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)

#define PWMACCER1_CC1P_MSK              BIT1
#define PWMA_CC1PNonInverted()          CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)
#define PWMA_CC1PInverted()             SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)

#define HSPWMA_CC1PNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)
#define HSPWMA_CC1PInverted()           SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)

#define PWMACCER1_CC1NE_MSK             BIT2
#define PWMA_CC1NEnable()               SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)
#define PWMA_CC1NDisable()              CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)

#define HSPWMA_CC1NEnable()             SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)
#define HSPWMA_CC1NDisable()            CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)

#define PWMACCER1_CC1NP_MSK             BIT3
#define PWMA_CC1NNonInverted()          CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NP_MSK)
#define PWMA_CC1NInverted()             SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NP_MSK)

