fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMABRK_MOE_MSK                 BIT7
#define PWMA_EnableMainOutput()         SET_REG_BIT(PWMA_BKR, PWMABRK_MOE_MSK)
#define PWMA_DisableMainOutput()        CLR_REG_BIT(PWMA_BKR, PWMABRK_MOE_MSK)

#define HSPWMA_EnableMainOutput()       SET_HSPWMA_BIT(PWMA_BKR, PWMABRK_MOE_MSK)
#define HSPWMA_DisableMainOutput()      CLR_HSPWMA_BIT(PWMA_BKR, PWMABRK_MOE_MSK)

#define PWMABRK_AOE_MSK                 BIT6
#define PWMA_EnableAutoOutput()         SET_REG_BIT(PWMA_BKR, PWMABRK_AOE_MSK)
#define PWMA_DisableAutoOutput()        CLR_REG_BIT(PWMA_BKR, PWMABRK_AOE_MSK)

#define HSPWMA_EnableAutoOutput()       SET_HSPWMA_BIT(PWMA_BKR, PWMABRK_AOE_MSK)
#define HSPWMA_DisableAutoOutput()      CLR_HSPWMA_BIT(PWMA_BKR, PWMABRK_AOE_MSK)

#define PWMABRK_BKP_MSK                 BIT5
#define PWMA_BRKNonInverted()           SET_REG_BIT(PWMA_BKR, PWMABRK_BKP_MSK)
#define PWMA_BRKInverted()              CLR_REG_BIT(PWMA_BKR, PWMABRK_BKP_MSK)

#define HSPWMA_BRKNonInverted()         SET_HSPWMA_BIT(PWMA_BKR, PWMABRK_BKP_MSK)
#define HSPWMA_BRKInverted()            CLR_HSPWMA_BIT(PWMA_BKR, PWMABRK_BKP_MSK)

#define PWMABRK_BKE_MSK                 BIT4
#define PWMA_BRKEnable()                SET_REG_BIT(PWMA_BKR, PWMABRK_BKE_MSK)
#define PWMA_BRKDisable()               CLR_REG_BIT(PWMA_BKR, PWMABRK_BKE_MSK)

#define HSPWMA_BRKEnable()              SET_HSPWMA_BIT(PWMA_BKR, PWMABRK_BKE_MSK)
#define HSPWMA_BRKDisable()             CLR_HSPWMA_BIT(PWMA_BKR, PWMABRK_BKE_MSK)

#define PWMABRK_OSSR_MSK                BIT3
#define PWMABRK_OSSI_MSK                BIT2
#define PWMA_RunInactiveNoOutput()      CLR_REG_BIT(PWMA_BKR, PWMABRK_OSSR_MSK)
#define PWMA_RunInactiveOutput()        SET_REG_BIT(PWMA_BKR, PWMABRK_OSSR_MSK)
#define PWMA_IdleInactiveNoOutput()     CLR_REG_BIT(PWMA_BKR, PWMABRK_OSSI_MSK)
#define PWMA_IdleInactiveOutput()       SET_REG_BIT(PWMA_BKR, PWMABRK_OSSI_MSK)

#define HSPWMA_RunInactiveNoOutput()    CLR_HSPWMA_BIT(PWMA_BKR, PWMABRK_OSSR_MSK)
#define HSPWMA_RunInactiveOutput()      SET_HSPWMA_BIT(PWMA_BKR, PWMABRK_OSSR_MSK)
#define HSPWMA_IdleInactiveNoOutput()   CLR_HSPWMA_BIT(PWMA_BKR, PWMABRK_OSSI_MSK)
#define HSPWMA_IdleInactiveOutput()     SET_HSPWMA_BIT(PWMA_BKR, PWMABRK_OSSI_MSK)

#define PWMABRK_LOCK_MSK                (BIT1 | BIT0)
#define PWMA_SetLockLevel(n)            MODIFY_REG(PWMA_BKR,  PWMABRK_LOCK_MSK, ((n) << 0))
#define PWMA_SetUnLock()                PWMA_SetLockLevel(0)

#define HSPWMA_SetLockLevel(n)          MODIFY_HSPWMA(PWMA_BKR,  PWMABRK_LOCK_MSK, ((n) << 0))
#define HSPWMA_SetUnLock()              HSPWMA_SetLockLevel(0)

#define PWMAOISR_OIS1_MSK               BIT0
#define PWMAOISR_OIS1N_MSK              BIT1
#define PWMAOISR_OIS2_MSK               BIT2
#define PWMAOISR_OIS2N_MSK              BIT3
#define PWMAOISR_OIS3_MSK               BIT4
#define PWMAOISR_OIS3N_MSK              BIT5
#define PWMAOISR_OIS4_MSK               BIT6
#define PWMAOISR_OIS4N_MSK              BIT7
#define PWMACR3_OIS5_MSK                BIT0
#define PWMACR3_OIS6_MSK                BIT2
#define PWMA_OC1PIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS1_MSK)
#define PWMA_OC1PIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS1_MSK)
#define PWMA_OC1NIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS1N_MSK)
#define PWMA_OC1NIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS1N_MSK)
#define PWMA_OC2PIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS2_MSK)
#define PWMA_OC2PIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS2_MSK)
#define PWMA_OC2NIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS2N_MSK)
#define PWMA_OC2NIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS2N_MSK)
#define PWMA_OC3PIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS3_MSK)
#define PWMA_OC3PIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS3_MSK)
#define PWMA_OC3NIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS3N_MSK)
#define PWMA_OC3NIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS3N_MSK)
#define PWMA_OC4PIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS4_MSK)
#define PWMA_OC4PIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS4_MSK)
#define PWMA_OC4NIdleLevelLow()         CLR_REG_BIT(PWMA_OISR, PWMAOISR_OIS4N_MSK)
#define PWMA_OC4NIdleLevelHigh()        SET_REG_BIT(PWMA_OISR, PWMAOISR_OIS4N_MSK)
#define PWMA_OC5PIdleLevelLow()         CLR_REG_BIT(PWMA_CR3, PWMACR3_OIS5_MSK)
#define PWMA_OC5PIdleLevelHigh()        SET_REG_BIT(PWMA_CR3, PWMACR3_OIS5_MSK)
#define PWMA_OC6PIdleLevelLow()         CLR_REG_BIT(PWMA_CR3, PWMACR3_OIS6_MSK)
#define PWMA_OC6PIdleLevelHigh()        SET_REG_BIT(PWMA_CR3, PWMACR3_OIS6_MSK)

#define HSPWMA_OC1PIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS1_MSK)
#define HSPWMA_OC1PIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS1_MSK)
#define HSPWMA_OC1NIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS1N_MSK)
#define HSPWMA_OC1NIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS1N_MSK)
#define HSPWMA_OC2PIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS2_MSK)
#define HSPWMA_OC2PIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS2_MSK)
#define HSPWMA_OC2NIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS2N_MSK)
#define HSPWMA_OC2NIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS2N_MSK)
#define HSPWMA_OC3PIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS3_MSK)
#define HSPWMA_OC3PIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS3_MSK)
#define HSPWMA_OC3NIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS3N_MSK)
#define HSPWMA_OC3NIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS3N_MSK)
#define HSPWMA_OC4PIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS4_MSK)
#define HSPWMA_OC4PIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS4_MSK)
#define HSPWMA_OC4NIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS4N_MSK)
#define HSPWMA_OC4NIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_OISR, PWMAOISR_OIS4N_MSK)
#define HSPWMA_OC5PIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_CR3, PWMACR3_OIS5_MSK)
#define HSPWMA_OC5PIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_CR3, PWMACR3_OIS5_MSK)
#define HSPWMA_OC6PIdleLevelLow()       CLR_HSPWMA_BIT(PWMA_CR3, PWMACR3_OIS6_MSK)
#define HSPWMA_OC6PIdleLevelHigh()      SET_HSPWMA_BIT(PWMA_CR3, PWMACR3_OIS6_MSK)

#define PWMA_SetCounter(n)              (PWMA_CNTRH = HIBYTE(n), PWMA_CNTRL = LOBYTE(n))
#define PWMA_SetClockDivider(n)         (PWMA_PSCRH = HIBYTE(n), PWMA_PSCRL = LOBYTE(n))
#define PWMA_SetReload16(n)             (PWMA_ARRH = HIBYTE(n), PWMA_ARRL = LOBYTE(n))
#define PWMA_SetRepeatCounter(n)        (PWMA_RCRH = HIBYTE(n), PWMA_RCR = LOBYTE(n))

