fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMA_SetCounter(n)            (WRITE_HSPWMA(PWMA_CNTRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_CNTRL, LOBYTE(n)))
#define HSPWMA_SetClockDivider(n)       (WRITE_HSPWMA(PWMA_PSCRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_PSCRL, LOBYTE(n)))
#define HSPWMA_SetReload16(n)           (WRITE_HSPWMA(PWMA_ARRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_ARRL, LOBYTE(n)))
#define HSPWMA_SetRepeatCounter(n)      (WRITE_HSPWMA(PWMA_RCRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_RCR, LOBYTE(n)))

#define PWMA_SetCCR1Value(n)            (PWMA_CCR1H = HIBYTE(n), PWMA_CCR1L = LOBYTE(n))
#define PWMA_SetCCR2Value(n)            (PWMA_CCR2H = HIBYTE(n), PWMA_CCR2L = LOBYTE(n))
#define PWMA_SetCCR3Value(n)            (PWMA_CCR3H = HIBYTE(n), PWMA_CCR3L = LOBYTE(n))
#define PWMA_SetCCR4Value(n)            (PWMA_CCR4H = HIBYTE(n), PWMA_CCR4L = LOBYTE(n))
#define PWMA_SetCCR5Value(n)            (PWMA_CCR5H = HIBYTE(n), PWMA_CCR5L = LOBYTE(n))
#define PWMA_SetCCR6Value(n)            (PWMA_CCR6H = HIBYTE(n), PWMA_CCR6L = LOBYTE(n))

#define HSPWMA_SetCCR1Value(n)          (WRITE_HSPWMA(PWMA_CCR1H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR1L, LOBYTE(n)))
#define HSPWMA_SetCCR2Value(n)          (WRITE_HSPWMA(PWMA_CCR2H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR2L, LOBYTE(n)))
#define HSPWMA_SetCCR3Value(n)          (WRITE_HSPWMA(PWMA_CCR3H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR3L, LOBYTE(n)))
#define HSPWMA_SetCCR4Value(n)          (WRITE_HSPWMA(PWMA_CCR4H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR4L, LOBYTE(n)))
#define HSPWMA_SetCCR5Value(n)          (WRITE_HSPWMA(PWMA_CCR5H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR5L, LOBYTE(n)))
#define HSPWMA_SetCCR6Value(n)          (WRITE_HSPWMA(PWMA_CCR6H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR6L, LOBYTE(n)))

#define PWMA_ReadReload16()             MAKEWORD(PWMA_ARRL, PWMA_ARRH)

#define HSPWMA_ReadReload16()           MAKEWORD(READ_HSPWMA(PWMA_ARRL), READ_HSPWMA(PWMA_ARRH))

#define PWMA_ReadCCR1Value()            MAKEWORD(PWMA_CCR1L, PWMA_CCR1H)
#define PWMA_ReadCCR2Value()            MAKEWORD(PWMA_CCR2L, PWMA_CCR2H)
#define PWMA_ReadCCR3Value()            MAKEWORD(PWMA_CCR3L, PWMA_CCR3H)
#define PWMA_ReadCCR4Value()            MAKEWORD(PWMA_CCR4L, PWMA_CCR4H)
#define PWMA_ReadCCR5Value()            MAKEWORD(PWMA_CCR5L, PWMA_CCR5H)
#define PWMA_ReadCCR6Value()            MAKEWORD(PWMA_CCR6L, PWMA_CCR6H)

#define HSPWMA_ReadCCR1Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR1L), READ_HSPWMA(PWMA_CCR1H))
#define HSPWMA_ReadCCR2Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR2L), READ_HSPWMA(PWMA_CCR2H))
#define HSPWMA_ReadCCR3Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR3L), READ_HSPWMA(PWMA_CCR3H))
#define HSPWMA_ReadCCR4Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR4L), READ_HSPWMA(PWMA_CCR4H))
#define HSPWMA_ReadCCR5Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR5L), READ_HSPWMA(PWMA_CCR5H))
#define HSPWMA_ReadCCR6Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR6L), READ_HSPWMA(PWMA_CCR6H))

#define PWMA_SetDeadTime(n)             PWMA_DTR = LOBYTE(n)

#define HSPWMA_SetDeadTime(n)           WRITE_HSPWMA(PWMA_DTR, LOBYTE(n))

#define PWMACCR5X_GC5C3_MSK             BIT7
#define PWMACCR5X_GC5C2_MSK             BIT6
#define PWMACCR5X_GC5C1_MSK             BIT5
#define PWMA_OC3REFCIndependent()       CLR_REG_BIT(PWMA_CCR5X, PWMACCR5X_GC5C3_MSK)
#define PWMA_OC2REFCIndependent()       CLR_REG_BIT(PWMA_CCR5X, PWMACCR5X_GC5C2_MSK)
#define PWMA_OC1REFCIndependent()       CLR_REG_BIT(PWMA_CCR5X, PWMACCR5X_GC5C1_MSK)
#define PWMA_OC3REFCAndWithOC5REF()     SET_REG_BIT(PWMA_CCR5X, PWMACCR5X_GC5C3_MSK)
#define PWMA_OC2REFCAndWithOC5REF()     SET_REG_BIT(PWMA_CCR5X, PWMACCR5X_GC5C2_MSK)
#define PWMA_OC1REFCAndWithOC5REF()     SET_REG_BIT(PWMA_CCR5X, PWMACCR5X_GC5C1_MSK)

#define HSPWMA_OC3REFCIndependent()     CLR_HSPWMA_BIT(PWMA_CCR5X, PWMACCR5X_GC5C3_MSK)
#define HSPWMA_OC2REFCIndependent()     CLR_HSPWMA_BIT(PWMA_CCR5X, PWMACCR5X_GC5C2_MSK)
#define HSPWMA_OC1REFCIndependent()     CLR_HSPWMA_BIT(PWMA_CCR5X, PWMACCR5X_GC5C1_MSK)
#define HSPWMA_OC3REFCAndWithOC5REF()   SET_HSPWMA_BIT(PWMA_CCR5X, PWMACCR5X_GC5C3_MSK)
#define HSPWMA_OC2REFCAndWithOC5REF()   SET_HSPWMA_BIT(PWMA_CCR5X, PWMACCR5X_GC5C2_MSK)
#define HSPWMA_OC1REFCAndWithOC5REF()   SET_HSPWMA_BIT(PWMA_CCR5X, PWMACCR5X_GC5C1_MSK)

////////////////////////

#define PWMADER_TDE_MSK                 BIT6
#define PWMADER_COMDE_MSK               BIT5
#define PWMADER_CC4DE_MSK               BIT4
#define PWMADER_CC3DE_MSK               BIT3
#define PWMADER_CC2DE_MSK               BIT2
#define PWMADER_CC1DE_MSK               BIT1
#define PWMADER_UDE_MSK                 BIT0
#define PWMA_TriggerIntAsDMAEvent()     SET_REG_BIT(PWMA_DER, PWMADER_TDE_MSK)
#define PWMA_COMIntAsDMAEvent()         SET_REG_BIT(PWMA_DER, PWMADER_COMDE_MSK)
#define PWMA_CC4IntAsDMAEvent()         SET_REG_BIT(PWMA_DER, PWMADER_CC4DE_MSK)
#define PWMA_CC3IntAsDMAEvent()         SET_REG_BIT(PWMA_DER, PWMADER_CC3DE_MSK)
#define PWMA_CC2IntAsDMAEvent()         SET_REG_BIT(PWMA_DER, PWMADER_CC2DE_MSK)
#define PWMA_CC1IntAsDMAEvent()         SET_REG_BIT(PWMA_DER, PWMADER_CC1DE_MSK)
#define PWMA_UpdateIntAsDMAEvent()      SET_REG_BIT(PWMA_DER, PWMADER_UDE_MSK)

#define HSPWMA_TriggerIntAsDMAEvent()   SET_HSPWMA_BIT(PWMA_DER, PWMADER_TDE_MSK)
#define HSPWMA_COMIntAsDMAEvent()       SET_HSPWMA_BIT(PWMA_DER, PWMADER_COMDE_MSK)
#define HSPWMA_CC4IntAsDMAEvent()       SET_HSPWMA_BIT(PWMA_DER, PWMADER_CC4DE_MSK)
#define HSPWMA_CC3IntAsDMAEvent()       SET_HSPWMA_BIT(PWMA_DER, PWMADER_CC3DE_MSK)
#define HSPWMA_CC2IntAsDMAEvent()       SET_HSPWMA_BIT(PWMA_DER, PWMADER_CC2DE_MSK)
#define HSPWMA_CC1IntAsDMAEvent()       SET_HSPWMA_BIT(PWMA_DER, PWMADER_CC1DE_MSK)
#define HSPWMA_UpdateIntAsDMAEvent()    SET_HSPWMA_BIT(PWMA_DER, PWMADER_UDE_MSK)

#define PWMADBA_DBA_MSK                 (BIT4 | BIT_LN)
#define PWMA_SetDMABaseAddress(d)       MODIFY_REG(PWMA_DBA,  PWMADBA_DBA_MSK, ((d) << 0))

#define HSPWMA_SetDMABaseAddress(d)     MODIFY_HSPWMA(PWMA_DBA,  PWMADBA_DBA_MSK, ((d) << 0))

#define PWMADBL_DBL_MSK                 (BIT4 | BIT_LN)
#define PWMA_SetDMABurstCount(d)        MODIFY_REG(PWMA_DBL,  PWMADBL_DBL_MSK, ((d) << 0))

