fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMA_SetDMABurstCount(d)      MODIFY_HSPWMA(PWMA_DBL,  PWMADBL_DBL_MSK, ((d) << 0))

#define PWMADMACR_SIZE_MSK              (BIT1 | BIT0)
#define PWMA_SetDMABurstBytes(n)        MODIFY_REG(PWMA_DMACR,  PWMADMACR_SIZE_MSK, ((n) << 0))
#define PWMA_SetDMABurst1Byte()         PWMA_SetDMABurstBytes(0)
#define PWMA_SetDMABurst2Bytes()        PWMA_SetDMABurstBytes(1)
#define PWMA_SetDMABurst3Bytes()        PWMA_SetDMABurstBytes(2)
#define PWMA_SetDMABurst4Bytes()        PWMA_SetDMABurstBytes(3)

#define HSPWMA_SetDMABurstBytes(n)      MODIFY_HSPWMA(PWMA_DMACR,  PWMADMACR_SIZE_MSK, ((n) << 0))
#define HSPWMA_SetDMABurst1Byte()       HSPWMA_SetDMABurstBytes(0)
#define HSPWMA_SetDMABurst2Bytes()      HSPWMA_SetDMABurstBytes(1)
#define HSPWMA_SetDMABurst3Bytes()      HSPWMA_SetDMABurstBytes(2)
#define HSPWMA_SetDMABurst4Bytes()      HSPWMA_SetDMABurstBytes(3)

#define PWMADMACR_DSKIP_MSK             BIT4
#define PWMA_DMASkipSpace()             SET_REG_BIT(PWMA_DMACR, PWMADMACR_DSKIP_MSK)
#define PWMA_DMANeverSkipSpace()        CLR_REG_BIT(PWMA_DMACR, PWMADMACR_DSKIP_MSK)

#define HSPWMA_DMASkipSpace()           SET_HSPWMA_BIT(PWMA_DMACR, PWMADMACR_DSKIP_MSK)
#define HSPWMA_DMANeverSkipSpace()      CLR_HSPWMA_BIT(PWMA_DMACR, PWMADMACR_DSKIP_MSK)

#define PWMADMACR_DDIR_MSK              BIT3
#define PWMA_SetDMAOutput()             CLR_REG_BIT(PWMA_DMACR, PWMADMACR_DDIR_MSK)
#define PWMA_SetDMAInput()              SET_REG_BIT(PWMA_DMACR, PWMADMACR_DDIR_MSK)

#define HSPWMA_SetDMAOutput()           CLR_HSPWMA_BIT(PWMA_DMACR, PWMADMACR_DDIR_MSK)
#define HSPWMA_SetDMAInput()            SET_HSPWMA_BIT(PWMA_DMACR, PWMADMACR_DDIR_MSK)

#define PWMADMACR_DMAEN_MSK             BIT2
#define PWMA_EnableDMA()                SET_REG_BIT(PWMA_DMACR, PWMADMACR_DMAEN_MSK)
#define PWMA_DisableDMA()               CLR_REG_BIT(PWMA_DMACR, PWMADMACR_DMAEN_MSK)

#define HSPWMA_EnableDMA()              SET_HSPWMA_BIT(PWMA_DMACR, PWMADMACR_DMAEN_MSK)
#define HSPWMA_DisableDMA()             CLR_HSPWMA_BIT(PWMA_DMACR, PWMADMACR_DMAEN_MSK)

////////////////////////

#define PWMBENO_ENO5P_MSK               BIT0
#define PWMBENO_ENO6P_MSK               BIT2
#define PWMBENO_ENO7P_MSK               BIT4
#define PWMBENO_ENO8P_MSK               BIT6
#define PWMB_EnablePWM5POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define PWMB_DisablePWM5POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define PWMB_EnablePWM6POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define PWMB_DisablePWM6POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define PWMB_EnablePWM7POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define PWMB_DisablePWM7POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define PWMB_EnablePWM8POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)
#define PWMB_DisablePWM8POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)

#define HSPWMB_EnablePWM5POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define HSPWMB_DisablePWM5POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define HSPWMB_EnablePWM6POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define HSPWMB_DisablePWM6POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define HSPWMB_EnablePWM7POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define HSPWMB_DisablePWM7POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define HSPWMB_EnablePWM8POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)
#define HSPWMB_DisablePWM8POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)

#define PWMBIOAUX_AUX5P_MSK             BIT0
#define PWMBIOAUX_AUX6P_MSK             BIT2
#define PWMBIOAUX_AUX7P_MSK             BIT4
#define PWMBIOAUX_AUX8P_MSK             BIT6
#define PWMB_EnoCtrlPWM5P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define PWMB_EnoBrkCtrlPWM5P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define PWMB_EnoCtrlPWM6P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define PWMB_EnoBrkCtrlPWM6P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define PWMB_EnoCtrlPWM7P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define PWMB_EnoBrkCtrlPWM7P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define PWMB_EnoCtrlPWM8P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)
#define PWMB_EnoBrkCtrlPWM8P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)

#define HSPWMB_EnoCtrlPWM5P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define HSPWMB_EnoBrkCtrlPWM5P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define HSPWMB_EnoCtrlPWM6P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define HSPWMB_EnoBrkCtrlPWM6P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define HSPWMB_EnoCtrlPWM7P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define HSPWMB_EnoBrkCtrlPWM7P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define HSPWMB_EnoCtrlPWM8P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)
#define HSPWMB_EnoBrkCtrlPWM8P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)

#define PWMBCR1_ARPE_MSK                BIT7
#define PWMB_UnbufferARR()              CLR_REG_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)
#define PWMB_BufferARR()                SET_REG_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)

#define HSPWMB_UnbufferARR()            CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)
#define HSPWMB_BufferARR()              SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)

#define PWMBCR1_CMS_MSK                 (BIT6 | BIT5)
#define PWMB_SetAlignMode(n)            MODIFY_REG(PWMB_CR1,  PWMBCR1_CMS_MSK, ((n) << 5))
#define PWMB_EdgeAlignMode()            PWMB_SetAlignMode(0)
#define PWMB_CenterAlignMode1()         PWMB_SetAlignMode(1)
#define PWMB_CenterAlignMode2()         PWMB_SetAlignMode(2)
#define PWMB_CenterAlignMode3()         PWMB_SetAlignMode(3)

#define HSPWMB_SetAlignMode(n)          MODIFY_HSPWMB(PWMB_CR1,  PWMBCR1_CMS_MSK, ((n) << 5))
#define HSPWMB_EdgeAlignMode()          HSPWMB_SetAlignMode(0)
#define HSPWMB_CenterAlignMode1()       HSPWMB_SetAlignMode(1)
#define HSPWMB_CenterAlignMode2()       HSPWMB_SetAlignMode(2)
#define HSPWMB_CenterAlignMode3()       HSPWMB_SetAlignMode(3)

#define PWMBCR1_DIR_MSK                 BIT4
#define PWMB_UpCounter()                CLR_REG_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)
#define PWMB_DownCounter()              SET_REG_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)

#define HSPWMB_UpCounter()              CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)
#define HSPWMB_DownCounter()            SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)

#define PWMBCR1_OPM_MSK                 BIT3
#define PWMB_ContinueMode()             CLR_REG_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)
#define PWMB_OnePulseMode()             SET_REG_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)

#define HSPWMB_ContinueMode()           CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)
#define HSPWMB_OnePulseMode()           SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)

