fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMBCR1_URS_MSK                 BIT2
#define PWMB_UpdateRequestMode1()       SET_REG_BIT(PWMB_CR1, PWMBCR1_URS_MSK)
#define PWMB_UpdateRequestMode2()       CLR_REG_BIT(PWMB_CR1, PWMBCR1_URS_MSK)

#define HSPWMB_UpdateRequestMode1()     SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_URS_MSK)
#define HSPWMB_UpdateRequestMode2()     CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_URS_MSK)

#define PWMBCR1_UDIS_MSK                BIT1
#define PWMB_EnableUpdate()             CLR_REG_BIT(PWMB_CR1, PWMBCR1_UDIS_MSK)
#define PWMB_DisableUpdate()            SET_REG_BIT(PWMB_CR1, PWMBCR1_UDIS_MSK)

#define HSPWMB_EnableUpdate()           CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_UDIS_MSK)
#define HSPWMB_DisableUpdate()          SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_UDIS_MSK)

#define PWMBCR1_CEN_MSK                 BIT0
#define PWMB_Run()                      SET_REG_BIT(PWMB_CR1, PWMBCR1_CEN_MSK)
#define PWMB_Stop()                     CLR_REG_BIT(PWMB_CR1, PWMBCR1_CEN_MSK)

#define HSPWMB_Run()                    SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_CEN_MSK)
#define HSPWMB_Stop()                   CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_CEN_MSK)

#define PWMBCR2_TIS_MSK                 BIT7
#define PWMB_PWM5PToTI()                CLR_REG_BIT(PWMB_CR2, PWMBCR2_TIS_MSK)
#define PWMB_Xor5P6P7PToTI()            SET_REG_BIT(PWMB_CR2, PWMBCR2_TIS_MSK)

#define HSPWMB_PWM5PToTI()              CLR_HSPWMB_BIT(PWMB_CR2, PWMBCR2_TIS_MSK)
#define HSPWMB_Xor5P6P7PToTI()          SET_HSPWMB_BIT(PWMB_CR2, PWMBCR2_TIS_MSK)

#define PWMBCR2_MMS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMB_SelectTRGO(n)              MODIFY_REG(PWMB_CR2,  PWMBCR2_MMS_MSK, ((n) << 4))
#define PWMB_ResetAsTRGO()              PWMB_SelectTRGO(0)
#define PWMB_EnableAsTRGO()             PWMB_SelectTRGO(1)
#define PWMB_UpdateAsTRGO()             PWMB_SelectTRGO(2)
#define PWMB_MatchAsTRGO()              PWMB_SelectTRGO(3)
#define PWMB_OC5REFAsTRGO()             PWMB_SelectTRGO(4)
#define PWMB_OC6REFAsTRGO()             PWMB_SelectTRGO(5)
#define PWMB_OC7REFAsTRGO()             PWMB_SelectTRGO(6)
#define PWMB_OC8REFAsTRGO()             PWMB_SelectTRGO(7)

#define HSPWMB_SelectTRGO(n)            MODIFY_HSPWMB(PWMB_CR2,  PWMBCR2_MMS_MSK, ((n) << 4))
#define HSPWMB_ResetAsTRGO()            HSPWMB_SelectTRGO(0)
#define HSPWMB_EnableAsTRGO()           HSPWMB_SelectTRGO(1)
#define HSPWMB_UpdateAsTRGO()           HSPWMB_SelectTRGO(2)
#define HSPWMB_MatchAsTRGO()            HSPWMB_SelectTRGO(3)
#define HSPWMB_OC5REFAsTRGO()           HSPWMB_SelectTRGO(4)
#define HSPWMB_OC6REFAsTRGO()           HSPWMB_SelectTRGO(5)
#define HSPWMB_OC7REFAsTRGO()           HSPWMB_SelectTRGO(6)
#define HSPWMB_OC8REFAsTRGO()           HSPWMB_SelectTRGO(7)

#define PWMBCR2_COMS_MSK                BIT2
#define PWMB_CCOCUpdateMode0()          CLR_REG_BIT(PWMB_CR2, PWMBCR2_COMS_MSK)
#define PWMB_CCOCUpdateMode1()          SET_REG_BIT(PWMB_CR2, PWMBCR2_COMS_MSK)

#define HSPWMB_CCOCUpdateMode0()        CLR_HSPWMB_BIT(PWMB_CR2, PWMBCR2_COMS_MSK)
#define HSPWMB_CCOCUpdateMode1()        SET_HSPWMB_BIT(PWMB_CR2, PWMBCR2_COMS_MSK)

#define PWMBCR2_CCPC_MSK                BIT0
#define PWMB_UnbufferCCOC()             CLR_REG_BIT(PWMB_CR2, PWMBCR2_CCPC_MSK)
#define PWMB_BufferCCOC()               SET_REG_BIT(PWMB_CR2, PWMBCR2_CCPC_MSK)

#define HSPWMB_UnbufferCCOC()           CLR_HSPWMB_BIT(PWMB_CR2, PWMBCR2_CCPC_MSK)
#define HSPWMB_BufferCCOC()             SET_HSPWMB_BIT(PWMB_CR2, PWMBCR2_CCPC_MSK)

#define PWMBSMCR_MSM_MSK                BIT7
#define PWMB_StandaloneMode()           CLR_REG_BIT(PWMB_SMCR, PWMBSMCR_MSM_MSK)
#define PWMB_MasterSlaveMode()          SET_REG_BIT(PWMB_SMCR, PWMBSMCR_MSM_MSK)

#define HSPWMB_StandaloneMode()         CLR_HSPWMB_BIT(PWMB_SMCR, PWMBSMCR_MSM_MSK)
#define HSPWMB_MasterSlaveMode()        SET_HSPWMB_BIT(PWMB_SMCR, PWMBSMCR_MSM_MSK)

#define PWMBSMCR_TS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMB_SelectTRGI(n)              MODIFY_REG(PWMB_SMCR,  PWMBSMCR_TS_MSK, ((n) << 4))
#define PWMB_DisableTRGI()              PWMB_SelectTRGI(0)
#define PWMB_TI5FEDAsTRGI()             PWMB_SelectTRGI(4)
#define PWMB_TI5FP5AsTRGI()             PWMB_SelectTRGI(5)
#define PWMB_TI6FP6AsTRGI()             PWMB_SelectTRGI(6)
#define PWMB_ETRFAsTRGI()               PWMB_SelectTRGI(7)

#define HSPWMB_SelectTRGI(n)            MODIFY_HSPWMB(PWMB_SMCR,  PWMBSMCR_TS_MSK, ((n) << 4))
#define HSPWMB_DisableTRGI()            HSPWMB_SelectTRGI(0)
#define HSPWMB_TI5FEDAsTRGI()           HSPWMB_SelectTRGI(4)
#define HSPWMB_TI5FP5AsTRGI()           HSPWMB_SelectTRGI(5)
#define HSPWMB_TI6FP6AsTRGI()           HSPWMB_SelectTRGI(6)
#define HSPWMB_ETRFAsTRGI()             HSPWMB_SelectTRGI(7)

#define PWMBSMCR_SMS_MSK                (BIT2 | BIT1 | BIT0)
#define PWMB_SetClockMode(n)            MODIFY_REG(PWMB_SMCR,  PWMBSMCR_SMS_MSK, ((n) << 0))
#define PWMB_InternalClockMode()        PWMB_SetClockMode(0)
#define PWMB_EncoderMode1()             PWMB_SetClockMode(1)
#define PWMB_EncoderMode2()             PWMB_SetClockMode(2)
#define PWMB_EncoderMode3()             PWMB_SetClockMode(3)
#define PWMB_TriggerResetMode()         PWMB_SetClockMode(4)
#define PWMB_TriggerGateMode()          PWMB_SetClockMode(5)
#define PWMB_TriggerStartMode()         PWMB_SetClockMode(6)
#define PWMB_ExternalClockMode()        PWMB_SetClockMode(7)

#define HSPWMB_SetClockMode(n)          MODIFY_HSPWMB(PWMB_SMCR,  PWMBSMCR_SMS_MSK, ((n) << 0))
#define HSPWMB_InternalClockMode()      HSPWMB_SetClockMode(0)
#define HSPWMB_EncoderMode1()           HSPWMB_SetClockMode(1)
#define HSPWMB_EncoderMode2()           HSPWMB_SetClockMode(2)
#define HSPWMB_EncoderMode3()           HSPWMB_SetClockMode(3)
#define HSPWMB_TriggerResetMode()       HSPWMB_SetClockMode(4)
#define HSPWMB_TriggerGateMode()        HSPWMB_SetClockMode(5)
#define HSPWMB_TriggerStartMode()       HSPWMB_SetClockMode(6)
#define HSPWMB_ExternalClockMode()      HSPWMB_SetClockMode(7)

#define PWMBETR_ETP_MSK                 BIT7
#define PWMB_ETRNonInverted()           CLR_REG_BIT(PWMB_ETR, PWMBETR_ETP_MSK)
#define PWMB_ETRInverted()              SET_REG_BIT(PWMB_ETR, PWMBETR_ETP_MSK)

#define HSPWMB_ETRNonInverted()         CLR_HSPWMB_BIT(PWMB_ETR, PWMBETR_ETP_MSK)
#define HSPWMB_ETRInverted()            SET_HSPWMB_BIT(PWMB_ETR, PWMBETR_ETP_MSK)

