fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMBETR_ECE_MSK                 BIT6
#define PWMB_DisableExternalClock2()    CLR_REG_BIT(PWMB_ETR, PWMBETR_ECE_MSK)
#define PWMB_EnableExternalClock2()     SET_REG_BIT(PWMB_ETR, PWMBETR_ECE_MSK)

#define HSPWMB_DisableExternalClock2()  CLR_HSPWMB_BIT(PWMB_ETR, PWMBETR_ECE_MSK)
#define HSPWMB_EnableExternalClock2()   SET_HSPWMB_BIT(PWMB_ETR, PWMBETR_ECE_MSK)

#define PWMBETR_ETPS_MSK                (BIT5 | BIT4)
#define PWMB_SetETRDivider(n)           MODIFY_REG(PWMB_ETR,  PWMBETR_ETPS_MSK, ((n) << 4))
#define PWMB_ETRDivider1()              PWMB_SetETRDivider(0)
#define PWMB_ETRDivider2()              PWMB_SetETRDivider(1)
#define PWMB_ETRDivider4()              PWMB_SetETRDivider(2)
#define PWMB_ETRDivider8()              PWMB_SetETRDivider(3)

#define HSPWMB_SetETRDivider(n)         MODIFY_HSPWMB(PWMB_ETR,  PWMBETR_ETPS_MSK, ((n) << 4))
#define HSPWMB_ETRDivider1()            HSPWMB_SetETRDivider(0)
#define HSPWMB_ETRDivider2()            HSPWMB_SetETRDivider(1)
#define HSPWMB_ETRDivider4()            HSPWMB_SetETRDivider(2)
#define HSPWMB_ETRDivider8()            HSPWMB_SetETRDivider(3)

#define PWMBETR_ETF_MSK                 (BIT_LN)
#define PWMB_SetETRFilter(n)            MODIFY_REG(PWMB_ETR,  PWMBETR_ETF_MSK, ((n) << 0))
#define PWMB_ETRFilter1()               PWMB_SetETRFilter(0)
#define PWMB_ETRFilter2()               PWMB_SetETRFilter(1)
#define PWMB_ETRFilter4()               PWMB_SetETRFilter(2)
#define PWMB_ETRFilter8()               PWMB_SetETRFilter(3)
#define PWMB_ETRFilter12()              PWMB_SetETRFilter(4)
#define PWMB_ETRFilter16()              PWMB_SetETRFilter(5)
#define PWMB_ETRFilter24()              PWMB_SetETRFilter(6)
#define PWMB_ETRFilter32()              PWMB_SetETRFilter(7)
#define PWMB_ETRFilter48()              PWMB_SetETRFilter(8)
#define PWMB_ETRFilter64()              PWMB_SetETRFilter(9)
#define PWMB_ETRFilter80()              PWMB_SetETRFilter(10)
#define PWMB_ETRFilter96()              PWMB_SetETRFilter(11)
#define PWMB_ETRFilter128()             PWMB_SetETRFilter(12)
#define PWMB_ETRFilter160()             PWMB_SetETRFilter(13)
#define PWMB_ETRFilter192()             PWMB_SetETRFilter(14)
#define PWMB_ETRFilter256()             PWMB_SetETRFilter(15)

#define HSPWMB_SetETRFilter(n)          MODIFY_HSPWMB(PWMB_ETR,  PWMBETR_ETF_MSK, ((n) << 0))
#define HSPWMB_ETRFilter1()             HSPWMB_SetETRFilter(0)
#define HSPWMB_ETRFilter2()             HSPWMB_SetETRFilter(1)
#define HSPWMB_ETRFilter4()             HSPWMB_SetETRFilter(2)
#define HSPWMB_ETRFilter8()             HSPWMB_SetETRFilter(3)
#define HSPWMB_ETRFilter12()            HSPWMB_SetETRFilter(4)
#define HSPWMB_ETRFilter16()            HSPWMB_SetETRFilter(5)
#define HSPWMB_ETRFilter24()            HSPWMB_SetETRFilter(6)
#define HSPWMB_ETRFilter32()            HSPWMB_SetETRFilter(7)
#define HSPWMB_ETRFilter48()            HSPWMB_SetETRFilter(8)
#define HSPWMB_ETRFilter64()            HSPWMB_SetETRFilter(9)
#define HSPWMB_ETRFilter80()            HSPWMB_SetETRFilter(10)
#define HSPWMB_ETRFilter96()            HSPWMB_SetETRFilter(11)
#define HSPWMB_ETRFilter128()           HSPWMB_SetETRFilter(12)
#define HSPWMB_ETRFilter160()           HSPWMB_SetETRFilter(13)
#define HSPWMB_ETRFilter192()           HSPWMB_SetETRFilter(14)
#define HSPWMB_ETRFilter256()           HSPWMB_SetETRFilter(15)

#define PWMBEGR_BG_MSK                  BIT7
#define PWMBEGR_TG_MSK                  BIT6
#define PWMBEGR_COMG_MSK                BIT5
#define PWMBEGR_CC8G_MSK                BIT4
#define PWMBEGR_CC7G_MSK                BIT3
#define PWMBEGR_CC6G_MSK                BIT2
#define PWMBEGR_CC5G_MSK                BIT1
#define PWMBEGR_UG_MSK                  BIT0
#define PWMB_GenerateBreakEvent()       SET_REG_BIT(PWMB_EGR, PWMBEGR_BG_MSK)
#define PWMB_GenerateTriggerEvent()     SET_REG_BIT(PWMB_EGR, PWMBEGR_TG_MSK)
#define PWMB_GenerateCOMEvent()         SET_REG_BIT(PWMB_EGR, PWMBEGR_COMG_MSK)
#define PWMB_GenerateCC8Event()         SET_REG_BIT(PWMB_EGR, PWMBEGR_CC8G_MSK)
#define PWMB_GenerateCC7Event()         SET_REG_BIT(PWMB_EGR, PWMBEGR_CC7G_MSK)
#define PWMB_GenerateCC6Event()         SET_REG_BIT(PWMB_EGR, PWMBEGR_CC6G_MSK)
#define PWMB_GenerateCC5Event()         SET_REG_BIT(PWMB_EGR, PWMBEGR_CC5G_MSK)
#define PWMB_GenerateUpdateEvent()      SET_REG_BIT(PWMB_EGR, PWMBEGR_UG_MSK)

#define HSPWMB_GenerateBreakEvent()     SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_BG_MSK)
#define HSPWMB_GenerateTriggerEvent()   SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_TG_MSK)
#define HSPWMB_GenerateCOMEvent()       SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_COMG_MSK)
#define HSPWMB_GenerateCC8Event()       SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_CC8G_MSK)
#define HSPWMB_GenerateCC7Event()       SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_CC7G_MSK)
#define HSPWMB_GenerateCC6Event()       SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_CC6G_MSK)
#define HSPWMB_GenerateCC5Event()       SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_CC5G_MSK)
#define HSPWMB_GenerateUpdateEvent()    SET_HSPWMB_BIT(PWMB_EGR, PWMBEGR_UG_MSK)

#define PWMBCCMR1_OC5CE_MSK             BIT7
#define PWMB_EnableETRFClearOC5REF()    SET_REG_BIT(PWMB_CCMR1, PWMBCCMR1_OC5CE_MSK)
#define PWMB_DisableETRFClearOC5REF()   CLR_REG_BIT(PWMB_CCMR1, PWMBCCMR1_OC5CE_MSK)

#define HSPWMB_EnableETRFClearOC5REF()  SET_HSPWMB_BIT(PWMB_CCMR1, PWMBCCMR1_OC5CE_MSK)
#define HSPWMB_DisableETRFClearOC5REF() CLR_HSPWMB_BIT(PWMB_CCMR1, PWMBCCMR1_OC5CE_MSK)

#define PWMBCCMR1_OC5M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMB_SetOC5OutputMode(n)        MODIFY_REG(PWMB_CCMR1,  PWMBCCMR1_OC5M_MSK, ((n) << 4))
#define PWMB_OC5REFFrozen()             PWMB_SetOC5OutputMode(0)
#define PWMB_OC5REFHighIfMatch()        PWMB_SetOC5OutputMode(1)
#define PWMB_OC5REFLowIfMatch()         PWMB_SetOC5OutputMode(2)
#define PWMB_OC5REFToggleIfMatch()      PWMB_SetOC5OutputMode(3)
#define PWMB_OC5REFForceLow()           PWMB_SetOC5OutputMode(4)
#define PWMB_OC5REFForceHigh()          PWMB_SetOC5OutputMode(5)
#define PWMB_OC5REFPWMMode1()           PWMB_SetOC5OutputMode(6)
#define PWMB_OC5REFPWMMode2()           PWMB_SetOC5OutputMode(7)

#define HSPWMB_SetOC5OutputMode(n)      MODIFY_HSPWMB(PWMB_CCMR1,  PWMBCCMR1_OC5M_MSK, ((n) << 4))
#define HSPWMB_OC5REFFrozen()           HSPWMB_SetOC5OutputMode(0)
#define HSPWMB_OC5REFHighIfMatch()      HSPWMB_SetOC5OutputMode(1)
#define HSPWMB_OC5REFLowIfMatch()       HSPWMB_SetOC5OutputMode(2)
#define HSPWMB_OC5REFToggleIfMatch()    HSPWMB_SetOC5OutputMode(3)
#define HSPWMB_OC5REFForceLow()         HSPWMB_SetOC5OutputMode(4)
#define HSPWMB_OC5REFForceHigh()        HSPWMB_SetOC5OutputMode(5)
#define HSPWMB_OC5REFPWMMode1()         HSPWMB_SetOC5OutputMode(6)
#define HSPWMB_OC5REFPWMMode2()         HSPWMB_SetOC5OutputMode(7)

#define PWMBCCMR1_OC5PE_MSK             BIT3
#define PWMB_UnbufferCCR5()             CLR_REG_BIT(PWMB_CCMR1, PWMBCCMR1_OC5PE_MSK)
#define PWMB_BufferCCR5()               SET_REG_BIT(PWMB_CCMR1, PWMBCCMR1_OC5PE_MSK)

#define HSPWMB_UnbufferCCR5()           CLR_HSPWMB_BIT(PWMB_CCMR1, PWMBCCMR1_OC5PE_MSK)
#define HSPWMB_BufferCCR5()             SET_HSPWMB_BIT(PWMB_CCMR1, PWMBCCMR1_OC5PE_MSK)

#define PWMBCCMR1_OC5FE_MSK             BIT2
#define PWMB_DisableOC5FastMode()       CLR_REG_BIT(PWMB_CCMR1, PWMBCCMR1_OC5FE_MSK)
#define PWMB_EnableOC5FastMode()        SET_REG_BIT(PWMB_CCMR1, PWMBCCMR1_OC5FE_MSK)

#define HSPWMB_DisableOC5FastMode()     CLR_HSPWMB_BIT(PWMB_CCMR1, PWMBCCMR1_OC5FE_MSK)
#define HSPWMB_EnableOC5FastMode()      SET_HSPWMB_BIT(PWMB_CCMR1, PWMBCCMR1_OC5FE_MSK)

#define PWMBCCMR1_CC5S_MSK              (BIT1 | BIT0)
#define PWMB_SetCC5Mode(n)              MODIFY_REG(PWMB_CCMR1,  PWMBCCMR1_CC5S_MSK, ((n) << 0))
#define PWMB_CC5Output()                PWMB_SetCC5Mode(0)
#define PWMB_CC5CaptureTI5FP5()         PWMB_SetCC5Mode(1)
#define PWMB_CC5CaptureTI6FP5()         PWMB_SetCC5Mode(2)
#define PWMB_CC5CaptureTRC()            PWMB_SetCC5Mode(3)

