fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMB_SetCC5Mode(n)            MODIFY_HSPWMB(PWMB_CCMR1,  PWMBCCMR1_CC5S_MSK, ((n) << 0))
#define HSPWMB_CC5Output()              HSPWMB_SetCC5Mode(0)
#define HSPWMB_CC5CaptureTI5FP5()       HSPWMB_SetCC5Mode(1)
#define HSPWMB_CC5CaptureTI6FP5()       HSPWMB_SetCC5Mode(2)
#define HSPWMB_CC5CaptureTRC()          HSPWMB_SetCC5Mode(3)

#define PWMBCCMR1_IC5F_MSK              (BIT_HN)
#define PWMB_SetIC5Filter(n)            MODIFY_REG(PWMB_CCMR1,  PWMBCCMR1_IC5F_MSK, ((n) << 4))
#define PWMB_IC5Filter1()               PWMB_SetIC5Filter(0)
#define PWMB_IC5Filter2()               PWMB_SetIC5Filter(1)
#define PWMB_IC5Filter4()               PWMB_SetIC5Filter(2)
#define PWMB_IC5Filter8()               PWMB_SetIC5Filter(3)
#define PWMB_IC5Filter12()              PWMB_SetIC5Filter(4)
#define PWMB_IC5Filter16()              PWMB_SetIC5Filter(5)
#define PWMB_IC5Filter24()              PWMB_SetIC5Filter(6)
#define PWMB_IC5Filter32()              PWMB_SetIC5Filter(7)
#define PWMB_IC5Filter48()              PWMB_SetIC5Filter(8)
#define PWMB_IC5Filter64()              PWMB_SetIC5Filter(9)
#define PWMB_IC5Filter80()              PWMB_SetIC5Filter(10)
#define PWMB_IC5Filter96()              PWMB_SetIC5Filter(11)
#define PWMB_IC5Filter128()             PWMB_SetIC5Filter(12)
#define PWMB_IC5Filter160()             PWMB_SetIC5Filter(13)
#define PWMB_IC5Filter192()             PWMB_SetIC5Filter(14)
#define PWMB_IC5Filter256()             PWMB_SetIC5Filter(15)

#define HSPWMB_SetIC5Filter(n)          MODIFY_HSPWMB(PWMB_CCMR1,  PWMBCCMR1_IC5F_MSK, ((n) << 4))
#define HSPWMB_IC5Filter1()             HSPWMB_SetIC5Filter(0)
#define HSPWMB_IC5Filter2()             HSPWMB_SetIC5Filter(1)
#define HSPWMB_IC5Filter4()             HSPWMB_SetIC5Filter(2)
#define HSPWMB_IC5Filter8()             HSPWMB_SetIC5Filter(3)
#define HSPWMB_IC5Filter12()            HSPWMB_SetIC5Filter(4)
#define HSPWMB_IC5Filter16()            HSPWMB_SetIC5Filter(5)
#define HSPWMB_IC5Filter24()            HSPWMB_SetIC5Filter(6)
#define HSPWMB_IC5Filter32()            HSPWMB_SetIC5Filter(7)
#define HSPWMB_IC5Filter48()            HSPWMB_SetIC5Filter(8)
#define HSPWMB_IC5Filter64()            HSPWMB_SetIC5Filter(9)
#define HSPWMB_IC5Filter80()            HSPWMB_SetIC5Filter(10)
#define HSPWMB_IC5Filter96()            HSPWMB_SetIC5Filter(11)
#define HSPWMB_IC5Filter128()           HSPWMB_SetIC5Filter(12)
#define HSPWMB_IC5Filter160()           HSPWMB_SetIC5Filter(13)
#define HSPWMB_IC5Filter192()           HSPWMB_SetIC5Filter(14)
#define HSPWMB_IC5Filter256()           HSPWMB_SetIC5Filter(15)

#define PWMBCCMR1_IC5PS_MSK             (BIT3 | BIT2)
#define PWMB_SetIC5Divider(n)           MODIFY_REG(PWMB_CCMR1,  PWMBCCMR1_IC5PS_MSK, ((n) << 2))
#define PWMB_IC5Divider1()              PWMB_SetIC5Divider(0)
#define PWMB_IC5Divider2()              PWMB_SetIC5Divider(1)
#define PWMB_IC5Divider4()              PWMB_SetIC5Divider(2)
#define PWMB_IC5Divider8()              PWMB_SetIC5Divider(3)

#define HSPWMB_SetIC5Divider(n)         MODIFY_HSPWMB(PWMB_CCMR1,  PWMBCCMR1_IC5PS_MSK, ((n) << 2))
#define HSPWMB_IC5Divider1()            HSPWMB_SetIC5Divider(0)
#define HSPWMB_IC5Divider2()            HSPWMB_SetIC5Divider(1)
#define HSPWMB_IC5Divider4()            HSPWMB_SetIC5Divider(2)
#define HSPWMB_IC5Divider8()            HSPWMB_SetIC5Divider(3)

#define PWMBCCMR2_OC6CE_MSK             BIT7
#define PWMB_EnableETRFClearOC6REF()    SET_REG_BIT(PWMB_CCMR2, PWMBCCMR2_OC6CE_MSK)
#define PWMB_DisableETRFClearOC6REF()   CLR_REG_BIT(PWMB_CCMR2, PWMBCCMR2_OC6CE_MSK)

#define HSPWMB_EnableETRFClearOC6REF()  SET_HSPWMB_BIT(PWMB_CCMR2, PWMBCCMR2_OC6CE_MSK)
#define HSPWMB_DisableETRFClearOC6REF() CLR_HSPWMB_BIT(PWMB_CCMR2, PWMBCCMR2_OC6CE_MSK)

#define PWMBCCMR2_OC6M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMB_SetOC6OutputMode(n)        MODIFY_REG(PWMB_CCMR2,  PWMBCCMR2_OC6M_MSK, ((n) << 4))
#define PWMB_OC6REFFrozen()             PWMB_SetOC6OutputMode(0)
#define PWMB_OC6REFHighIfMatch()        PWMB_SetOC6OutputMode(1)
#define PWMB_OC6REFLowIfMatch()         PWMB_SetOC6OutputMode(2)
#define PWMB_OC6REFToggleIfMatch()      PWMB_SetOC6OutputMode(3)
#define PWMB_OC6REFForceLow()           PWMB_SetOC6OutputMode(4)
#define PWMB_OC6REFForceHigh()          PWMB_SetOC6OutputMode(5)
#define PWMB_OC6REFPWMMode1()           PWMB_SetOC6OutputMode(6)
#define PWMB_OC6REFPWMMode2()           PWMB_SetOC6OutputMode(7)

#define HSPWMB_SetOC6OutputMode(n)      MODIFY_HSPWMB(PWMB_CCMR2,  PWMBCCMR2_OC6M_MSK, ((n) << 4))
#define HSPWMB_OC6REFFrozen()           HSPWMB_SetOC6OutputMode(0)
#define HSPWMB_OC6REFHighIfMatch()      HSPWMB_SetOC6OutputMode(1)
#define HSPWMB_OC6REFLowIfMatch()       HSPWMB_SetOC6OutputMode(2)
#define HSPWMB_OC6REFToggleIfMatch()    HSPWMB_SetOC6OutputMode(3)
#define HSPWMB_OC6REFForceLow()         HSPWMB_SetOC6OutputMode(4)
#define HSPWMB_OC6REFForceHigh()        HSPWMB_SetOC6OutputMode(5)
#define HSPWMB_OC6REFPWMMode1()         HSPWMB_SetOC6OutputMode(6)
#define HSPWMB_OC6REFPWMMode2()         HSPWMB_SetOC6OutputMode(7)

#define PWMBCCMR2_OC6PE_MSK             BIT3
#define PWMB_UnbufferCCR6()             CLR_REG_BIT(PWMB_CCMR2, PWMBCCMR2_OC6PE_MSK)
#define PWMB_BufferCCR6()               SET_REG_BIT(PWMB_CCMR2, PWMBCCMR2_OC6PE_MSK)

#define HSPWMB_UnbufferCCR6()           CLR_HSPWMB_BIT(PWMB_CCMR2, PWMBCCMR2_OC6PE_MSK)
#define HSPWMB_BufferCCR6()             SET_HSPWMB_BIT(PWMB_CCMR2, PWMBCCMR2_OC6PE_MSK)

#define PWMBCCMR2_OC6FE_MSK             BIT2
#define PWMB_DisableOC6FastMode()       CLR_REG_BIT(PWMB_CCMR2, PWMBCCMR2_OC6FE_MSK)
#define PWMB_EnableOC6FastMode()        SET_REG_BIT(PWMB_CCMR2, PWMBCCMR2_OC6FE_MSK)

#define HSPWMB_DisableOC6FastMode()     CLR_HSPWMB_BIT(PWMB_CCMR2, PWMBCCMR2_OC6FE_MSK)
#define HSPWMB_EnableOC6FastMode()      SET_HSPWMB_BIT(PWMB_CCMR2, PWMBCCMR2_OC6FE_MSK)

#define PWMBCCMR2_CC6S_MSK              (BIT1 | BIT0)
#define PWMB_SetCC6Mode(n)              MODIFY_REG(PWMB_CCMR2,  PWMBCCMR2_CC6S_MSK, ((n) << 0))
#define PWMB_CC6Output()                PWMB_SetCC6Mode(0)
#define PWMB_CC6CaptureTI6FP6()         PWMB_SetCC6Mode(1)
#define PWMB_CC6CaptureTI5FP6()         PWMB_SetCC6Mode(2)
#define PWMB_CC6CaptureTRC()            PWMB_SetCC6Mode(3)

#define HSPWMB_SetCC6Mode(n)            MODIFY_HSPWMB(PWMB_CCMR2,  PWMBCCMR2_CC6S_MSK, ((n) << 0))
#define HSPWMB_CC6Output()              HSPWMB_SetCC6Mode(0)
#define HSPWMB_CC6CaptureTI6FP6()       HSPWMB_SetCC6Mode(1)
#define HSPWMB_CC6CaptureTI5FP6()       HSPWMB_SetCC6Mode(2)
#define HSPWMB_CC6CaptureTRC()          HSPWMB_SetCC6Mode(3)

