fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMBCCMR2_IC6F_MSK              (BIT_HN)
#define PWMB_SetIC6Filter(n)            MODIFY_REG(PWMB_CCMR2,  PWMBCCMR2_IC6F_MSK, ((n) << 4))
#define PWMB_IC6Filter1()               PWMB_SetIC6Filter(0)
#define PWMB_IC6Filter2()               PWMB_SetIC6Filter(1)
#define PWMB_IC6Filter4()               PWMB_SetIC6Filter(2)
#define PWMB_IC6Filter8()               PWMB_SetIC6Filter(3)
#define PWMB_IC6Filter12()              PWMB_SetIC6Filter(4)
#define PWMB_IC6Filter16()              PWMB_SetIC6Filter(5)
#define PWMB_IC6Filter24()              PWMB_SetIC6Filter(6)
#define PWMB_IC6Filter32()              PWMB_SetIC6Filter(7)
#define PWMB_IC6Filter48()              PWMB_SetIC6Filter(8)
#define PWMB_IC6Filter64()              PWMB_SetIC6Filter(9)
#define PWMB_IC6Filter80()              PWMB_SetIC6Filter(10)
#define PWMB_IC6Filter96()              PWMB_SetIC6Filter(11)
#define PWMB_IC6Filter128()             PWMB_SetIC6Filter(12)
#define PWMB_IC6Filter160()             PWMB_SetIC6Filter(13)
#define PWMB_IC6Filter192()             PWMB_SetIC6Filter(14)
#define PWMB_IC6Filter256()             PWMB_SetIC6Filter(15)

#define HSPWMB_SetIC6Filter(n)          MODIFY_HSPWMB(PWMB_CCMR2,  PWMBCCMR2_IC6F_MSK, ((n) << 4))
#define HSPWMB_IC6Filter1()             HSPWMB_SetIC6Filter(0)
#define HSPWMB_IC6Filter2()             HSPWMB_SetIC6Filter(1)
#define HSPWMB_IC6Filter4()             HSPWMB_SetIC6Filter(2)
#define HSPWMB_IC6Filter8()             HSPWMB_SetIC6Filter(3)
#define HSPWMB_IC6Filter12()            HSPWMB_SetIC6Filter(4)
#define HSPWMB_IC6Filter16()            HSPWMB_SetIC6Filter(5)
#define HSPWMB_IC6Filter24()            HSPWMB_SetIC6Filter(6)
#define HSPWMB_IC6Filter32()            HSPWMB_SetIC6Filter(7)
#define HSPWMB_IC6Filter48()            HSPWMB_SetIC6Filter(8)
#define HSPWMB_IC6Filter64()            HSPWMB_SetIC6Filter(9)
#define HSPWMB_IC6Filter80()            HSPWMB_SetIC6Filter(10)
#define HSPWMB_IC6Filter96()            HSPWMB_SetIC6Filter(11)
#define HSPWMB_IC6Filter128()           HSPWMB_SetIC6Filter(12)
#define HSPWMB_IC6Filter160()           HSPWMB_SetIC6Filter(13)
#define HSPWMB_IC6Filter192()           HSPWMB_SetIC6Filter(14)
#define HSPWMB_IC6Filter256()           HSPWMB_SetIC6Filter(15)

#define PWMBCCMR2_IC6PS_MSK             (BIT3 | BIT2)
#define PWMB_SetIC6Divider(n)           MODIFY_REG(PWMB_CCMR2,  PWMBCCMR2_IC6PS_MSK, ((n) << 2))
#define PWMB_IC6Divider1()              PWMB_SetIC6Divider(0)
#define PWMB_IC6Divider2()              PWMB_SetIC6Divider(1)
#define PWMB_IC6Divider4()              PWMB_SetIC6Divider(2)
#define PWMB_IC6Divider8()              PWMB_SetIC6Divider(3)

#define HSPWMB_SetIC6Divider(n)         MODIFY_HSPWMB(PWMB_CCMR2,  PWMBCCMR2_IC6PS_MSK, ((n) << 2))
#define HSPWMB_IC6Divider1()            HSPWMB_SetIC6Divider(0)
#define HSPWMB_IC6Divider2()            HSPWMB_SetIC6Divider(1)
#define HSPWMB_IC6Divider4()            HSPWMB_SetIC6Divider(2)
#define HSPWMB_IC6Divider8()            HSPWMB_SetIC6Divider(3)

#define PWMBCCMR3_OC7CE_MSK             BIT7
#define PWMB_EnableETRFClearOC7REF()    SET_REG_BIT(PWMB_CCMR3, PWMBCCMR3_OC7CE_MSK)
#define PWMB_DisableETRFClearOC7REF()   CLR_REG_BIT(PWMB_CCMR3, PWMBCCMR3_OC7CE_MSK)

#define HSPWMB_EnableETRFClearOC7REF()  SET_HSPWMB_BIT(PWMB_CCMR3, PWMBCCMR3_OC7CE_MSK)
#define HSPWMB_DisableETRFClearOC7REF() CLR_HSPWMB_BIT(PWMB_CCMR3, PWMBCCMR3_OC7CE_MSK)

#define PWMBCCMR3_OC7M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMB_SetOC7OutputMode(n)        MODIFY_REG(PWMB_CCMR3,  PWMBCCMR3_OC7M_MSK, ((n) << 4))
#define PWMB_OC7REFFrozen()             PWMB_SetOC7OutputMode(0)
#define PWMB_OC7REFHighIfMatch()        PWMB_SetOC7OutputMode(1)
#define PWMB_OC7REFLowIfMatch()         PWMB_SetOC7OutputMode(2)
#define PWMB_OC7REFToggleIfMatch()      PWMB_SetOC7OutputMode(3)
#define PWMB_OC7REFForceLow()           PWMB_SetOC7OutputMode(4)
#define PWMB_OC7REFForceHigh()          PWMB_SetOC7OutputMode(5)
#define PWMB_OC7REFPWMMode1()           PWMB_SetOC7OutputMode(6)
#define PWMB_OC7REFPWMMode2()           PWMB_SetOC7OutputMode(7)

#define HSPWMB_SetOC7OutputMode(n)      MODIFY_HSPWMB(PWMB_CCMR3,  PWMBCCMR3_OC7M_MSK, ((n) << 4))
#define HSPWMB_OC7REFFrozen()           HSPWMB_SetOC7OutputMode(0)
#define HSPWMB_OC7REFHighIfMatch()      HSPWMB_SetOC7OutputMode(1)
#define HSPWMB_OC7REFLowIfMatch()       HSPWMB_SetOC7OutputMode(2)
#define HSPWMB_OC7REFToggleIfMatch()    HSPWMB_SetOC7OutputMode(3)
#define HSPWMB_OC7REFForceLow()         HSPWMB_SetOC7OutputMode(4)
#define HSPWMB_OC7REFForceHigh()        HSPWMB_SetOC7OutputMode(5)
#define HSPWMB_OC7REFPWMMode1()         HSPWMB_SetOC7OutputMode(6)
#define HSPWMB_OC7REFPWMMode2()         HSPWMB_SetOC7OutputMode(7)

#define PWMBCCMR3_OC7PE_MSK             BIT3
#define PWMB_UnbufferCCR7()             CLR_REG_BIT(PWMB_CCMR3, PWMBCCMR3_OC7PE_MSK)
#define PWMB_BufferCCR7()               SET_REG_BIT(PWMB_CCMR3, PWMBCCMR3_OC7PE_MSK)

#define HSPWMB_UnbufferCCR7()           CLR_HSPWMB_BIT(PWMB_CCMR3, PWMBCCMR3_OC7PE_MSK)
#define HSPWMB_BufferCCR7()             SET_HSPWMB_BIT(PWMB_CCMR3, PWMBCCMR3_OC7PE_MSK)

#define PWMBCCMR3_OC7FE_MSK             BIT2
#define PWMB_DisableOC7FastMode()       CLR_REG_BIT(PWMB_CCMR3, PWMBCCMR3_OC7FE_MSK)
#define PWMB_EnableOC7FastMode()        SET_REG_BIT(PWMB_CCMR3, PWMBCCMR3_OC7FE_MSK)

#define HSPWMB_DisableOC7FastMode()     CLR_HSPWMB_BIT(PWMB_CCMR3, PWMBCCMR3_OC7FE_MSK)
#define HSPWMB_EnableOC7FastMode()      SET_HSPWMB_BIT(PWMB_CCMR3, PWMBCCMR3_OC7FE_MSK)

#define PWMBCCMR3_CC7S_MSK              (BIT1 | BIT0)
#define PWMB_SetCC7Mode(n)              MODIFY_REG(PWMB_CCMR3,  PWMBCCMR3_CC7S_MSK, ((n) << 0))
#define PWMB_CC7Output()                PWMB_SetCC7Mode(0)
#define PWMB_CC7CaptureTI7FP7()         PWMB_SetCC7Mode(1)
#define PWMB_CC7CaptureTI8FP7()         PWMB_SetCC7Mode(2)
#define PWMB_CC7CaptureTRC()            PWMB_SetCC7Mode(3)

#define HSPWMB_SetCC7Mode(n)            MODIFY_HSPWMB(PWMB_CCMR3,  PWMBCCMR3_CC7S_MSK, ((n) << 0))
#define HSPWMB_CC7Output()              HSPWMB_SetCC7Mode(0)
#define HSPWMB_CC7CaptureTI7FP7()       HSPWMB_SetCC7Mode(1)
#define HSPWMB_CC7CaptureTI8FP7()       HSPWMB_SetCC7Mode(2)
#define HSPWMB_CC7CaptureTRC()          HSPWMB_SetCC7Mode(3)

#define PWMBCCMR3_IC7F_MSK              (BIT_HN)
#define PWMB_SetIC7Filter(n)            MODIFY_REG(PWMB_CCMR3,  PWMBCCMR3_IC7F_MSK, ((n) << 4))
#define PWMB_IC7Filter1()               PWMB_SetIC7Filter(0)
#define PWMB_IC7Filter2()               PWMB_SetIC7Filter(1)
#define PWMB_IC7Filter4()               PWMB_SetIC7Filter(2)
#define PWMB_IC7Filter8()               PWMB_SetIC7Filter(3)
#define PWMB_IC7Filter12()              PWMB_SetIC7Filter(4)
#define PWMB_IC7Filter16()              PWMB_SetIC7Filter(5)
#define PWMB_IC7Filter24()              PWMB_SetIC7Filter(6)
#define PWMB_IC7Filter32()              PWMB_SetIC7Filter(7)
#define PWMB_IC7Filter48()              PWMB_SetIC7Filter(8)
#define PWMB_IC7Filter64()              PWMB_SetIC7Filter(9)
#define PWMB_IC7Filter80()              PWMB_SetIC7Filter(10)
#define PWMB_IC7Filter96()              PWMB_SetIC7Filter(11)
#define PWMB_IC7Filter128()             PWMB_SetIC7Filter(12)
#define PWMB_IC7Filter160()             PWMB_SetIC7Filter(13)
#define PWMB_IC7Filter192()             PWMB_SetIC7Filter(14)
#define PWMB_IC7Filter256()             PWMB_SetIC7Filter(15)

#define HSPWMB_SetIC7Filter(n)          MODIFY_HSPWMB(PWMB_CCMR3,  PWMBCCMR3_IC7F_MSK, ((n) << 4))
#define HSPWMB_IC7Filter1()             HSPWMB_SetIC7Filter(0)
#define HSPWMB_IC7Filter2()             HSPWMB_SetIC7Filter(1)
#define HSPWMB_IC7Filter4()             HSPWMB_SetIC7Filter(2)
#define HSPWMB_IC7Filter8()             HSPWMB_SetIC7Filter(3)
#define HSPWMB_IC7Filter12()            HSPWMB_SetIC7Filter(4)
#define HSPWMB_IC7Filter16()            HSPWMB_SetIC7Filter(5)
#define HSPWMB_IC7Filter24()            HSPWMB_SetIC7Filter(6)
#define HSPWMB_IC7Filter32()            HSPWMB_SetIC7Filter(7)
#define HSPWMB_IC7Filter48()            HSPWMB_SetIC7Filter(8)
#define HSPWMB_IC7Filter64()            HSPWMB_SetIC7Filter(9)
#define HSPWMB_IC7Filter80()            HSPWMB_SetIC7Filter(10)
#define HSPWMB_IC7Filter96()            HSPWMB_SetIC7Filter(11)
#define HSPWMB_IC7Filter128()           HSPWMB_SetIC7Filter(12)
#define HSPWMB_IC7Filter160()           HSPWMB_SetIC7Filter(13)
#define HSPWMB_IC7Filter192()           HSPWMB_SetIC7Filter(14)
#define HSPWMB_IC7Filter256()           HSPWMB_SetIC7Filter(15)

#define PWMBCCMR3_IC7PS_MSK             (BIT3 | BIT2)
#define PWMB_SetIC7Divider(n)           MODIFY_REG(PWMB_CCMR3,  PWMBCCMR3_IC7PS_MSK, ((n) << 2))
#define PWMB_IC7Divider1()              PWMB_SetIC7Divider(0)
#define PWMB_IC7Divider2()              PWMB_SetIC7Divider(1)
#define PWMB_IC7Divider4()              PWMB_SetIC7Divider(2)
#define PWMB_IC7Divider8()              PWMB_SetIC7Divider(3)

#define HSPWMB_SetIC7Divider(n)         MODIFY_HSPWMB(PWMB_CCMR3,  PWMBCCMR3_IC7PS_MSK, ((n) << 2))
#define HSPWMB_IC7Divider1()            HSPWMB_SetIC7Divider(0)
#define HSPWMB_IC7Divider2()            HSPWMB_SetIC7Divider(1)
#define HSPWMB_IC7Divider4()            HSPWMB_SetIC7Divider(2)
#define HSPWMB_IC7Divider8()            HSPWMB_SetIC7Divider(3)

