fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMBCCMR4_OC8CE_MSK             BIT7
#define PWMB_EnableETRFClearOC8REF()    SET_REG_BIT(PWMB_CCMR4, PWMBCCMR4_OC8CE_MSK)
#define PWMB_DisableETRFClearOC8REF()   CLR_REG_BIT(PWMB_CCMR4, PWMBCCMR4_OC8CE_MSK)

#define HSPWMB_EnableETRFClearOC8REF()  SET_HSPWMB_BIT(PWMB_CCMR4, PWMBCCMR4_OC8CE_MSK)
#define HSPWMB_DisableETRFClearOC8REF() CLR_HSPWMB_BIT(PWMB_CCMR4, PWMBCCMR4_OC8CE_MSK)

#define PWMBCCMR4_OC8M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMB_SetOC8OutputMode(n)        MODIFY_REG(PWMB_CCMR4,  PWMBCCMR4_OC8M_MSK, ((n) << 4))
#define PWMB_OC8REFFrozen()             PWMB_SetOC8OutputMode(0)
#define PWMB_OC8REFHighIfMatch()        PWMB_SetOC8OutputMode(1)
#define PWMB_OC8REFLowIfMatch()         PWMB_SetOC8OutputMode(2)
#define PWMB_OC8REFToggleIfMatch()      PWMB_SetOC8OutputMode(3)
#define PWMB_OC8REFForceLow()           PWMB_SetOC8OutputMode(4)
#define PWMB_OC8REFForceHigh()          PWMB_SetOC8OutputMode(5)
#define PWMB_OC8REFPWMMode1()           PWMB_SetOC8OutputMode(6)
#define PWMB_OC8REFPWMMode2()           PWMB_SetOC8OutputMode(7)

#define HSPWMB_SetOC8OutputMode(n)      MODIFY_HSPWMB(PWMB_CCMR4,  PWMBCCMR4_OC8M_MSK, ((n) << 4))
#define HSPWMB_OC8REFFrozen()           HSPWMB_SetOC8OutputMode(0)
#define HSPWMB_OC8REFHighIfMatch()      HSPWMB_SetOC8OutputMode(1)
#define HSPWMB_OC8REFLowIfMatch()       HSPWMB_SetOC8OutputMode(2)
#define HSPWMB_OC8REFToggleIfMatch()    HSPWMB_SetOC8OutputMode(3)
#define HSPWMB_OC8REFForceLow()         HSPWMB_SetOC8OutputMode(4)
#define HSPWMB_OC8REFForceHigh()        HSPWMB_SetOC8OutputMode(5)
#define HSPWMB_OC8REFPWMMode1()         HSPWMB_SetOC8OutputMode(6)
#define HSPWMB_OC8REFPWMMode2()         HSPWMB_SetOC8OutputMode(7)

#define PWMBCCMR4_OC8PE_MSK             BIT3
#define PWMB_UnbufferCCR8()             CLR_REG_BIT(PWMB_CCMR4, PWMBCCMR4_OC8PE_MSK)
#define PWMB_BufferCCR8()               SET_REG_BIT(PWMB_CCMR4, PWMBCCMR4_OC8PE_MSK)

#define HSPWMB_UnbufferCCR8()           CLR_HSPWMB_BIT(PWMB_CCMR4, PWMBCCMR4_OC8PE_MSK)
#define HSPWMB_BufferCCR8()             SET_HSPWMB_BIT(PWMB_CCMR4, PWMBCCMR4_OC8PE_MSK)

#define PWMBCCMR4_OC8FE_MSK             BIT2
#define PWMB_DisableOC8FastMode()       CLR_REG_BIT(PWMB_CCMR4, PWMBCCMR4_OC8FE_MSK)
#define PWMB_EnableOC8FastMode()        SET_REG_BIT(PWMB_CCMR4, PWMBCCMR4_OC8FE_MSK)

#define HSPWMB_DisableOC8FastMode()     CLR_HSPWMB_BIT(PWMB_CCMR4, PWMBCCMR4_OC8FE_MSK)
#define HSPWMB_EnableOC8FastMode()      SET_HSPWMB_BIT(PWMB_CCMR4, PWMBCCMR4_OC8FE_MSK)

#define PWMBCCMR4_CC8S_MSK              (BIT1 | BIT0)
#define PWMB_SetCC8Mode(n)              MODIFY_REG(PWMB_CCMR4,  PWMBCCMR4_CC8S_MSK, ((n) << 0))
#define PWMB_CC8Output()                PWMB_SetCC8Mode(0)
#define PWMB_CC8CaptureTI8FP8()         PWMB_SetCC8Mode(1)
#define PWMB_CC8CaptureTI7FP8()         PWMB_SetCC8Mode(2)
#define PWMB_CC8CaptureTRC()            PWMB_SetCC8Mode(3)

#define HSPWMB_SetCC8Mode(n)            MODIFY_HSPWMB(PWMB_CCMR4,  PWMBCCMR4_CC8S_MSK, ((n) << 0))
#define HSPWMB_CC8Output()              HSPWMB_SetCC8Mode(0)
#define HSPWMB_CC8CaptureTI8FP8()       HSPWMB_SetCC8Mode(1)
#define HSPWMB_CC8CaptureTI7FP8()       HSPWMB_SetCC8Mode(2)
#define HSPWMB_CC8CaptureTRC()          HSPWMB_SetCC8Mode(3)

#define PWMBCCMR4_IC8F_MSK              (BIT_HN)
#define PWMB_SetIC8Filter(n)            MODIFY_REG(PWMB_CCMR4,  PWMBCCMR4_IC8F_MSK, ((n) << 4))
#define PWMB_IC8Filter1()               PWMB_SetIC8Filter(0)
#define PWMB_IC8Filter2()               PWMB_SetIC8Filter(1)
#define PWMB_IC8Filter4()               PWMB_SetIC8Filter(2)
#define PWMB_IC8Filter8()               PWMB_SetIC8Filter(3)
#define PWMB_IC8Filter12()              PWMB_SetIC8Filter(4)
#define PWMB_IC8Filter16()              PWMB_SetIC8Filter(5)
#define PWMB_IC8Filter24()              PWMB_SetIC8Filter(6)
#define PWMB_IC8Filter32()              PWMB_SetIC8Filter(7)
#define PWMB_IC8Filter48()              PWMB_SetIC8Filter(8)
#define PWMB_IC8Filter64()              PWMB_SetIC8Filter(9)
#define PWMB_IC8Filter80()              PWMB_SetIC8Filter(10)
#define PWMB_IC8Filter96()              PWMB_SetIC8Filter(11)
#define PWMB_IC8Filter128()             PWMB_SetIC8Filter(12)
#define PWMB_IC8Filter160()             PWMB_SetIC8Filter(13)
#define PWMB_IC8Filter192()             PWMB_SetIC8Filter(14)
#define PWMB_IC8Filter256()             PWMB_SetIC8Filter(15)

#define HSPWMB_SetIC8Filter(n)          MODIFY_HSPWMB(PWMB_CCMR4,  PWMBCCMR4_IC8F_MSK, ((n) << 4))
#define HSPWMB_IC8Filter1()             HSPWMB_SetIC8Filter(0)
#define HSPWMB_IC8Filter2()             HSPWMB_SetIC8Filter(1)
#define HSPWMB_IC8Filter4()             HSPWMB_SetIC8Filter(2)
#define HSPWMB_IC8Filter8()             HSPWMB_SetIC8Filter(3)
#define HSPWMB_IC8Filter12()            HSPWMB_SetIC8Filter(4)
#define HSPWMB_IC8Filter16()            HSPWMB_SetIC8Filter(5)
#define HSPWMB_IC8Filter24()            HSPWMB_SetIC8Filter(6)
#define HSPWMB_IC8Filter32()            HSPWMB_SetIC8Filter(7)
#define HSPWMB_IC8Filter48()            HSPWMB_SetIC8Filter(8)
#define HSPWMB_IC8Filter64()            HSPWMB_SetIC8Filter(9)
#define HSPWMB_IC8Filter80()            HSPWMB_SetIC8Filter(10)
#define HSPWMB_IC8Filter96()            HSPWMB_SetIC8Filter(11)
#define HSPWMB_IC8Filter128()           HSPWMB_SetIC8Filter(12)
#define HSPWMB_IC8Filter160()           HSPWMB_SetIC8Filter(13)
#define HSPWMB_IC8Filter192()           HSPWMB_SetIC8Filter(14)
#define HSPWMB_IC8Filter256()           HSPWMB_SetIC8Filter(15)

#define PWMBCCMR4_IC8PS_MSK             (BIT3 | BIT2)
#define PWMB_SetIC8Divider(n)           MODIFY_REG(PWMB_CCMR4,  PWMBCCMR4_IC8PS_MSK, ((n) << 2))
#define PWMB_IC8Divider1()              PWMB_SetIC8Divider(0)
#define PWMB_IC8Divider2()              PWMB_SetIC8Divider(1)
#define PWMB_IC8Divider4()              PWMB_SetIC8Divider(2)
#define PWMB_IC8Divider8()              PWMB_SetIC8Divider(3)

#define HSPWMB_SetIC8Divider(n)         MODIFY_HSPWMB(PWMB_CCMR4,  PWMBCCMR4_IC8PS_MSK, ((n) << 2))
#define HSPWMB_IC8Divider1()            HSPWMB_SetIC8Divider(0)
#define HSPWMB_IC8Divider2()            HSPWMB_SetIC8Divider(1)
#define HSPWMB_IC8Divider4()            HSPWMB_SetIC8Divider(2)
#define HSPWMB_IC8Divider8()            HSPWMB_SetIC8Divider(3)

#define PWMBCCER1_CC5E_MSK              BIT0
#define PWMB_CC5PEnable()               SET_REG_BIT(PWMB_CCER1, PWMBCCER1_CC5E_MSK)
#define PWMB_CC5PDisable()              CLR_REG_BIT(PWMB_CCER1, PWMBCCER1_CC5E_MSK)

