fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMB_CC5PEnable()             SET_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC5E_MSK)
#define HSPWMB_CC5PDisable()            CLR_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC5E_MSK)

#define PWMBCCER1_CC5P_MSK              BIT1
#define PWMB_CC5PNonInverted()          CLR_REG_BIT(PWMB_CCER1, PWMBCCER1_CC5P_MSK)
#define PWMB_CC5PInverted()             SET_REG_BIT(PWMB_CCER1, PWMBCCER1_CC5P_MSK)

#define HSPWMB_CC5PNonInverted()        CLR_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC5P_MSK)
#define HSPWMB_CC5PInverted()           SET_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC5P_MSK)

#define PWMBCCER1_CC6E_MSK              BIT4
#define PWMB_CC6PEnable()               SET_REG_BIT(PWMB_CCER1, PWMBCCER1_CC6E_MSK)
#define PWMB_CC6PDisable()              CLR_REG_BIT(PWMB_CCER1, PWMBCCER1_CC6E_MSK)

#define HSPWMB_CC6PEnable()             SET_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC6E_MSK)
#define HSPWMB_CC6PDisable()            CLR_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC6E_MSK)

#define PWMBCCER1_CC6P_MSK              BIT5
#define PWMB_CC6PNonInverted()          CLR_REG_BIT(PWMB_CCER1, PWMBCCER1_CC6P_MSK)
#define PWMB_CC6PInverted()             SET_REG_BIT(PWMB_CCER1, PWMBCCER1_CC6P_MSK)

#define HSPWMB_CC6PNonInverted()        CLR_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC6P_MSK)
#define HSPWMB_CC6PInverted()           SET_HSPWMB_BIT(PWMB_CCER1, PWMBCCER1_CC6P_MSK)

#define PWMBCCER2_CC7E_MSK              BIT0
#define PWMB_CC7PEnable()               SET_REG_BIT(PWMB_CCER2, PWMBCCER2_CC7E_MSK)
#define PWMB_CC7PDisable()              CLR_REG_BIT(PWMB_CCER2, PWMBCCER2_CC7E_MSK)

#define HSPWMB_CC7PEnable()             SET_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC7E_MSK)
#define HSPWMB_CC7PDisable()            CLR_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC7E_MSK)

#define PWMBCCER2_CC7P_MSK              BIT1
#define PWMB_CC7PNonInverted()          CLR_REG_BIT(PWMB_CCER2, PWMBCCER2_CC7P_MSK)
#define PWMB_CC7PInverted()             SET_REG_BIT(PWMB_CCER2, PWMBCCER2_CC7P_MSK)

#define HSPWMB_CC7PNonInverted()        CLR_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC7P_MSK)
#define HSPWMB_CC7PInverted()           SET_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC7P_MSK)

#define PWMBCCER2_CC8E_MSK              BIT4
#define PWMB_CC8PEnable()               SET_REG_BIT(PWMB_CCER2, PWMBCCER2_CC8E_MSK)
#define PWMB_CC8PDisable()              CLR_REG_BIT(PWMB_CCER2, PWMBCCER2_CC8E_MSK)

#define HSPWMB_CC8PEnable()             SET_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC8E_MSK)
#define HSPWMB_CC8PDisable()            CLR_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC8E_MSK)

#define PWMBCCER2_CC8P_MSK              BIT5
#define PWMB_CC8PNonInverted()          CLR_REG_BIT(PWMB_CCER2, PWMBCCER2_CC8P_MSK)
#define PWMB_CC8PInverted()             SET_REG_BIT(PWMB_CCER2, PWMBCCER2_CC8P_MSK)

#define HSPWMB_CC8PNonInverted()        CLR_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC8P_MSK)
#define HSPWMB_CC8PInverted()           SET_HSPWMB_BIT(PWMB_CCER2, PWMBCCER2_CC8P_MSK)

#define PWMBBRK_MOE_MSK                 BIT7
#define PWMB_EnableMainOutput()         SET_REG_BIT(PWMB_BKR, PWMBBRK_MOE_MSK)
#define PWMB_DisableMainOutput()        CLR_REG_BIT(PWMB_BKR, PWMBBRK_MOE_MSK)

#define HSPWMB_EnableMainOutput()       SET_HSPWMB_BIT(PWMB_BKR, PWMBBRK_MOE_MSK)
#define HSPWMB_DisableMainOutput()      CLR_HSPWMB_BIT(PWMB_BKR, PWMBBRK_MOE_MSK)

#define PWMBBRK_AOE_MSK                 BIT6
#define PWMB_EnableAutoOutput()         SET_REG_BIT(PWMB_BKR, PWMBBRK_AOE_MSK)
#define PWMB_DisableAutoOutput()        CLR_REG_BIT(PWMB_BKR, PWMBBRK_AOE_MSK)

#define HSPWMB_EnableAutoOutput()       SET_HSPWMB_BIT(PWMB_BKR, PWMBBRK_AOE_MSK)
#define HSPWMB_DisableAutoOutput()      CLR_HSPWMB_BIT(PWMB_BKR, PWMBBRK_AOE_MSK)

#define PWMBBRK_BKP_MSK                 BIT5
#define PWMB_BRKNonInverted()           SET_REG_BIT(PWMB_BKR, PWMBBRK_BKP_MSK)
#define PWMB_BRKInverted()              CLR_REG_BIT(PWMB_BKR, PWMBBRK_BKP_MSK)

#define HSPWMB_BRKNonInverted()         SET_HSPWMB_BIT(PWMB_BKR, PWMBBRK_BKP_MSK)
#define HSPWMB_BRKInverted()            CLR_HSPWMB_BIT(PWMB_BKR, PWMBBRK_BKP_MSK)

#define PWMBBRK_BKE_MSK                 BIT4
#define PWMB_BRKEnable()                SET_REG_BIT(PWMB_BKR, PWMBBRK_BKE_MSK)
#define PWMB_BRKDisable()               CLR_REG_BIT(PWMB_BKR, PWMBBRK_BKE_MSK)

#define HSPWMB_BRKEnable()              SET_HSPWMB_BIT(PWMB_BKR, PWMBBRK_BKE_MSK)
#define HSPWMB_BRKDisable()             CLR_HSPWMB_BIT(PWMB_BKR, PWMBBRK_BKE_MSK)

#define PWMBBRK_OSSR_MSK                BIT3
#define PWMBBRK_OSSI_MSK                BIT2
#define PWMB_RunInactiveNoOutput()      CLR_REG_BIT(PWMB_BKR, PWMBBRK_OSSR_MSK)
#define PWMB_RunInactiveOutput()        SET_REG_BIT(PWMB_BKR, PWMBBRK_OSSR_MSK)
#define PWMB_IdleInactiveNoOutput()     CLR_REG_BIT(PWMB_BKR, PWMBBRK_OSSI_MSK)
#define PWMB_IdleInactiveOutput()       SET_REG_BIT(PWMB_BKR, PWMBBRK_OSSI_MSK)

#define HSPWMB_RunInactiveNoOutput()    CLR_HSPWMB_BIT(PWMB_BKR, PWMBBRK_OSSR_MSK)
#define HSPWMB_RunInactiveOutput()      SET_HSPWMB_BIT(PWMB_BKR, PWMBBRK_OSSR_MSK)
#define HSPWMB_IdleInactiveNoOutput()   CLR_HSPWMB_BIT(PWMB_BKR, PWMBBRK_OSSI_MSK)
#define HSPWMB_IdleInactiveOutput()     SET_HSPWMB_BIT(PWMB_BKR, PWMBBRK_OSSI_MSK)

#define PWMBBRK_LOCK_MSK                (BIT1 | BIT0)
#define PWMB_SetLockLevel(n)            MODIFY_REG(PWMB_BKR,  PWMBBRK_LOCK_MSK, ((n) << 0))
#define PWMB_SetUnLock()                PWMB_SetLockLevel(0)

#define HSPWMB_SetLockLevel(n)          MODIFY_HSPWMB(PWMB_BKR,  PWMBBRK_LOCK_MSK, ((n) << 0))
#define HSPWMB_SetUnLock()              HSPWMB_SetLockLevel(0)

#define PWMBOISR_OIS5_MSK               BIT0
#define PWMBOISR_OIS6_MSK               BIT2
#define PWMBOISR_OIS7_MSK               BIT4
#define PWMBOISR_OIS8_MSK               BIT6
#define PWMB_OC5PIdleLevelLow()         CLR_REG_BIT(PWMB_OISR, PWMBOISR_OIS5_MSK)
#define PWMB_OC5PIdleLevelHigh()        SET_REG_BIT(PWMB_OISR, PWMBOISR_OIS5_MSK)
#define PWMB_OC6PIdleLevelLow()         CLR_REG_BIT(PWMB_OISR, PWMBOISR_OIS6_MSK)
#define PWMB_OC6PIdleLevelHigh()        SET_REG_BIT(PWMB_OISR, PWMBOISR_OIS6_MSK)
#define PWMB_OC7PIdleLevelLow()         CLR_REG_BIT(PWMB_OISR, PWMBOISR_OIS7_MSK)
#define PWMB_OC7PIdleLevelHigh()        SET_REG_BIT(PWMB_OISR, PWMBOISR_OIS7_MSK)
#define PWMB_OC8PIdleLevelLow()         CLR_REG_BIT(PWMB_OISR, PWMBOISR_OIS8_MSK)
#define PWMB_OC8PIdleLevelHigh()        SET_REG_BIT(PWMB_OISR, PWMBOISR_OIS8_MSK)

