fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMB_OC5PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS5_MSK)
#define HSPWMB_OC5PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS5_MSK)
#define HSPWMB_OC6PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS6_MSK)
#define HSPWMB_OC6PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS6_MSK)
#define HSPWMB_OC7PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS7_MSK)
#define HSPWMB_OC7PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS7_MSK)
#define HSPWMB_OC8PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS8_MSK)
#define HSPWMB_OC8PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS8_MSK)

#define PWMB_SetCounter(n)              (PWMB_CNTRH = HIBYTE(n), PWMB_CNTRL = LOBYTE(n))
#define PWMB_SetClockDivider(n)         (PWMB_PSCRH = HIBYTE(n), PWMB_PSCRL = LOBYTE(n))
#define PWMB_SetReload16(n)             (PWMB_ARRH = HIBYTE(n), PWMB_ARRL = LOBYTE(n))
#define PWMB_SetRepeatCounter(n)        (PWMB_RCRH = HIBYTE(n), PWMB_RCR = LOBYTE(n))

#define HSPWMB_SetCounter(n)            (WRITE_HSPWMB(PWMB_CNTRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_CNTRL, LOBYTE(n)))
#define HSPWMB_SetClockDivider(n)       (WRITE_HSPWMB(PWMB_PSCRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_PSCRL, LOBYTE(n)))
#define HSPWMB_SetReload16(n)           (WRITE_HSPWMB(PWMB_ARRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_ARRL, LOBYTE(n)))
#define HSPWMB_SetRepeatCounter(n)      (WRITE_HSPWMB(PWMB_RCRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_RCR, LOBYTE(n)))

#define PWMB_SetCCR5Value(n)            (PWMB_CCR5H = HIBYTE(n), PWMB_CCR5L = LOBYTE(n))
#define PWMB_SetCCR6Value(n)            (PWMB_CCR6H = HIBYTE(n), PWMB_CCR6L = LOBYTE(n))
#define PWMB_SetCCR7Value(n)            (PWMB_CCR7H = HIBYTE(n), PWMB_CCR7L = LOBYTE(n))
#define PWMB_SetCCR8Value(n)            (PWMB_CCR8H = HIBYTE(n), PWMB_CCR8L = LOBYTE(n))

#define HSPWMB_SetCCR5Value(n)          (WRITE_HSPWMB(PWMB_CCR5H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR5L, LOBYTE(n)))
#define HSPWMB_SetCCR6Value(n)          (WRITE_HSPWMB(PWMB_CCR6H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR6L, LOBYTE(n)))
#define HSPWMB_SetCCR7Value(n)          (WRITE_HSPWMB(PWMB_CCR7H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR7L, LOBYTE(n)))
#define HSPWMB_SetCCR8Value(n)          (WRITE_HSPWMB(PWMB_CCR8H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR8L, LOBYTE(n)))

#define PWMB_ReadReload16()             MAKEWORD(PWMB_ARRL, PWMB_ARRH)

#define HSPWMB_ReadReload16()           MAKEWORD(READ_HSPWMB(PWMB_ARRL), READ_HSPWMB(PWMB_ARRH))

#define PWMB_ReadCCR5Value()            MAKEWORD(PWMB_CCR5L, PWMB_CCR5H)
#define PWMB_ReadCCR6Value()            MAKEWORD(PWMB_CCR6L, PWMB_CCR6H)
#define PWMB_ReadCCR7Value()            MAKEWORD(PWMB_CCR7L, PWMB_CCR7H)
#define PWMB_ReadCCR8Value()            MAKEWORD(PWMB_CCR8L, PWMB_CCR8H)

#define HSPWMB_ReadCCR5Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR5L), READ_HSPWMB(PWMB_CCR5H))
#define HSPWMB_ReadCCR6Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR6L), READ_HSPWMB(PWMB_CCR6H))
#define HSPWMB_ReadCCR7Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR7L), READ_HSPWMB(PWMB_CCR7H))
#define HSPWMB_ReadCCR8Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR8L), READ_HSPWMB(PWMB_CCR8H))

#define PWMB_SetDeadTime(n)             PWMB_DTR = LOBYTE(n)

#define HSPWMB_SetDeadTime(n)           WRITE_HSPWMB(PWMB_DTR, LOBYTE(n))

////////////////////////

#define PWMCENO_ENO1P_MSK               BIT0
#define PWMCENO_ENO1N_MSK               BIT1
#define PWMCENO_ENO2P_MSK               BIT2
#define PWMCENO_ENO2N_MSK               BIT3
#define PWMCENO_ENO3P_MSK               BIT4
#define PWMCENO_ENO3N_MSK               BIT5
#define PWMCENO_ENO4P_MSK               BIT6
#define PWMCENO_ENO4N_MSK               BIT7
#define PWMCENO2_ENO5P_MSK              BIT0
#define PWMCENO2_ENO6P_MSK              BIT2
#define PWMC_EnablePWM1POutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO1P_MSK)
#define PWMC_DisablePWM1POutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO1P_MSK)
#define PWMC_EnablePWM1NOutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO1N_MSK)
#define PWMC_DisablePWM1NOutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO1N_MSK)
#define PWMC_EnablePWM2POutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO2P_MSK)
#define PWMC_DisablePWM2POutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO2P_MSK)
#define PWMC_EnablePWM2NOutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO2N_MSK)
#define PWMC_DisablePWM2NOutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO2N_MSK)
#define PWMC_EnablePWM3POutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO3P_MSK)
#define PWMC_DisablePWM3POutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO3P_MSK)
#define PWMC_EnablePWM3NOutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO3N_MSK)
#define PWMC_DisablePWM3NOutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO3N_MSK)
#define PWMC_EnablePWM4POutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO4P_MSK)
#define PWMC_DisablePWM4POutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO4P_MSK)
#define PWMC_EnablePWM4NOutput()        SET_REG_BIT(PWMC_ENO, PWMCENO_ENO4N_MSK)
#define PWMC_DisablePWM4NOutput()       CLR_REG_BIT(PWMC_ENO, PWMCENO_ENO4N_MSK)
#define PWMC_EnablePWM5POutput()        SET_REG_BIT(PWMC_ENO2, PWMCENO2_ENO5P_MSK)
#define PWMC_DisablePWM5POutput()       CLR_REG_BIT(PWMC_ENO2, PWMCENO2_ENO5P_MSK)
#define PWMC_EnablePWM6POutput()        SET_REG_BIT(PWMC_ENO2, PWMCENO2_ENO6P_MSK)
#define PWMC_DisablePWM6POutput()       CLR_REG_BIT(PWMC_ENO2, PWMCENO2_ENO6P_MSK)

#define HSPWMC_EnablePWM1POutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO1P_MSK)
#define HSPWMC_DisablePWM1POutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO1P_MSK)
#define HSPWMC_EnablePWM1NOutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO1N_MSK)
#define HSPWMC_DisablePWM1NOutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO1N_MSK)
#define HSPWMC_EnablePWM2POutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO2P_MSK)
#define HSPWMC_DisablePWM2POutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO2P_MSK)
#define HSPWMC_EnablePWM2NOutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO2N_MSK)
#define HSPWMC_DisablePWM2NOutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO2N_MSK)
#define HSPWMC_EnablePWM3POutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO3P_MSK)
#define HSPWMC_DisablePWM3POutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO3P_MSK)
#define HSPWMC_EnablePWM3NOutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO3N_MSK)
#define HSPWMC_DisablePWM3NOutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO3N_MSK)
#define HSPWMC_EnablePWM4POutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO4P_MSK)
#define HSPWMC_DisablePWM4POutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO4P_MSK)
#define HSPWMC_EnablePWM4NOutput()      SET_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO4N_MSK)
#define HSPWMC_DisablePWM4NOutput()     CLR_HSPWMC_BIT(PWMC_ENO, PWMCENO_ENO4N_MSK)
#define HSPWMC_EnablePWM5POutput()      SET_HSPWMC_BIT(PWMC_ENO2, PWMCENO2_ENO5P_MSK)
#define HSPWMC_DisablePWM5POutput()     CLR_HSPWMC_BIT(PWMC_ENO2, PWMCENO2_ENO5P_MSK)
#define HSPWMC_EnablePWM6POutput()      SET_HSPWMC_BIT(PWMC_ENO2, PWMCENO2_ENO6P_MSK)
#define HSPWMC_DisablePWM6POutput()     CLR_HSPWMC_BIT(PWMC_ENO2, PWMCENO2_ENO6P_MSK)

#define PWMCIOAUX_AUX1P_MSK             BIT0
#define PWMCIOAUX_AUX1N_MSK             BIT1
#define PWMCIOAUX_AUX2P_MSK             BIT2
#define PWMCIOAUX_AUX2N_MSK             BIT3
#define PWMCIOAUX_AUX3P_MSK             BIT4
#define PWMCIOAUX_AUX3N_MSK             BIT5
#define PWMCIOAUX_AUX4P_MSK             BIT6
#define PWMCIOAUX_AUX4N_MSK             BIT7
#define PWMCIOAUX2_AUX5P_MSK            BIT0
#define PWMCIOAUX2_AUX6P_MSK            BIT2
#define PWMC_EnoCtrlPWM1P()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1P_MSK)
#define PWMC_EnoBrkCtrlPWM1P()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1P_MSK)
#define PWMC_EnoCtrlPWM1N()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1N_MSK)
#define PWMC_EnoBrkCtrlPWM1N()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1N_MSK)
#define PWMC_EnoCtrlPWM2P()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2P_MSK)
#define PWMC_EnoBrkCtrlPWM2P()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2P_MSK)
#define PWMC_EnoCtrlPWM2N()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2N_MSK)
#define PWMC_EnoBrkCtrlPWM2N()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2N_MSK)
#define PWMC_EnoCtrlPWM3P()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3P_MSK)
#define PWMC_EnoBrkCtrlPWM3P()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3P_MSK)
#define PWMC_EnoCtrlPWM3N()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3N_MSK)
#define PWMC_EnoBrkCtrlPWM3N()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3N_MSK)
#define PWMC_EnoCtrlPWM4P()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4P_MSK)
#define PWMC_EnoBrkCtrlPWM4P()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4P_MSK)
#define PWMC_EnoCtrlPWM4N()             CLR_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4N_MSK)
#define PWMC_EnoBrkCtrlPWM4N()          SET_REG_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4N_MSK)
#define PWMC_EnoCtrlPWM5P()             CLR_REG_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX5P_MSK)
#define PWMC_EnoBrkCtrlPWM5P()          SET_REG_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX5P_MSK)
#define PWMC_EnoCtrlPWM6P()             CLR_REG_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX6P_MSK)
#define PWMC_EnoBrkCtrlPWM6P()          SET_REG_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX6P_MSK)

