fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMC_EnoCtrlPWM1P()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1P_MSK)
#define HSPWMC_EnoBrkCtrlPWM1P()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1P_MSK)
#define HSPWMC_EnoCtrlPWM1N()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1N_MSK)
#define HSPWMC_EnoBrkCtrlPWM1N()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX1N_MSK)
#define HSPWMC_EnoCtrlPWM2P()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2P_MSK)
#define HSPWMC_EnoBrkCtrlPWM2P()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2P_MSK)
#define HSPWMC_EnoCtrlPWM2N()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2N_MSK)
#define HSPWMC_EnoBrkCtrlPWM2N()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX2N_MSK)
#define HSPWMC_EnoCtrlPWM3P()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3P_MSK)
#define HSPWMC_EnoBrkCtrlPWM3P()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3P_MSK)
#define HSPWMC_EnoCtrlPWM3N()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3N_MSK)
#define HSPWMC_EnoBrkCtrlPWM3N()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX3N_MSK)
#define HSPWMC_EnoCtrlPWM4P()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4P_MSK)
#define HSPWMC_EnoBrkCtrlPWM4P()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4P_MSK)
#define HSPWMC_EnoCtrlPWM4N()           CLR_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4N_MSK)
#define HSPWMC_EnoBrkCtrlPWM4N()        SET_HSPWMC_BIT(PWMC_IOAUX, PWMCIOAUX_AUX4N_MSK)
#define HSPWMC_EnoCtrlPWM5P()           CLR_HSPWMC_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX5P_MSK)
#define HSPWMC_EnoBrkCtrlPWM5P()        SET_HSPWMC_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX5P_MSK)
#define HSPWMC_EnoCtrlPWM6P()           CLR_HSPWMC_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX6P_MSK)
#define HSPWMC_EnoBrkCtrlPWM6P()        SET_HSPWMC_BIT(PWMC_IOAUX2, PWMCIOAUX2_AUX6P_MSK)

#define PWMCCR1_ARPE_MSK                BIT7
#define PWMC_UnbufferARR()              CLR_REG_BIT(PWMC_CR1, PWMCCR1_ARPE_MSK)
#define PWMC_BufferARR()                SET_REG_BIT(PWMC_CR1, PWMCCR1_ARPE_MSK)

#define HSPWMC_UnbufferARR()            CLR_HSPWMC_BIT(PWMC_CR1, PWMCCR1_ARPE_MSK)
#define HSPWMC_BufferARR()              SET_HSPWMC_BIT(PWMC_CR1, PWMCCR1_ARPE_MSK)

#define PWMCCR1_CMS_MSK                 (BIT6 | BIT5)
#define PWMC_SetAlignMode(n)            MODIFY_REG(PWMC_CR1,  PWMCCR1_CMS_MSK, ((n) << 5))
#define PWMC_EdgeAlignMode()            PWMC_SetAlignMode(0)
#define PWMC_CenterAlignMode1()         PWMC_SetAlignMode(1)
#define PWMC_CenterAlignMode2()         PWMC_SetAlignMode(2)
#define PWMC_CenterAlignMode3()         PWMC_SetAlignMode(3)

#define HSPWMC_SetAlignMode(n)          MODIFY_HSPWMC(PWMC_CR1,  PWMCCR1_CMS_MSK, ((n) << 5))
#define HSPWMC_EdgeAlignMode()          HSPWMC_SetAlignMode(0)
#define HSPWMC_CenterAlignMode1()       HSPWMC_SetAlignMode(1)
#define HSPWMC_CenterAlignMode2()       HSPWMC_SetAlignMode(2)
#define HSPWMC_CenterAlignMode3()       HSPWMC_SetAlignMode(3)

#define PWMCCR1_DIR_MSK                 BIT4
#define PWMC_UpCounter()                CLR_REG_BIT(PWMC_CR1, PWMCCR1_DIR_MSK)
#define PWMC_DownCounter()              SET_REG_BIT(PWMC_CR1, PWMCCR1_DIR_MSK)

#define HSPWMC_UpCounter()              CLR_HSPWMC_BIT(PWMC_CR1, PWMCCR1_DIR_MSK)
#define HSPWMC_DownCounter()            SET_HSPWMC_BIT(PWMC_CR1, PWMCCR1_DIR_MSK)

#define PWMCCR1_OPM_MSK                 BIT3
#define PWMC_ContinueMode()             CLR_REG_BIT(PWMC_CR1, PWMCCR1_OPM_MSK)
#define PWMC_OnePulseMode()             SET_REG_BIT(PWMC_CR1, PWMCCR1_OPM_MSK)

#define HSPWMC_ContinueMode()           CLR_HSPWMC_BIT(PWMC_CR1, PWMCCR1_OPM_MSK)
#define HSPWMC_OnePulseMode()           SET_HSPWMC_BIT(PWMC_CR1, PWMCCR1_OPM_MSK)

#define PWMCCR1_URS_MSK                 BIT2
#define PWMC_UpdateRequestMode1()       SET_REG_BIT(PWMC_CR1, PWMCCR1_URS_MSK)
#define PWMC_UpdateRequestMode2()       CLR_REG_BIT(PWMC_CR1, PWMCCR1_URS_MSK)

#define HSPWMC_UpdateRequestMode1()     SET_HSPWMC_BIT(PWMC_CR1, PWMCCR1_URS_MSK)
#define HSPWMC_UpdateRequestMode2()     CLR_HSPWMC_BIT(PWMC_CR1, PWMCCR1_URS_MSK)

#define PWMCCR1_UDIS_MSK                BIT1
#define PWMC_EnableUpdate()             CLR_REG_BIT(PWMC_CR1, PWMCCR1_UDIS_MSK)
#define PWMC_DisableUpdate()            SET_REG_BIT(PWMC_CR1, PWMCCR1_UDIS_MSK)

#define HSPWMC_EnableUpdate()           CLR_HSPWMC_BIT(PWMC_CR1, PWMCCR1_UDIS_MSK)
#define HSPWMC_DisableUpdate()          SET_HSPWMC_BIT(PWMC_CR1, PWMCCR1_UDIS_MSK)

#define PWMCCR1_CEN_MSK                 BIT0
#define PWMC_Run()                      SET_REG_BIT(PWMC_CR1, PWMCCR1_CEN_MSK)
#define PWMC_Stop()                     CLR_REG_BIT(PWMC_CR1, PWMCCR1_CEN_MSK)

#define HSPWMC_Run()                    SET_HSPWMC_BIT(PWMC_CR1, PWMCCR1_CEN_MSK)
#define HSPWMC_Stop()                   CLR_HSPWMC_BIT(PWMC_CR1, PWMCCR1_CEN_MSK)

#define PWMCCR2_TIS_MSK                 BIT7
#define PWMC_PWM1PToTI()                CLR_REG_BIT(PWMC_CR2, PWMCCR2_TIS_MSK)
#define PWMC_Xor1P2P3PToTI()            SET_REG_BIT(PWMC_CR2, PWMCCR2_TIS_MSK)

#define HSPWMC_PWM1PToTI()              CLR_HSPWMC_BIT(PWMC_CR2, PWMCCR2_TIS_MSK)
#define HSPWMC_Xor1P2P3PToTI()          SET_HSPWMC_BIT(PWMC_CR2, PWMCCR2_TIS_MSK)

#define PWMCCR2_MMS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMC_SelectTRGO(n)              MODIFY_REG(PWMC_CR2,  PWMCCR2_MMS_MSK, ((n) << 4))
#define PWMC_ResetAsTRGO()              PWMC_SelectTRGO(0)
#define PWMC_EnableAsTRGO()             PWMC_SelectTRGO(1)
#define PWMC_UpdateAsTRGO()             PWMC_SelectTRGO(2)
#define PWMC_MatchAsTRGO()              PWMC_SelectTRGO(3)
#define PWMC_OC1REFAsTRGO()             PWMC_SelectTRGO(4)
#define PWMC_OC2REFAsTRGO()             PWMC_SelectTRGO(5)
#define PWMC_OC3REFAsTRGO()             PWMC_SelectTRGO(6)
#define PWMC_OC4REFAsTRGO()             PWMC_SelectTRGO(7)

#define HSPWMC_SelectTRGO(n)            MODIFY_HSPWMC(PWMC_CR2,  PWMCCR2_MMS_MSK, ((n) << 4))
#define HSPWMC_ResetAsTRGO()            HSPWMC_SelectTRGO(0)
#define HSPWMC_EnableAsTRGO()           HSPWMC_SelectTRGO(1)
#define HSPWMC_UpdateAsTRGO()           HSPWMC_SelectTRGO(2)
#define HSPWMC_MatchAsTRGO()            HSPWMC_SelectTRGO(3)
#define HSPWMC_OC1REFAsTRGO()           HSPWMC_SelectTRGO(4)
#define HSPWMC_OC2REFAsTRGO()           HSPWMC_SelectTRGO(5)
#define HSPWMC_OC3REFAsTRGO()           HSPWMC_SelectTRGO(6)
#define HSPWMC_OC4REFAsTRGO()           HSPWMC_SelectTRGO(7)

