fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMCCR2_COMS_MSK                BIT2
#define PWMC_CCOCUpdateMode0()          CLR_REG_BIT(PWMC_CR2, PWMCCR2_COMS_MSK)
#define PWMC_CCOCUpdateMode1()          SET_REG_BIT(PWMC_CR2, PWMCCR2_COMS_MSK)

#define HSPWMC_CCOCUpdateMode0()        CLR_HSPWMC_BIT(PWMC_CR2, PWMCCR2_COMS_MSK)
#define HSPWMC_CCOCUpdateMode1()        SET_HSPWMC_BIT(PWMC_CR2, PWMCCR2_COMS_MSK)

#define PWMCCR2_CCPC_MSK                BIT0
#define PWMC_UnbufferCCOC()             CLR_REG_BIT(PWMC_CR2, PWMCCR2_CCPC_MSK)
#define PWMC_BufferCCOC()               SET_REG_BIT(PWMC_CR2, PWMCCR2_CCPC_MSK)

#define HSPWMC_UnbufferCCOC()           CLR_HSPWMC_BIT(PWMC_CR2, PWMCCR2_CCPC_MSK)
#define HSPWMC_BufferCCOC()             SET_HSPWMC_BIT(PWMC_CR2, PWMCCR2_CCPC_MSK)

#define PWMCSMCR_MSM_MSK                BIT7
#define PWMC_StandaloneMode()           CLR_REG_BIT(PWMC_SMCR, PWMCSMCR_MSM_MSK)
#define PWMC_MasterSlaveMode()          SET_REG_BIT(PWMC_SMCR, PWMCSMCR_MSM_MSK)

#define HSPWMC_StandaloneMode()         CLR_HSPWMC_BIT(PWMC_SMCR, PWMCSMCR_MSM_MSK)
#define HSPWMC_MasterSlaveMode()        SET_HSPWMC_BIT(PWMC_SMCR, PWMCSMCR_MSM_MSK)

#define PWMCSMCR_TS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMC_SelectTRGI(n)              MODIFY_REG(PWMC_SMCR,  PWMCSMCR_TS_MSK, ((n) << 4))
#define PWMC_DisableTRGI()              PWMC_SelectTRGI(0)
#define PWMC_ITR2AsTRGI()               PWMC_SelectTRGI(2)
#define PWMC_TI1FEDAsTRGI()             PWMC_SelectTRGI(4)
#define PWMC_TI1FP1AsTRGI()             PWMC_SelectTRGI(5)
#define PWMC_TI2FP2AsTRGI()             PWMC_SelectTRGI(6)
#define PWMC_ETRFAsTRGI()               PWMC_SelectTRGI(7)

#define HSPWMC_SelectTRGI(n)            MODIFY_HSPWMC(PWMC_SMCR,  PWMCSMCR_TS_MSK, ((n) << 4))
#define HSPWMC_DisableTRGI()            HSPWMC_SelectTRGI(0)
#define HSPWMC_ITR2AsTRGI()             HSPWMC_SelectTRGI(2)
#define HSPWMC_TI1FEDAsTRGI()           HSPWMC_SelectTRGI(4)
#define HSPWMC_TI1FP1AsTRGI()           HSPWMC_SelectTRGI(5)
#define HSPWMC_TI2FP2AsTRGI()           HSPWMC_SelectTRGI(6)
#define HSPWMC_ETRFAsTRGI()             HSPWMC_SelectTRGI(7)

#define PWMCSMCR_SMS_MSK                (BIT2 | BIT1 | BIT0)
#define PWMC_SetClockMode(n)            MODIFY_REG(PWMC_SMCR,  PWMCSMCR_SMS_MSK, ((n) << 0))
#define PWMC_InternalClockMode()        PWMC_SetClockMode(0)
#define PWMC_EncoderMode1()             PWMC_SetClockMode(1)
#define PWMC_EncoderMode2()             PWMC_SetClockMode(2)
#define PWMC_EncoderMode3()             PWMC_SetClockMode(3)
#define PWMC_TriggerResetMode()         PWMC_SetClockMode(4)
#define PWMC_TriggerGateMode()          PWMC_SetClockMode(5)
#define PWMC_TriggerStartMode()         PWMC_SetClockMode(6)
#define PWMC_ExternalClockMode()        PWMC_SetClockMode(7)

#define HSPWMC_SetClockMode(n)          MODIFY_HSPWMC(PWMC_SMCR,  PWMCSMCR_SMS_MSK, ((n) << 0))
#define HSPWMC_InternalClockMode()      HSPWMC_SetClockMode(0)
#define HSPWMC_EncoderMode1()           HSPWMC_SetClockMode(1)
#define HSPWMC_EncoderMode2()           HSPWMC_SetClockMode(2)
#define HSPWMC_EncoderMode3()           HSPWMC_SetClockMode(3)
#define HSPWMC_TriggerResetMode()       HSPWMC_SetClockMode(4)
#define HSPWMC_TriggerGateMode()        HSPWMC_SetClockMode(5)
#define HSPWMC_TriggerStartMode()       HSPWMC_SetClockMode(6)
#define HSPWMC_ExternalClockMode()      HSPWMC_SetClockMode(7)

#define PWMCETR_ETP_MSK                 BIT7
#define PWMC_ETRNonInverted()           CLR_REG_BIT(PWMC_ETR, PWMCETR_ETP_MSK)
#define PWMC_ETRInverted()              SET_REG_BIT(PWMC_ETR, PWMCETR_ETP_MSK)

#define HSPWMC_ETRNonInverted()         CLR_HSPWMC_BIT(PWMC_ETR, PWMCETR_ETP_MSK)
#define HSPWMC_ETRInverted()            SET_HSPWMC_BIT(PWMC_ETR, PWMCETR_ETP_MSK)

#define PWMCETR_ECE_MSK                 BIT6
#define PWMC_DisableExternalClock2()    CLR_REG_BIT(PWMC_ETR, PWMCETR_ECE_MSK)
#define PWMC_EnableExternalClock2()     SET_REG_BIT(PWMC_ETR, PWMCETR_ECE_MSK)

#define HSPWMC_DisableExternalClock2()  CLR_HSPWMC_BIT(PWMC_ETR, PWMCETR_ECE_MSK)
#define HSPWMC_EnableExternalClock2()   SET_HSPWMC_BIT(PWMC_ETR, PWMCETR_ECE_MSK)

#define PWMCETR_ETPS_MSK                (BIT5 | BIT4)
#define PWMC_SetETRDivider(n)           MODIFY_REG(PWMC_ETR,  PWMCETR_ETPS_MSK, ((n) << 4))
#define PWMC_ETRDivider1()              PWMC_SetETRDivider(0)
#define PWMC_ETRDivider2()              PWMC_SetETRDivider(1)
#define PWMC_ETRDivider4()              PWMC_SetETRDivider(2)
#define PWMC_ETRDivider8()              PWMC_SetETRDivider(3)

#define HSPWMC_SetETRDivider(n)         MODIFY_HSPWMC(PWMC_ETR,  PWMCETR_ETPS_MSK, ((n) << 4))
#define HSPWMC_ETRDivider1()            HSPWMC_SetETRDivider(0)
#define HSPWMC_ETRDivider2()            HSPWMC_SetETRDivider(1)
#define HSPWMC_ETRDivider4()            HSPWMC_SetETRDivider(2)
#define HSPWMC_ETRDivider8()            HSPWMC_SetETRDivider(3)

#define PWMCETR_ETF_MSK                 (BIT_LN)
#define PWMC_SetETRFilter(n)            MODIFY_REG(PWMC_ETR,  PWMCETR_ETF_MSK, ((n) << 0))
#define PWMC_ETRFilter1()               PWMC_SetETRFilter(0)
#define PWMC_ETRFilter2()               PWMC_SetETRFilter(1)
#define PWMC_ETRFilter4()               PWMC_SetETRFilter(2)
#define PWMC_ETRFilter8()               PWMC_SetETRFilter(3)
#define PWMC_ETRFilter12()              PWMC_SetETRFilter(4)
#define PWMC_ETRFilter16()              PWMC_SetETRFilter(5)
#define PWMC_ETRFilter24()              PWMC_SetETRFilter(6)
#define PWMC_ETRFilter32()              PWMC_SetETRFilter(7)
#define PWMC_ETRFilter48()              PWMC_SetETRFilter(8)
#define PWMC_ETRFilter64()              PWMC_SetETRFilter(9)
#define PWMC_ETRFilter80()              PWMC_SetETRFilter(10)
#define PWMC_ETRFilter96()              PWMC_SetETRFilter(11)
#define PWMC_ETRFilter128()             PWMC_SetETRFilter(12)
#define PWMC_ETRFilter160()             PWMC_SetETRFilter(13)
#define PWMC_ETRFilter192()             PWMC_SetETRFilter(14)
#define PWMC_ETRFilter256()             PWMC_SetETRFilter(15)

#define HSPWMC_SetETRFilter(n)          MODIFY_HSPWMC(PWMC_ETR,  PWMCETR_ETF_MSK, ((n) << 0))
#define HSPWMC_ETRFilter1()             HSPWMC_SetETRFilter(0)
#define HSPWMC_ETRFilter2()             HSPWMC_SetETRFilter(1)
#define HSPWMC_ETRFilter4()             HSPWMC_SetETRFilter(2)
#define HSPWMC_ETRFilter8()             HSPWMC_SetETRFilter(3)
#define HSPWMC_ETRFilter12()            HSPWMC_SetETRFilter(4)
#define HSPWMC_ETRFilter16()            HSPWMC_SetETRFilter(5)
#define HSPWMC_ETRFilter24()            HSPWMC_SetETRFilter(6)
#define HSPWMC_ETRFilter32()            HSPWMC_SetETRFilter(7)
#define HSPWMC_ETRFilter48()            HSPWMC_SetETRFilter(8)
#define HSPWMC_ETRFilter64()            HSPWMC_SetETRFilter(9)
#define HSPWMC_ETRFilter80()            HSPWMC_SetETRFilter(10)
#define HSPWMC_ETRFilter96()            HSPWMC_SetETRFilter(11)
#define HSPWMC_ETRFilter128()           HSPWMC_SetETRFilter(12)
#define HSPWMC_ETRFilter160()           HSPWMC_SetETRFilter(13)
#define HSPWMC_ETRFilter192()           HSPWMC_SetETRFilter(14)
#define HSPWMC_ETRFilter256()           HSPWMC_SetETRFilter(15)

#define PWMCEGR_BG_MSK                  BIT7
#define PWMCEGR_TG_MSK                  BIT6
#define PWMCEGR_COMG_MSK                BIT5
#define PWMCEGR_CC4G_MSK                BIT4
#define PWMCEGR_CC3G_MSK                BIT3
#define PWMCEGR_CC2G_MSK                BIT2
#define PWMCEGR_CC1G_MSK                BIT1
#define PWMCEGR_UG_MSK                  BIT0
#define PWMC_GenerateBreakEvent()       SET_REG_BIT(PWMC_EGR, PWMCEGR_BG_MSK)
#define PWMC_GenerateTriggerEvent()     SET_REG_BIT(PWMC_EGR, PWMCEGR_TG_MSK)
#define PWMC_GenerateCOMEvent()         SET_REG_BIT(PWMC_EGR, PWMCEGR_COMG_MSK)
#define PWMC_GenerateCC4Event()         SET_REG_BIT(PWMC_EGR, PWMCEGR_CC4G_MSK)
#define PWMC_GenerateCC3Event()         SET_REG_BIT(PWMC_EGR, PWMCEGR_CC3G_MSK)
#define PWMC_GenerateCC2Event()         SET_REG_BIT(PWMC_EGR, PWMCEGR_CC2G_MSK)
#define PWMC_GenerateCC1Event()         SET_REG_BIT(PWMC_EGR, PWMCEGR_CC1G_MSK)
#define PWMC_GenerateUpdateEvent()      SET_REG_BIT(PWMC_EGR, PWMCEGR_UG_MSK)

#define HSPWMC_GenerateBreakEvent()     SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_BG_MSK)
#define HSPWMC_GenerateTriggerEvent()   SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_TG_MSK)
#define HSPWMC_GenerateCOMEvent()       SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_COMG_MSK)
#define HSPWMC_GenerateCC4Event()       SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_CC4G_MSK)
#define HSPWMC_GenerateCC3Event()       SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_CC3G_MSK)
#define HSPWMC_GenerateCC2Event()       SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_CC2G_MSK)
#define HSPWMC_GenerateCC1Event()       SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_CC1G_MSK)
#define HSPWMC_GenerateUpdateEvent()    SET_HSPWMC_BIT(PWMC_EGR, PWMCEGR_UG_MSK)

#define PWMCCCMR1_OC1CE_MSK             BIT7
#define PWMC_EnableETRFClearOC1REF()    SET_REG_BIT(PWMC_CCMR1, PWMCCCMR1_OC1CE_MSK)
#define PWMC_DisableETRFClearOC1REF()   CLR_REG_BIT(PWMC_CCMR1, PWMCCCMR1_OC1CE_MSK)

