fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMC_EnableETRFClearOC1REF()  SET_HSPWMC_BIT(PWMC_CCMR1, PWMCCCMR1_OC1CE_MSK)
#define HSPWMC_DisableETRFClearOC1REF() CLR_HSPWMC_BIT(PWMC_CCMR1, PWMCCCMR1_OC1CE_MSK)

#define PWMCCCMR1_OC1M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMCCCMR1X_OC1M3_MSK            BIT0
#define PWMC_SetOC1OutputMode(n)        MODIFY_REG(PWMC_CCMR1,  PWMCCCMR1_OC1M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMC_CCMR1X, PWMCCCMR1X_OC1M3_MSK, (((n) >> 3) << 0))
#define PWMC_OC1REFFrozen()             PWMC_SetOC1OutputMode(0)
#define PWMC_OC1REFHighIfMatch()        PWMC_SetOC1OutputMode(1)
#define PWMC_OC1REFLowIfMatch()         PWMC_SetOC1OutputMode(2)
#define PWMC_OC1REFToggleIfMatch()      PWMC_SetOC1OutputMode(3)
#define PWMC_OC1REFForceLow()           PWMC_SetOC1OutputMode(4)
#define PWMC_OC1REFForceHigh()          PWMC_SetOC1OutputMode(5)
#define PWMC_OC1REFPWMMode1()           PWMC_SetOC1OutputMode(6)
#define PWMC_OC1REFPWMMode2()           PWMC_SetOC1OutputMode(7)
#define PWMC_OC1REFReTrigOPMPWM1()      PWMC_SetOC1OutputMode(8)
#define PWMC_OC1REFReTrigOPMPWM2()      PWMC_SetOC1OutputMode(9)
#define PWMC_OC1REFCombinedPWM1()       PWMC_SetOC1OutputMode(12)
#define PWMC_OC1REFCombinedPWM2()       PWMC_SetOC1OutputMode(13)
#define PWMC_OC1REFAsymmetricPWM1()     PWMC_SetOC1OutputMode(14)
#define PWMC_OC1REFAsymmetricPWM2()     PWMC_SetOC1OutputMode(15)

#define HSPWMC_SetOC1OutputMode(n)      MODIFY_HSPWMC(PWMC_CCMR1,  PWMCCCMR1_OC1M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMC(PWMC_CCMR1X, PWMCCCMR1X_OC1M3_MSK, (((n) >> 3) << 0))
#define HSPWMC_OC1REFFrozen()           HSPWMC_SetOC1OutputMode(0)
#define HSPWMC_OC1REFHighIfMatch()      HSPWMC_SetOC1OutputMode(1)
#define HSPWMC_OC1REFLowIfMatch()       HSPWMC_SetOC1OutputMode(2)
#define HSPWMC_OC1REFToggleIfMatch()    HSPWMC_SetOC1OutputMode(3)
#define HSPWMC_OC1REFForceLow()         HSPWMC_SetOC1OutputMode(4)
#define HSPWMC_OC1REFForceHigh()        HSPWMC_SetOC1OutputMode(5)
#define HSPWMC_OC1REFPWMMode1()         HSPWMC_SetOC1OutputMode(6)
#define HSPWMC_OC1REFPWMMode2()         HSPWMC_SetOC1OutputMode(7)
#define HSPWMC_OC1REFReTrigOPMPWM1()    HSPWMC_SetOC1OutputMode(8)
#define HSPWMC_OC1REFReTrigOPMPWM2()    HSPWMC_SetOC1OutputMode(9)
#define HSPWMC_OC1REFCombinedPWM1()     HSPWMC_SetOC1OutputMode(12)
#define HSPWMC_OC1REFCombinedPWM2()     HSPWMC_SetOC1OutputMode(13)
#define HSPWMC_OC1REFAsymmetricPWM1()   HSPWMC_SetOC1OutputMode(14)
#define HSPWMC_OC1REFAsymmetricPWM2()   HSPWMC_SetOC1OutputMode(15)

#define PWMCCCMR1_OC1PE_MSK             BIT3
#define PWMC_UnbufferCCR1()             CLR_REG_BIT(PWMC_CCMR1, PWMCCCMR1_OC1PE_MSK)
#define PWMC_BufferCCR1()               SET_REG_BIT(PWMC_CCMR1, PWMCCCMR1_OC1PE_MSK)

#define HSPWMC_UnbufferCCR1()           CLR_HSPWMC_BIT(PWMC_CCMR1, PWMCCCMR1_OC1PE_MSK)
#define HSPWMC_BufferCCR1()             SET_HSPWMC_BIT(PWMC_CCMR1, PWMCCCMR1_OC1PE_MSK)

#define PWMCCCMR1_OC1FE_MSK             BIT2
#define PWMC_DisableOC1FastMode()       CLR_REG_BIT(PWMC_CCMR1, PWMCCCMR1_OC1FE_MSK)
#define PWMC_EnableOC1FastMode()        SET_REG_BIT(PWMC_CCMR1, PWMCCCMR1_OC1FE_MSK)

#define HSPWMC_DisableOC1FastMode()     CLR_HSPWMC_BIT(PWMC_CCMR1, PWMCCCMR1_OC1FE_MSK)
#define HSPWMC_EnableOC1FastMode()      SET_HSPWMC_BIT(PWMC_CCMR1, PWMCCCMR1_OC1FE_MSK)

#define PWMCCCMR1_CC1S_MSK              (BIT1 | BIT0)
#define PWMC_SetCC1Mode(n)              MODIFY_REG(PWMC_CCMR1,  PWMCCCMR1_CC1S_MSK, ((n) << 0))
#define PWMC_CC1Output()                PWMC_SetCC1Mode(0)
#define PWMC_CC1CaptureTI1FP1()         PWMC_SetCC1Mode(1)
#define PWMC_CC1CaptureTI2FP1()         PWMC_SetCC1Mode(2)
#define PWMC_CC1CaptureTRC()            PWMC_SetCC1Mode(3)

#define HSPWMC_SetCC1Mode(n)            MODIFY_HSPWMC(PWMC_CCMR1,  PWMCCCMR1_CC1S_MSK, ((n) << 0))
#define HSPWMC_CC1Output()              HSPWMC_SetCC1Mode(0)
#define HSPWMC_CC1CaptureTI1FP1()       HSPWMC_SetCC1Mode(1)
#define HSPWMC_CC1CaptureTI2FP1()       HSPWMC_SetCC1Mode(2)
#define HSPWMC_CC1CaptureTRC()          HSPWMC_SetCC1Mode(3)

#define PWMCCCMR1_IC1F_MSK              (BIT_HN)
#define PWMC_SetIC1Filter(n)            MODIFY_REG(PWMC_CCMR1,  PWMCCCMR1_IC1F_MSK, ((n) << 4))
#define PWMC_IC1Filter1()               PWMC_SetIC1Filter(0)
#define PWMC_IC1Filter2()               PWMC_SetIC1Filter(1)
#define PWMC_IC1Filter4()               PWMC_SetIC1Filter(2)
#define PWMC_IC1Filter8()               PWMC_SetIC1Filter(3)
#define PWMC_IC1Filter12()              PWMC_SetIC1Filter(4)
#define PWMC_IC1Filter16()              PWMC_SetIC1Filter(5)
#define PWMC_IC1Filter24()              PWMC_SetIC1Filter(6)
#define PWMC_IC1Filter32()              PWMC_SetIC1Filter(7)
#define PWMC_IC1Filter48()              PWMC_SetIC1Filter(8)
#define PWMC_IC1Filter64()              PWMC_SetIC1Filter(9)
#define PWMC_IC1Filter80()              PWMC_SetIC1Filter(10)
#define PWMC_IC1Filter96()              PWMC_SetIC1Filter(11)
#define PWMC_IC1Filter128()             PWMC_SetIC1Filter(12)
#define PWMC_IC1Filter160()             PWMC_SetIC1Filter(13)
#define PWMC_IC1Filter192()             PWMC_SetIC1Filter(14)
#define PWMC_IC1Filter256()             PWMC_SetIC1Filter(15)

#define HSPWMC_SetIC1Filter(n)          MODIFY_HSPWMC(PWMC_CCMR1,  PWMCCCMR1_IC1F_MSK, ((n) << 4))
#define HSPWMC_IC1Filter1()             HSPWMC_SetIC1Filter(0)
#define HSPWMC_IC1Filter2()             HSPWMC_SetIC1Filter(1)
#define HSPWMC_IC1Filter4()             HSPWMC_SetIC1Filter(2)
#define HSPWMC_IC1Filter8()             HSPWMC_SetIC1Filter(3)
#define HSPWMC_IC1Filter12()            HSPWMC_SetIC1Filter(4)
#define HSPWMC_IC1Filter16()            HSPWMC_SetIC1Filter(5)
#define HSPWMC_IC1Filter24()            HSPWMC_SetIC1Filter(6)
#define HSPWMC_IC1Filter32()            HSPWMC_SetIC1Filter(7)
#define HSPWMC_IC1Filter48()            HSPWMC_SetIC1Filter(8)
#define HSPWMC_IC1Filter64()            HSPWMC_SetIC1Filter(9)
#define HSPWMC_IC1Filter80()            HSPWMC_SetIC1Filter(10)
#define HSPWMC_IC1Filter96()            HSPWMC_SetIC1Filter(11)
#define HSPWMC_IC1Filter128()           HSPWMC_SetIC1Filter(12)
#define HSPWMC_IC1Filter160()           HSPWMC_SetIC1Filter(13)
#define HSPWMC_IC1Filter192()           HSPWMC_SetIC1Filter(14)
#define HSPWMC_IC1Filter256()           HSPWMC_SetIC1Filter(15)

#define PWMCCCMR1_IC1PS_MSK             (BIT3 | BIT2)
#define PWMC_SetIC1Divider(n)           MODIFY_REG(PWMC_CCMR1,  PWMCCCMR1_IC1PS_MSK, ((n) << 2))
#define PWMC_IC1Divider1()              PWMC_SetIC1Divider(0)
#define PWMC_IC1Divider2()              PWMC_SetIC1Divider(1)
#define PWMC_IC1Divider4()              PWMC_SetIC1Divider(2)
#define PWMC_IC1Divider8()              PWMC_SetIC1Divider(3)

