fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMC_SetIC1Divider(n)         MODIFY_HSPWMC(PWMC_CCMR1,  PWMCCCMR1_IC1PS_MSK, ((n) << 2))
#define HSPWMC_IC1Divider1()            HSPWMC_SetIC1Divider(0)
#define HSPWMC_IC1Divider2()            HSPWMC_SetIC1Divider(1)
#define HSPWMC_IC1Divider4()            HSPWMC_SetIC1Divider(2)
#define HSPWMC_IC1Divider8()            HSPWMC_SetIC1Divider(3)

#define PWMCCCMR2_OC2CE_MSK             BIT7
#define PWMC_EnableETRFClearOC2REF()    SET_REG_BIT(PWMC_CCMR2, PWMCCCMR2_OC2CE_MSK)
#define PWMC_DisableETRFClearOC2REF()   CLR_REG_BIT(PWMC_CCMR2, PWMCCCMR2_OC2CE_MSK)

#define HSPWMC_EnableETRFClearOC2REF()  SET_HSPWMC_BIT(PWMC_CCMR2, PWMCCCMR2_OC2CE_MSK)
#define HSPWMC_DisableETRFClearOC2REF() CLR_HSPWMC_BIT(PWMC_CCMR2, PWMCCCMR2_OC2CE_MSK)

#define PWMCCCMR2_OC2M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMCCCMR2X_OC2M3_MSK            BIT0
#define PWMC_SetOC2OutputMode(n)        MODIFY_REG(PWMC_CCMR2,  PWMCCCMR2_OC2M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMC_CCMR2X, PWMCCCMR2X_OC2M3_MSK, (((n) >> 3) << 0))
#define PWMC_OC2REFFrozen()             PWMC_SetOC2OutputMode(0)
#define PWMC_OC2REFHighIfMatch()        PWMC_SetOC2OutputMode(1)
#define PWMC_OC2REFLowIfMatch()         PWMC_SetOC2OutputMode(2)
#define PWMC_OC2REFToggleIfMatch()      PWMC_SetOC2OutputMode(3)
#define PWMC_OC2REFForceLow()           PWMC_SetOC2OutputMode(4)
#define PWMC_OC2REFForceHigh()          PWMC_SetOC2OutputMode(5)
#define PWMC_OC2REFPWMMode1()           PWMC_SetOC2OutputMode(6)
#define PWMC_OC2REFPWMMode2()           PWMC_SetOC2OutputMode(7)
#define PWMC_OC2REFReTrigOPMPWM1()      PWMC_SetOC2OutputMode(8)
#define PWMC_OC2REFReTrigOPMPWM2()      PWMC_SetOC2OutputMode(9)
#define PWMC_OC2REFCombinedPWM1()       PWMC_SetOC2OutputMode(12)
#define PWMC_OC2REFCombinedPWM2()       PWMC_SetOC2OutputMode(13)
#define PWMC_OC2REFAsymmetricPWM1()     PWMC_SetOC2OutputMode(14)
#define PWMC_OC2REFAsymmetricPWM2()     PWMC_SetOC2OutputMode(15)

#define HSPWMC_SetOC2OutputMode(n)      MODIFY_HSPWMC(PWMC_CCMR2,  PWMCCCMR2_OC2M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMC(PWMC_CCMR2X, PWMCCCMR2X_OC2M3_MSK, (((n) >> 3) << 0))
#define HSPWMC_OC2REFFrozen()           HSPWMC_SetOC2OutputMode(0)
#define HSPWMC_OC2REFHighIfMatch()      HSPWMC_SetOC2OutputMode(1)
#define HSPWMC_OC2REFLowIfMatch()       HSPWMC_SetOC2OutputMode(2)
#define HSPWMC_OC2REFToggleIfMatch()    HSPWMC_SetOC2OutputMode(3)
#define HSPWMC_OC2REFForceLow()         HSPWMC_SetOC2OutputMode(4)
#define HSPWMC_OC2REFForceHigh()        HSPWMC_SetOC2OutputMode(5)
#define HSPWMC_OC2REFPWMMode1()         HSPWMC_SetOC2OutputMode(6)
#define HSPWMC_OC2REFPWMMode2()         HSPWMC_SetOC2OutputMode(7)
#define HSPWMC_OC2REFReTrigOPMPWM1()    HSPWMC_SetOC2OutputMode(8)
#define HSPWMC_OC2REFReTrigOPMPWM2()    HSPWMC_SetOC2OutputMode(9)
#define HSPWMC_OC2REFCombinedPWM1()     HSPWMC_SetOC2OutputMode(12)
#define HSPWMC_OC2REFCombinedPWM2()     HSPWMC_SetOC2OutputMode(13)
#define HSPWMC_OC2REFAsymmetricPWM1()   HSPWMC_SetOC2OutputMode(14)
#define HSPWMC_OC2REFAsymmetricPWM2()   HSPWMC_SetOC2OutputMode(15)

#define PWMCCCMR2_OC2PE_MSK             BIT3
#define PWMC_UnbufferCCR2()             CLR_REG_BIT(PWMC_CCMR2, PWMCCCMR2_OC2PE_MSK)
#define PWMC_BufferCCR2()               SET_REG_BIT(PWMC_CCMR2, PWMCCCMR2_OC2PE_MSK)

#define HSPWMC_UnbufferCCR2()           CLR_HSPWMC_BIT(PWMC_CCMR2, PWMCCCMR2_OC2PE_MSK)
#define HSPWMC_BufferCCR2()             SET_HSPWMC_BIT(PWMC_CCMR2, PWMCCCMR2_OC2PE_MSK)

#define PWMCCCMR2_OC2FE_MSK             BIT2
#define PWMC_DisableOC2FastMode()       CLR_REG_BIT(PWMC_CCMR2, PWMCCCMR2_OC2FE_MSK)
#define PWMC_EnableOC2FastMode()        SET_REG_BIT(PWMC_CCMR2, PWMCCCMR2_OC2FE_MSK)

#define HSPWMC_DisableOC2FastMode()     CLR_HSPWMC_BIT(PWMC_CCMR2, PWMCCCMR2_OC2FE_MSK)
#define HSPWMC_EnableOC2FastMode()      SET_HSPWMC_BIT(PWMC_CCMR2, PWMCCCMR2_OC2FE_MSK)

#define PWMCCCMR2_CC2S_MSK              (BIT1 | BIT0)
#define PWMC_SetCC2Mode(n)              MODIFY_REG(PWMC_CCMR2,  PWMCCCMR2_CC2S_MSK, ((n) << 0))
#define PWMC_CC2Output()                PWMC_SetCC2Mode(0)
#define PWMC_CC2CaptureTI2FP2()         PWMC_SetCC2Mode(1)
#define PWMC_CC2CaptureTI1FP2()         PWMC_SetCC2Mode(2)
#define PWMC_CC2CaptureTRC()            PWMC_SetCC2Mode(3)

#define HSPWMC_SetCC2Mode(n)            MODIFY_HSPWMC(PWMC_CCMR2,  PWMCCCMR2_CC2S_MSK, ((n) << 0))
#define HSPWMC_CC2Output()              HSPWMC_SetCC2Mode(0)
#define HSPWMC_CC2CaptureTI2FP2()       HSPWMC_SetCC2Mode(1)
#define HSPWMC_CC2CaptureTI1FP2()       HSPWMC_SetCC2Mode(2)
#define HSPWMC_CC2CaptureTRC()          HSPWMC_SetCC2Mode(3)

#define PWMCCCMR2_IC2F_MSK              (BIT_HN)
#define PWMC_SetIC2Filter(n)            MODIFY_REG(PWMC_CCMR2,  PWMCCCMR2_IC2F_MSK, ((n) << 4))
#define PWMC_IC2Filter1()               PWMC_SetIC2Filter(0)
#define PWMC_IC2Filter2()               PWMC_SetIC2Filter(1)
#define PWMC_IC2Filter4()               PWMC_SetIC2Filter(2)
#define PWMC_IC2Filter8()               PWMC_SetIC2Filter(3)
#define PWMC_IC2Filter12()              PWMC_SetIC2Filter(4)
#define PWMC_IC2Filter16()              PWMC_SetIC2Filter(5)
#define PWMC_IC2Filter24()              PWMC_SetIC2Filter(6)
#define PWMC_IC2Filter32()              PWMC_SetIC2Filter(7)
#define PWMC_IC2Filter48()              PWMC_SetIC2Filter(8)
#define PWMC_IC2Filter64()              PWMC_SetIC2Filter(9)
#define PWMC_IC2Filter80()              PWMC_SetIC2Filter(10)
#define PWMC_IC2Filter96()              PWMC_SetIC2Filter(11)
#define PWMC_IC2Filter128()             PWMC_SetIC2Filter(12)
#define PWMC_IC2Filter160()             PWMC_SetIC2Filter(13)
#define PWMC_IC2Filter192()             PWMC_SetIC2Filter(14)
#define PWMC_IC2Filter256()             PWMC_SetIC2Filter(15)

#define HSPWMC_SetIC2Filter(n)          MODIFY_HSPWMC(PWMC_CCMR2,  PWMCCCMR2_IC2F_MSK, ((n) << 4))
#define HSPWMC_IC2Filter1()             HSPWMC_SetIC2Filter(0)
#define HSPWMC_IC2Filter2()             HSPWMC_SetIC2Filter(1)
#define HSPWMC_IC2Filter4()             HSPWMC_SetIC2Filter(2)
#define HSPWMC_IC2Filter8()             HSPWMC_SetIC2Filter(3)
#define HSPWMC_IC2Filter12()            HSPWMC_SetIC2Filter(4)
#define HSPWMC_IC2Filter16()            HSPWMC_SetIC2Filter(5)
#define HSPWMC_IC2Filter24()            HSPWMC_SetIC2Filter(6)
#define HSPWMC_IC2Filter32()            HSPWMC_SetIC2Filter(7)
#define HSPWMC_IC2Filter48()            HSPWMC_SetIC2Filter(8)
#define HSPWMC_IC2Filter64()            HSPWMC_SetIC2Filter(9)
#define HSPWMC_IC2Filter80()            HSPWMC_SetIC2Filter(10)
#define HSPWMC_IC2Filter96()            HSPWMC_SetIC2Filter(11)
#define HSPWMC_IC2Filter128()           HSPWMC_SetIC2Filter(12)
#define HSPWMC_IC2Filter160()           HSPWMC_SetIC2Filter(13)
#define HSPWMC_IC2Filter192()           HSPWMC_SetIC2Filter(14)
#define HSPWMC_IC2Filter256()           HSPWMC_SetIC2Filter(15)

