fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMCCCMR2_IC2PS_MSK             (BIT3 | BIT2)
#define PWMC_SetIC2Divider(n)           MODIFY_REG(PWMC_CCMR2,  PWMCCCMR2_IC2PS_MSK, ((n) << 2))
#define PWMC_IC2Divider1()              PWMC_SetIC2Divider(0)
#define PWMC_IC2Divider2()              PWMC_SetIC2Divider(1)
#define PWMC_IC2Divider4()              PWMC_SetIC2Divider(2)
#define PWMC_IC2Divider8()              PWMC_SetIC2Divider(3)

#define HSPWMC_SetIC2Divider(n)         MODIFY_HSPWMC(PWMC_CCMR2,  PWMCCCMR2_IC2PS_MSK, ((n) << 2))
#define HSPWMC_IC2Divider1()            HSPWMC_SetIC2Divider(0)
#define HSPWMC_IC2Divider2()            HSPWMC_SetIC2Divider(1)
#define HSPWMC_IC2Divider4()            HSPWMC_SetIC2Divider(2)
#define HSPWMC_IC2Divider8()            HSPWMC_SetIC2Divider(3)

#define PWMCCCMR3_OC3CE_MSK             BIT7
#define PWMC_EnableETRFClearOC3REF()    SET_REG_BIT(PWMC_CCMR3, PWMCCCMR3_OC3CE_MSK)
#define PWMC_DisableETRFClearOC3REF()   CLR_REG_BIT(PWMC_CCMR3, PWMCCCMR3_OC3CE_MSK)

#define HSPWMC_EnableETRFClearOC3REF()  SET_HSPWMC_BIT(PWMC_CCMR3, PWMCCCMR3_OC3CE_MSK)
#define HSPWMC_DisableETRFClearOC3REF() CLR_HSPWMC_BIT(PWMC_CCMR3, PWMCCCMR3_OC3CE_MSK)

#define PWMCCCMR3_OC3M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMCCCMR3X_OC3M3_MSK            BIT0
#define PWMC_SetOC3OutputMode(n)        MODIFY_REG(PWMC_CCMR3,  PWMCCCMR3_OC3M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMC_CCMR3X, PWMCCCMR3X_OC3M3_MSK, (((n) >> 3) << 0))
#define PWMC_OC3REFFrozen()             PWMC_SetOC3OutputMode(0)
#define PWMC_OC3REFHighIfMatch()        PWMC_SetOC3OutputMode(1)
#define PWMC_OC3REFLowIfMatch()         PWMC_SetOC3OutputMode(2)
#define PWMC_OC3REFToggleIfMatch()      PWMC_SetOC3OutputMode(3)
#define PWMC_OC3REFForceLow()           PWMC_SetOC3OutputMode(4)
#define PWMC_OC3REFForceHigh()          PWMC_SetOC3OutputMode(5)
#define PWMC_OC3REFPWMMode1()           PWMC_SetOC3OutputMode(6)
#define PWMC_OC3REFPWMMode2()           PWMC_SetOC3OutputMode(7)
#define PWMC_OC3REFReTrigOPMPWM1()      PWMC_SetOC3OutputMode(8)
#define PWMC_OC3REFReTrigOPMPWM2()      PWMC_SetOC3OutputMode(9)
#define PWMC_OC3REFCombinedPWM1()       PWMC_SetOC3OutputMode(12)
#define PWMC_OC3REFCombinedPWM2()       PWMC_SetOC3OutputMode(13)
#define PWMC_OC3REFAsymmetricPWM1()     PWMC_SetOC3OutputMode(14)
#define PWMC_OC3REFAsymmetricPWM2()     PWMC_SetOC3OutputMode(15)

#define HSPWMC_SetOC3OutputMode(n)      MODIFY_HSPWMC(PWMC_CCMR3,  PWMCCCMR3_OC3M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMC(PWMC_CCMR3X, PWMCCCMR3X_OC3M3_MSK, (((n) >> 3) << 0))
#define HSPWMC_OC3REFFrozen()           HSPWMC_SetOC3OutputMode(0)
#define HSPWMC_OC3REFHighIfMatch()      HSPWMC_SetOC3OutputMode(1)
#define HSPWMC_OC3REFLowIfMatch()       HSPWMC_SetOC3OutputMode(2)
#define HSPWMC_OC3REFToggleIfMatch()    HSPWMC_SetOC3OutputMode(3)
#define HSPWMC_OC3REFForceLow()         HSPWMC_SetOC3OutputMode(4)
#define HSPWMC_OC3REFForceHigh()        HSPWMC_SetOC3OutputMode(5)
#define HSPWMC_OC3REFPWMMode1()         HSPWMC_SetOC3OutputMode(6)
#define HSPWMC_OC3REFPWMMode2()         HSPWMC_SetOC3OutputMode(7)
#define HSPWMC_OC3REFReTrigOPMPWM1()    HSPWMC_SetOC3OutputMode(8)
#define HSPWMC_OC3REFReTrigOPMPWM2()    HSPWMC_SetOC3OutputMode(9)
#define HSPWMC_OC3REFCombinedPWM1()     HSPWMC_SetOC3OutputMode(12)
#define HSPWMC_OC3REFCombinedPWM2()     HSPWMC_SetOC3OutputMode(13)
#define HSPWMC_OC3REFAsymmetricPWM1()   HSPWMC_SetOC3OutputMode(14)
#define HSPWMC_OC3REFAsymmetricPWM2()   HSPWMC_SetOC3OutputMode(15)

#define PWMCCCMR3_OC3PE_MSK             BIT3
#define PWMC_UnbufferCCR3()             CLR_REG_BIT(PWMC_CCMR3, PWMCCCMR3_OC3PE_MSK)
#define PWMC_BufferCCR3()               SET_REG_BIT(PWMC_CCMR3, PWMCCCMR3_OC3PE_MSK)

#define HSPWMC_UnbufferCCR3()           CLR_HSPWMC_BIT(PWMC_CCMR3, PWMCCCMR3_OC3PE_MSK)
#define HSPWMC_BufferCCR3()             SET_HSPWMC_BIT(PWMC_CCMR3, PWMCCCMR3_OC3PE_MSK)

#define PWMCCCMR3_OC3FE_MSK             BIT2
#define PWMC_DisableOC3FastMode()       CLR_REG_BIT(PWMC_CCMR3, PWMCCCMR3_OC3FE_MSK)
#define PWMC_EnableOC3FastMode()        SET_REG_BIT(PWMC_CCMR3, PWMCCCMR3_OC3FE_MSK)

#define HSPWMC_DisableOC3FastMode()     CLR_HSPWMC_BIT(PWMC_CCMR3, PWMCCCMR3_OC3FE_MSK)
#define HSPWMC_EnableOC3FastMode()      SET_HSPWMC_BIT(PWMC_CCMR3, PWMCCCMR3_OC3FE_MSK)

#define PWMCCCMR3_CC3S_MSK              (BIT1 | BIT0)
#define PWMC_SetCC3Mode(n)              MODIFY_REG(PWMC_CCMR3,  PWMCCCMR3_CC3S_MSK, ((n) << 0))
#define PWMC_CC3Output()                PWMC_SetCC3Mode(0)
#define PWMC_CC3CaptureTI3FP3()         PWMC_SetCC3Mode(1)
#define PWMC_CC3CaptureTI4FP3()         PWMC_SetCC3Mode(2)
#define PWMC_CC3CaptureTRC()            PWMC_SetCC3Mode(3)

#define HSPWMC_SetCC3Mode(n)            MODIFY_HSPWMC(PWMC_CCMR3,  PWMCCCMR3_CC3S_MSK, ((n) << 0))
#define HSPWMC_CC3Output()              HSPWMC_SetCC3Mode(0)
#define HSPWMC_CC3CaptureTI3FP3()       HSPWMC_SetCC3Mode(1)
#define HSPWMC_CC3CaptureTI4FP3()       HSPWMC_SetCC3Mode(2)
#define HSPWMC_CC3CaptureTRC()          HSPWMC_SetCC3Mode(3)

#define PWMCCCMR3_IC3F_MSK              (BIT_HN)
#define PWMC_SetIC3Filter(n)            MODIFY_REG(PWMC_CCMR3,  PWMCCCMR3_IC3F_MSK, ((n) << 4))
#define PWMC_IC3Filter1()               PWMC_SetIC3Filter(0)
#define PWMC_IC3Filter2()               PWMC_SetIC3Filter(1)
#define PWMC_IC3Filter4()               PWMC_SetIC3Filter(2)
#define PWMC_IC3Filter8()               PWMC_SetIC3Filter(3)
#define PWMC_IC3Filter12()              PWMC_SetIC3Filter(4)
#define PWMC_IC3Filter16()              PWMC_SetIC3Filter(5)
#define PWMC_IC3Filter24()              PWMC_SetIC3Filter(6)
#define PWMC_IC3Filter32()              PWMC_SetIC3Filter(7)
#define PWMC_IC3Filter48()              PWMC_SetIC3Filter(8)
#define PWMC_IC3Filter64()              PWMC_SetIC3Filter(9)
#define PWMC_IC3Filter80()              PWMC_SetIC3Filter(10)
#define PWMC_IC3Filter96()              PWMC_SetIC3Filter(11)
#define PWMC_IC3Filter128()             PWMC_SetIC3Filter(12)
#define PWMC_IC3Filter160()             PWMC_SetIC3Filter(13)
#define PWMC_IC3Filter192()             PWMC_SetIC3Filter(14)
#define PWMC_IC3Filter256()             PWMC_SetIC3Filter(15)

