fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMC_SetIC3Filter(n)          MODIFY_HSPWMC(PWMC_CCMR3,  PWMCCCMR3_IC3F_MSK, ((n) << 4))
#define HSPWMC_IC3Filter1()             HSPWMC_SetIC3Filter(0)
#define HSPWMC_IC3Filter2()             HSPWMC_SetIC3Filter(1)
#define HSPWMC_IC3Filter4()             HSPWMC_SetIC3Filter(2)
#define HSPWMC_IC3Filter8()             HSPWMC_SetIC3Filter(3)
#define HSPWMC_IC3Filter12()            HSPWMC_SetIC3Filter(4)
#define HSPWMC_IC3Filter16()            HSPWMC_SetIC3Filter(5)
#define HSPWMC_IC3Filter24()            HSPWMC_SetIC3Filter(6)
#define HSPWMC_IC3Filter32()            HSPWMC_SetIC3Filter(7)
#define HSPWMC_IC3Filter48()            HSPWMC_SetIC3Filter(8)
#define HSPWMC_IC3Filter64()            HSPWMC_SetIC3Filter(9)
#define HSPWMC_IC3Filter80()            HSPWMC_SetIC3Filter(10)
#define HSPWMC_IC3Filter96()            HSPWMC_SetIC3Filter(11)
#define HSPWMC_IC3Filter128()           HSPWMC_SetIC3Filter(12)
#define HSPWMC_IC3Filter160()           HSPWMC_SetIC3Filter(13)
#define HSPWMC_IC3Filter192()           HSPWMC_SetIC3Filter(14)
#define HSPWMC_IC3Filter256()           HSPWMC_SetIC3Filter(15)

#define PWMCCCMR3_IC3PS_MSK             (BIT3 | BIT2)
#define PWMC_SetIC3Divider(n)           MODIFY_REG(PWMC_CCMR3,  PWMCCCMR3_IC3PS_MSK, ((n) << 2))
#define PWMC_IC3Divider1()              PWMC_SetIC3Divider(0)
#define PWMC_IC3Divider2()              PWMC_SetIC3Divider(1)
#define PWMC_IC3Divider4()              PWMC_SetIC3Divider(2)
#define PWMC_IC3Divider8()              PWMC_SetIC3Divider(3)

#define HSPWMC_SetIC3Divider(n)         MODIFY_HSPWMC(PWMC_CCMR3,  PWMCCCMR3_IC3PS_MSK, ((n) << 2))
#define HSPWMC_IC3Divider1()            HSPWMC_SetIC3Divider(0)
#define HSPWMC_IC3Divider2()            HSPWMC_SetIC3Divider(1)
#define HSPWMC_IC3Divider4()            HSPWMC_SetIC3Divider(2)
#define HSPWMC_IC3Divider8()            HSPWMC_SetIC3Divider(3)

#define PWMCCCMR4_OC4CE_MSK             BIT7
#define PWMC_EnableETRFClearOC4REF()    SET_REG_BIT(PWMC_CCMR4, PWMCCCMR4_OC4CE_MSK)
#define PWMC_DisableETRFClearOC4REF()   CLR_REG_BIT(PWMC_CCMR4, PWMCCCMR4_OC4CE_MSK)

#define HSPWMC_EnableETRFClearOC4REF()  SET_HSPWMC_BIT(PWMC_CCMR4, PWMCCCMR4_OC4CE_MSK)
#define HSPWMC_DisableETRFClearOC4REF() CLR_HSPWMC_BIT(PWMC_CCMR4, PWMCCCMR4_OC4CE_MSK)

#define PWMCCCMR4_OC4M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMCCCMR4X_OC4M3_MSK            BIT0
#define PWMC_SetOC4OutputMode(n)        MODIFY_REG(PWMC_CCMR4,  PWMCCCMR4_OC4M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMC_CCMR4X, PWMCCCMR4X_OC4M3_MSK, (((n) >> 3) << 0))
#define PWMC_OC4REFFrozen()             PWMC_SetOC4OutputMode(0)
#define PWMC_OC4REFHighIfMatch()        PWMC_SetOC4OutputMode(1)
#define PWMC_OC4REFLowIfMatch()         PWMC_SetOC4OutputMode(2)
#define PWMC_OC4REFToggleIfMatch()      PWMC_SetOC4OutputMode(3)
#define PWMC_OC4REFForceLow()           PWMC_SetOC4OutputMode(4)
#define PWMC_OC4REFForceHigh()          PWMC_SetOC4OutputMode(5)
#define PWMC_OC4REFPWMMode1()           PWMC_SetOC4OutputMode(6)
#define PWMC_OC4REFPWMMode2()           PWMC_SetOC4OutputMode(7)
#define PWMC_OC4REFReTrigOPMPWM1()      PWMC_SetOC4OutputMode(8)
#define PWMC_OC4REFReTrigOPMPWM2()      PWMC_SetOC4OutputMode(9)
#define PWMC_OC4REFCombinedPWM1()       PWMC_SetOC4OutputMode(12)
#define PWMC_OC4REFCombinedPWM2()       PWMC_SetOC4OutputMode(13)
#define PWMC_OC4REFAsymmetricPWM1()     PWMC_SetOC4OutputMode(14)
#define PWMC_OC4REFAsymmetricPWM2()     PWMC_SetOC4OutputMode(15)

#define HSPWMC_SetOC4OutputMode(n)      MODIFY_HSPWMC(PWMC_CCMR4,  PWMCCCMR4_OC4M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMC(PWMC_CCMR4X, PWMCCCMR4X_OC4M3_MSK, (((n) >> 3) << 0))
#define HSPWMC_OC4REFFrozen()           HSPWMC_SetOC4OutputMode(0)
#define HSPWMC_OC4REFHighIfMatch()      HSPWMC_SetOC4OutputMode(1)
#define HSPWMC_OC4REFLowIfMatch()       HSPWMC_SetOC4OutputMode(2)
#define HSPWMC_OC4REFToggleIfMatch()    HSPWMC_SetOC4OutputMode(3)
#define HSPWMC_OC4REFForceLow()         HSPWMC_SetOC4OutputMode(4)
#define HSPWMC_OC4REFForceHigh()        HSPWMC_SetOC4OutputMode(5)
#define HSPWMC_OC4REFPWMMode1()         HSPWMC_SetOC4OutputMode(6)
#define HSPWMC_OC4REFPWMMode2()         HSPWMC_SetOC4OutputMode(7)
#define HSPWMC_OC4REFReTrigOPMPWM1()    HSPWMC_SetOC4OutputMode(8)
#define HSPWMC_OC4REFReTrigOPMPWM2()    HSPWMC_SetOC4OutputMode(9)
#define HSPWMC_OC4REFCombinedPWM1()     HSPWMC_SetOC4OutputMode(12)
#define HSPWMC_OC4REFCombinedPWM2()     HSPWMC_SetOC4OutputMode(13)
#define HSPWMC_OC4REFAsymmetricPWM1()   HSPWMC_SetOC4OutputMode(14)
#define HSPWMC_OC4REFAsymmetricPWM2()   HSPWMC_SetOC4OutputMode(15)

#define PWMCCCMR4_OC4PE_MSK             BIT3
#define PWMC_UnbufferCCR4()             CLR_REG_BIT(PWMC_CCMR4, PWMCCCMR4_OC4PE_MSK)
#define PWMC_BufferCCR4()               SET_REG_BIT(PWMC_CCMR4, PWMCCCMR4_OC4PE_MSK)

#define HSPWMC_UnbufferCCR4()           CLR_HSPWMC_BIT(PWMC_CCMR4, PWMCCCMR4_OC4PE_MSK)
#define HSPWMC_BufferCCR4()             SET_HSPWMC_BIT(PWMC_CCMR4, PWMCCCMR4_OC4PE_MSK)

#define PWMCCCMR4_OC4FE_MSK             BIT2
#define PWMC_DisableOC4FastMode()       CLR_REG_BIT(PWMC_CCMR4, PWMCCCMR4_OC4FE_MSK)
#define PWMC_EnableOC4FastMode()        SET_REG_BIT(PWMC_CCMR4, PWMCCCMR4_OC4FE_MSK)

#define HSPWMC_DisableOC4FastMode()     CLR_HSPWMC_BIT(PWMC_CCMR4, PWMCCCMR4_OC4FE_MSK)
#define HSPWMC_EnableOC4FastMode()      SET_HSPWMC_BIT(PWMC_CCMR4, PWMCCCMR4_OC4FE_MSK)

#define PWMCCCMR4_CC4S_MSK              (BIT1 | BIT0)
#define PWMC_SetCC4Mode(n)              MODIFY_REG(PWMC_CCMR4,  PWMCCCMR4_CC4S_MSK, ((n) << 0))
#define PWMC_CC4Output()                PWMC_SetCC4Mode(0)
#define PWMC_CC4CaptureTI4FP4()         PWMC_SetCC4Mode(1)
#define PWMC_CC4CaptureTI3FP4()         PWMC_SetCC4Mode(2)
#define PWMC_CC4CaptureTRC()            PWMC_SetCC4Mode(3)

#define HSPWMC_SetCC4Mode(n)            MODIFY_HSPWMC(PWMC_CCMR4,  PWMCCCMR4_CC4S_MSK, ((n) << 0))
#define HSPWMC_CC4Output()              HSPWMC_SetCC4Mode(0)
#define HSPWMC_CC4CaptureTI4FP4()       HSPWMC_SetCC4Mode(1)
#define HSPWMC_CC4CaptureTI3FP4()       HSPWMC_SetCC4Mode(2)
#define HSPWMC_CC4CaptureTRC()          HSPWMC_SetCC4Mode(3)

#define PWMCCCMR4_IC4F_MSK              (BIT_HN)
#define PWMC_SetIC4Filter(n)            MODIFY_REG(PWMC_CCMR4,  PWMCCCMR4_IC4F_MSK, ((n) << 4))
#define PWMC_IC4Filter1()               PWMC_SetIC4Filter(0)
#define PWMC_IC4Filter2()               PWMC_SetIC4Filter(1)
#define PWMC_IC4Filter4()               PWMC_SetIC4Filter(2)
#define PWMC_IC4Filter8()               PWMC_SetIC4Filter(3)
#define PWMC_IC4Filter12()              PWMC_SetIC4Filter(4)
#define PWMC_IC4Filter16()              PWMC_SetIC4Filter(5)
#define PWMC_IC4Filter24()              PWMC_SetIC4Filter(6)
#define PWMC_IC4Filter32()              PWMC_SetIC4Filter(7)
#define PWMC_IC4Filter48()              PWMC_SetIC4Filter(8)
#define PWMC_IC4Filter64()              PWMC_SetIC4Filter(9)
#define PWMC_IC4Filter80()              PWMC_SetIC4Filter(10)
#define PWMC_IC4Filter96()              PWMC_SetIC4Filter(11)
#define PWMC_IC4Filter128()             PWMC_SetIC4Filter(12)
#define PWMC_IC4Filter160()             PWMC_SetIC4Filter(13)
#define PWMC_IC4Filter192()             PWMC_SetIC4Filter(14)
#define PWMC_IC4Filter256()             PWMC_SetIC4Filter(15)

#define HSPWMC_SetIC4Filter(n)          MODIFY_HSPWMC(PWMC_CCMR4,  PWMCCCMR4_IC4F_MSK, ((n) << 4))
#define HSPWMC_IC4Filter1()             HSPWMC_SetIC4Filter(0)
#define HSPWMC_IC4Filter2()             HSPWMC_SetIC4Filter(1)
#define HSPWMC_IC4Filter4()             HSPWMC_SetIC4Filter(2)
#define HSPWMC_IC4Filter8()             HSPWMC_SetIC4Filter(3)
#define HSPWMC_IC4Filter12()            HSPWMC_SetIC4Filter(4)
#define HSPWMC_IC4Filter16()            HSPWMC_SetIC4Filter(5)
#define HSPWMC_IC4Filter24()            HSPWMC_SetIC4Filter(6)
#define HSPWMC_IC4Filter32()            HSPWMC_SetIC4Filter(7)
#define HSPWMC_IC4Filter48()            HSPWMC_SetIC4Filter(8)
#define HSPWMC_IC4Filter64()            HSPWMC_SetIC4Filter(9)
#define HSPWMC_IC4Filter80()            HSPWMC_SetIC4Filter(10)
#define HSPWMC_IC4Filter96()            HSPWMC_SetIC4Filter(11)
#define HSPWMC_IC4Filter128()           HSPWMC_SetIC4Filter(12)
#define HSPWMC_IC4Filter160()           HSPWMC_SetIC4Filter(13)
#define HSPWMC_IC4Filter192()           HSPWMC_SetIC4Filter(14)
#define HSPWMC_IC4Filter256()           HSPWMC_SetIC4Filter(15)

#define PWMCCCMR4_IC4PS_MSK             (BIT3 | BIT2)
#define PWMC_SetIC4Divider(n)           MODIFY_REG(PWMC_CCMR4,  PWMCCCMR4_IC4PS_MSK, ((n) << 2))
#define PWMC_IC4Divider1()              PWMC_SetIC4Divider(0)
#define PWMC_IC4Divider2()              PWMC_SetIC4Divider(1)
#define PWMC_IC4Divider4()              PWMC_SetIC4Divider(2)
#define PWMC_IC4Divider8()              PWMC_SetIC4Divider(3)

#define HSPWMC_SetIC4Divider(n)         MODIFY_HSPWMC(PWMC_CCMR4,  PWMCCCMR4_IC4PS_MSK, ((n) << 2))
#define HSPWMC_IC4Divider1()            HSPWMC_SetIC4Divider(0)
#define HSPWMC_IC4Divider2()            HSPWMC_SetIC4Divider(1)
#define HSPWMC_IC4Divider4()            HSPWMC_SetIC4Divider(2)
#define HSPWMC_IC4Divider8()            HSPWMC_SetIC4Divider(3)

