fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMCCCMR5_OC5CE_MSK             BIT7
#define PWMC_EnableETRFClearOC5REF()    SET_REG_BIT(PWMC_CCMR5, PWMCCCMR5_OC5CE_MSK)
#define PWMC_DisableETRFClearOC5REF()   CLR_REG_BIT(PWMC_CCMR5, PWMCCCMR5_OC5CE_MSK)

#define HSPWMC_EnableETRFClearOC5REF()  SET_HSPWMC_BIT(PWMC_CCMR5, PWMCCCMR5_OC5CE_MSK)
#define HSPWMC_DisableETRFClearOC5REF() CLR_HSPWMC_BIT(PWMC_CCMR5, PWMCCCMR5_OC5CE_MSK)

#define PWMCCCMR5_OC5M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMCCCMR5X_OC5M3_MSK            BIT0
#define PWMC_SetOC5OutputMode(n)        MODIFY_REG(PWMC_CCMR5,  PWMCCCMR5_OC5M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMC_CCMR5X, PWMCCCMR5X_OC5M3_MSK, (((n) >> 3) << 0))
#define PWMC_OC5REFFrozen()             PWMC_SetOC5OutputMode(0)
#define PWMC_OC5REFHighIfMatch()        PWMC_SetOC5OutputMode(1)
#define PWMC_OC5REFLowIfMatch()         PWMC_SetOC5OutputMode(2)
#define PWMC_OC5REFToggleIfMatch()      PWMC_SetOC5OutputMode(3)
#define PWMC_OC5REFForceLow()           PWMC_SetOC5OutputMode(4)
#define PWMC_OC5REFForceHigh()          PWMC_SetOC5OutputMode(5)
#define PWMC_OC5REFPWMMode1()           PWMC_SetOC5OutputMode(6)
#define PWMC_OC5REFPWMMode2()           PWMC_SetOC5OutputMode(7)
#define PWMC_OC5REFReTrigOPMPWM1()      PWMC_SetOC5OutputMode(8)
#define PWMC_OC5REFReTrigOPMPWM2()      PWMC_SetOC5OutputMode(9)
#define PWMC_OC5REFCombinedPWM1()       PWMC_SetOC5OutputMode(12)
#define PWMC_OC5REFCombinedPWM2()       PWMC_SetOC5OutputMode(13)
#define PWMC_OC5REFAsymmetricPWM1()     PWMC_SetOC5OutputMode(14)
#define PWMC_OC5REFAsymmetricPWM2()     PWMC_SetOC5OutputMode(15)

#define HSPWMC_SetOC5OutputMode(n)      MODIFY_HSPWMC(PWMC_CCMR5,  PWMCCCMR5_OC5M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMC(PWMC_CCMR5X, PWMCCCMR5X_OC5M3_MSK, (((n) >> 3) << 0))
#define HSPWMC_OC5REFFrozen()           HSPWMC_SetOC5OutputMode(0)
#define HSPWMC_OC5REFHighIfMatch()      HSPWMC_SetOC5OutputMode(1)
#define HSPWMC_OC5REFLowIfMatch()       HSPWMC_SetOC5OutputMode(2)
#define HSPWMC_OC5REFToggleIfMatch()    HSPWMC_SetOC5OutputMode(3)
#define HSPWMC_OC5REFForceLow()         HSPWMC_SetOC5OutputMode(4)
#define HSPWMC_OC5REFForceHigh()        HSPWMC_SetOC5OutputMode(5)
#define HSPWMC_OC5REFPWMMode1()         HSPWMC_SetOC5OutputMode(6)
#define HSPWMC_OC5REFPWMMode2()         HSPWMC_SetOC5OutputMode(7)
#define HSPWMC_OC5REFReTrigOPMPWM1()    HSPWMC_SetOC5OutputMode(8)
#define HSPWMC_OC5REFReTrigOPMPWM2()    HSPWMC_SetOC5OutputMode(9)
#define HSPWMC_OC5REFCombinedPWM1()     HSPWMC_SetOC5OutputMode(12)
#define HSPWMC_OC5REFCombinedPWM2()     HSPWMC_SetOC5OutputMode(13)
#define HSPWMC_OC5REFAsymmetricPWM1()   HSPWMC_SetOC5OutputMode(14)
#define HSPWMC_OC5REFAsymmetricPWM2()   HSPWMC_SetOC5OutputMode(15)

#define PWMCCCMR5_OC5PE_MSK             BIT3
#define PWMC_UnbufferCCR5()             CLR_REG_BIT(PWMC_CCMR5, PWMCCCMR5_OC5PE_MSK)
#define PWMC_BufferCCR5()               SET_REG_BIT(PWMC_CCMR5, PWMCCCMR5_OC5PE_MSK)

#define HSPWMC_UnbufferCCR5()           CLR_HSPWMC_BIT(PWMC_CCMR5, PWMCCCMR5_OC5PE_MSK)
#define HSPWMC_BufferCCR5()             SET_HSPWMC_BIT(PWMC_CCMR5, PWMCCCMR5_OC5PE_MSK)

#define PWMCCCMR6_OC6CE_MSK             BIT7
#define PWMC_EnableETRFClearOC6REF()    SET_REG_BIT(PWMC_CCMR6, PWMCCCMR6_OC6CE_MSK)
#define PWMC_DisableETRFClearOC6REF()   CLR_REG_BIT(PWMC_CCMR6, PWMCCCMR6_OC6CE_MSK)

#define HSPWMC_EnableETRFClearOC6REF()  SET_HSPWMC_BIT(PWMC_CCMR6, PWMCCCMR6_OC6CE_MSK)
#define HSPWMC_DisableETRFClearOC6REF() CLR_HSPWMC_BIT(PWMC_CCMR6, PWMCCCMR6_OC6CE_MSK)

#define PWMCCCMR6_OC6M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMCCCMR6X_OC6M3_MSK            BIT0
#define PWMC_SetOC6OutputMode(n)        MODIFY_REG(PWMC_CCMR6,  PWMCCCMR6_OC6M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWMC_CCMR6X, PWMCCCMR6X_OC6M3_MSK, (((n) >> 3) << 0))
#define PWMC_OC6REFFrozen()             PWMC_SetOC6OutputMode(0)
#define PWMC_OC6REFHighIfMatch()        PWMC_SetOC6OutputMode(1)
#define PWMC_OC6REFLowIfMatch()         PWMC_SetOC6OutputMode(2)
#define PWMC_OC6REFToggleIfMatch()      PWMC_SetOC6OutputMode(3)
#define PWMC_OC6REFForceLow()           PWMC_SetOC6OutputMode(4)
#define PWMC_OC6REFForceHigh()          PWMC_SetOC6OutputMode(5)
#define PWMC_OC6REFPWMMode1()           PWMC_SetOC6OutputMode(6)
#define PWMC_OC6REFPWMMode2()           PWMC_SetOC6OutputMode(7)
#define PWMC_OC6REFReTrigOPMPWM1()      PWMC_SetOC6OutputMode(8)
#define PWMC_OC6REFReTrigOPMPWM2()      PWMC_SetOC6OutputMode(9)
#define PWMC_OC6REFCombinedPWM1()       PWMC_SetOC6OutputMode(12)
#define PWMC_OC6REFCombinedPWM2()       PWMC_SetOC6OutputMode(13)
#define PWMC_OC6REFAsymmetricPWM1()     PWMC_SetOC6OutputMode(14)
#define PWMC_OC6REFAsymmetricPWM2()     PWMC_SetOC6OutputMode(15)

#define HSPWMC_SetOC6OutputMode(n)      MODIFY_HSPWMC(PWMC_CCMR6,  PWMCCCMR6_OC6M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWMC(PWMC_CCMR6X, PWMCCCMR6X_OC6M3_MSK, (((n) >> 3) << 0))
#define HSPWMC_OC6REFFrozen()           HSPWMC_SetOC6OutputMode(0)
#define HSPWMC_OC6REFHighIfMatch()      HSPWMC_SetOC6OutputMode(1)
#define HSPWMC_OC6REFLowIfMatch()       HSPWMC_SetOC6OutputMode(2)
#define HSPWMC_OC6REFToggleIfMatch()    HSPWMC_SetOC6OutputMode(3)
#define HSPWMC_OC6REFForceLow()         HSPWMC_SetOC6OutputMode(4)
#define HSPWMC_OC6REFForceHigh()        HSPWMC_SetOC6OutputMode(5)
#define HSPWMC_OC6REFPWMMode1()         HSPWMC_SetOC6OutputMode(6)
#define HSPWMC_OC6REFPWMMode2()         HSPWMC_SetOC6OutputMode(7)
#define HSPWMC_OC6REFReTrigOPMPWM1()    HSPWMC_SetOC6OutputMode(8)
#define HSPWMC_OC6REFReTrigOPMPWM2()    HSPWMC_SetOC6OutputMode(9)
#define HSPWMC_OC6REFCombinedPWM1()     HSPWMC_SetOC6OutputMode(12)
#define HSPWMC_OC6REFCombinedPWM2()     HSPWMC_SetOC6OutputMode(13)
#define HSPWMC_OC6REFAsymmetricPWM1()   HSPWMC_SetOC6OutputMode(14)
#define HSPWMC_OC6REFAsymmetricPWM2()   HSPWMC_SetOC6OutputMode(15)

#define PWMCCCMR6_OC6PE_MSK             BIT3
#define PWMC_UnbufferCCR6()             CLR_REG_BIT(PWMC_CCMR6, PWMCCCMR6_OC6PE_MSK)
#define PWMC_BufferCCR6()               SET_REG_BIT(PWMC_CCMR6, PWMCCCMR6_OC6PE_MSK)

