fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMC_UnbufferCCR6()           CLR_HSPWMC_BIT(PWMC_CCMR6, PWMCCCMR6_OC6PE_MSK)
#define HSPWMC_BufferCCR6()             SET_HSPWMC_BIT(PWMC_CCMR6, PWMCCCMR6_OC6PE_MSK)

#define PWMCCCER1_CC1E_MSK              BIT0
#define PWMC_CC1PEnable()               SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1E_MSK)
#define PWMC_CC1PDisable()              CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1E_MSK)

#define HSPWMC_CC1PEnable()             SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1E_MSK)
#define HSPWMC_CC1PDisable()            CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1E_MSK)

#define PWMCCCER1_CC1P_MSK              BIT1
#define PWMC_CC1PNonInverted()          CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1P_MSK)
#define PWMC_CC1PInverted()             SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1P_MSK)

#define HSPWMC_CC1PNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1P_MSK)
#define HSPWMC_CC1PInverted()           SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1P_MSK)

#define PWMCCCER1_CC1NE_MSK             BIT2
#define PWMC_CC1NEnable()               SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1NE_MSK)
#define PWMC_CC1NDisable()              CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1NE_MSK)

#define HSPWMC_CC1NEnable()             SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1NE_MSK)
#define HSPWMC_CC1NDisable()            CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1NE_MSK)

#define PWMCCCER1_CC1NP_MSK             BIT3
#define PWMC_CC1NNonInverted()          CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1NP_MSK)
#define PWMC_CC1NInverted()             SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC1NP_MSK)

#define HSPWMC_CC1NNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1NP_MSK)
#define HSPWMC_CC1NInverted()           SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC1NP_MSK)

#define PWMCCCER1_CC2E_MSK              BIT4
#define PWMC_CC2PEnable()               SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2E_MSK)
#define PWMC_CC2PDisable()              CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2E_MSK)

#define HSPWMC_CC2PEnable()             SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2E_MSK)
#define HSPWMC_CC2PDisable()            CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2E_MSK)

#define PWMCCCER1_CC2P_MSK              BIT5
#define PWMC_CC2PNonInverted()          CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2P_MSK)
#define PWMC_CC2PInverted()             SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2P_MSK)

#define HSPWMC_CC2PNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2P_MSK)
#define HSPWMC_CC2PInverted()           SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2P_MSK)

#define PWMCCCER1_CC2NE_MSK             BIT6
#define PWMC_CC2NEnable()               SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2NE_MSK)
#define PWMC_CC2NDisable()              CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2NE_MSK)

#define HSPWMC_CC2NEnable()             SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2NE_MSK)
#define HSPWMC_CC2NDisable()            CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2NE_MSK)

#define PWMCCCER1_CC2NP_MSK             BIT7
#define PWMC_CC2NNonInverted()          CLR_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2NP_MSK)
#define PWMC_CC2NInverted()             SET_REG_BIT(PWMC_CCER1, PWMCCCER1_CC2NP_MSK)

#define HSPWMC_CC2NNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2NP_MSK)
#define HSPWMC_CC2NInverted()           SET_HSPWMC_BIT(PWMC_CCER1, PWMCCCER1_CC2NP_MSK)

#define PWMCCCER2_CC3E_MSK              BIT0
#define PWMC_CC3PEnable()               SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3E_MSK)
#define PWMC_CC3PDisable()              CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3E_MSK)

#define HSPWMC_CC3PEnable()             SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3E_MSK)
#define HSPWMC_CC3PDisable()            CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3E_MSK)

#define PWMCCCER2_CC3P_MSK              BIT1
#define PWMC_CC3PNonInverted()          CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3P_MSK)
#define PWMC_CC3PInverted()             SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3P_MSK)

#define HSPWMC_CC3PNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3P_MSK)
#define HSPWMC_CC3PInverted()           SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3P_MSK)

#define PWMCCCER2_CC3NE_MSK             BIT2
#define PWMC_CC3NEnable()               SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3NE_MSK)
#define PWMC_CC3NDisable()              CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3NE_MSK)

#define HSPWMC_CC3NEnable()             SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3NE_MSK)
#define HSPWMC_CC3NDisable()            CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3NE_MSK)

#define PWMCCCER2_CC3NP_MSK             BIT3
#define PWMC_CC3NNonInverted()          CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3NP_MSK)
#define PWMC_CC3NInverted()             SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC3NP_MSK)

#define HSPWMC_CC3NNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3NP_MSK)
#define HSPWMC_CC3NInverted()           SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC3NP_MSK)

#define PWMCCCER2_CC4E_MSK              BIT4
#define PWMC_CC4PEnable()               SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4E_MSK)
#define PWMC_CC4PDisable()              CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4E_MSK)

#define HSPWMC_CC4PEnable()             SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4E_MSK)
#define HSPWMC_CC4PDisable()            CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4E_MSK)

#define PWMCCCER2_CC4P_MSK              BIT5
#define PWMC_CC4PNonInverted()          CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4P_MSK)
#define PWMC_CC4PInverted()             SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4P_MSK)

#define HSPWMC_CC4PNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4P_MSK)
#define HSPWMC_CC4PInverted()           SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4P_MSK)

#define PWMCCCER2_CC4NE_MSK             BIT6
#define PWMC_CC4NEnable()               SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4NE_MSK)
#define PWMC_CC4NDisable()              CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4NE_MSK)

#define HSPWMC_CC4NEnable()             SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4NE_MSK)
#define HSPWMC_CC4NDisable()            CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4NE_MSK)

#define PWMCCCER2_CC4NP_MSK             BIT7
#define PWMC_CC4NNonInverted()          CLR_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4NP_MSK)
#define PWMC_CC4NInverted()             SET_REG_BIT(PWMC_CCER2, PWMCCCER2_CC4NP_MSK)

#define HSPWMC_CC4NNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4NP_MSK)
#define HSPWMC_CC4NInverted()           SET_HSPWMC_BIT(PWMC_CCER2, PWMCCCER2_CC4NP_MSK)

#define PWMCCCER3_CC5E_MSK              BIT0
#define PWMC_CC5PEnable()               SET_REG_BIT(PWMC_CCER3, PWMCCCER3_CC5E_MSK)
#define PWMC_CC5PDisable()              CLR_REG_BIT(PWMC_CCER3, PWMCCCER3_CC5E_MSK)

