fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMC_CC5PEnable()             SET_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC5E_MSK)
#define HSPWMC_CC5PDisable()            CLR_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC5E_MSK)

#define PWMCCCER3_CC5P_MSK              BIT1
#define PWMC_CC5PNonInverted()          CLR_REG_BIT(PWMC_CCER3, PWMCCCER3_CC5P_MSK)
#define PWMC_CC5PInverted()             SET_REG_BIT(PWMC_CCER3, PWMCCCER3_CC5P_MSK)

#define HSPWMC_CC5PNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC5P_MSK)
#define HSPWMC_CC5PInverted()           SET_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC5P_MSK)

#define PWMCCCER3_CC6E_MSK              BIT4
#define PWMC_CC6PEnable()               SET_REG_BIT(PWMC_CCER3, PWMCCCER3_CC6E_MSK)
#define PWMC_CC6PDisable()              CLR_REG_BIT(PWMC_CCER3, PWMCCCER3_CC6E_MSK)

#define HSPWMC_CC6PEnable()             SET_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC6E_MSK)
#define HSPWMC_CC6PDisable()            CLR_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC6E_MSK)

#define PWMCCCER3_CC6P_MSK              BIT5
#define PWMC_CC6PNonInverted()          CLR_REG_BIT(PWMC_CCER3, PWMCCCER3_CC6P_MSK)
#define PWMC_CC6PInverted()             SET_REG_BIT(PWMC_CCER3, PWMCCCER3_CC6P_MSK)

#define HSPWMC_CC6PNonInverted()        CLR_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC6P_MSK)
#define HSPWMC_CC6PInverted()           SET_HSPWMC_BIT(PWMC_CCER3, PWMCCCER3_CC6P_MSK)

#define PWMCBRK_MOE_MSK                 BIT7
#define PWMC_EnableMainOutput()         SET_REG_BIT(PWMC_BKR, PWMCBRK_MOE_MSK)
#define PWMC_DisableMainOutput()        CLR_REG_BIT(PWMC_BKR, PWMCBRK_MOE_MSK)

#define HSPWMC_EnableMainOutput()       SET_HSPWMC_BIT(PWMC_BKR, PWMCBRK_MOE_MSK)
#define HSPWMC_DisableMainOutput()      CLR_HSPWMC_BIT(PWMC_BKR, PWMCBRK_MOE_MSK)

#define PWMCBRK_AOE_MSK                 BIT6
#define PWMC_EnableAutoOutput()         SET_REG_BIT(PWMC_BKR, PWMCBRK_AOE_MSK)
#define PWMC_DisableAutoOutput()        CLR_REG_BIT(PWMC_BKR, PWMCBRK_AOE_MSK)

#define HSPWMC_EnableAutoOutput()       SET_HSPWMC_BIT(PWMC_BKR, PWMCBRK_AOE_MSK)
#define HSPWMC_DisableAutoOutput()      CLR_HSPWMC_BIT(PWMC_BKR, PWMCBRK_AOE_MSK)

#define PWMCBRK_BKP_MSK                 BIT5
#define PWMC_BRKNonInverted()           SET_REG_BIT(PWMC_BKR, PWMCBRK_BKP_MSK)
#define PWMC_BRKInverted()              CLR_REG_BIT(PWMC_BKR, PWMCBRK_BKP_MSK)

#define HSPWMC_BRKNonInverted()         SET_HSPWMC_BIT(PWMC_BKR, PWMCBRK_BKP_MSK)
#define HSPWMC_BRKInverted()            CLR_HSPWMC_BIT(PWMC_BKR, PWMCBRK_BKP_MSK)

#define PWMCBRK_BKE_MSK                 BIT4
#define PWMC_BRKEnable()                SET_REG_BIT(PWMC_BKR, PWMCBRK_BKE_MSK)
#define PWMC_BRKDisable()               CLR_REG_BIT(PWMC_BKR, PWMCBRK_BKE_MSK)

#define HSPWMC_BRKEnable()              SET_HSPWMC_BIT(PWMC_BKR, PWMCBRK_BKE_MSK)
#define HSPWMC_BRKDisable()             CLR_HSPWMC_BIT(PWMC_BKR, PWMCBRK_BKE_MSK)

#define PWMCBRK_OSSR_MSK                BIT3
#define PWMCBRK_OSSI_MSK                BIT2
#define PWMC_RunInactiveNoOutput()      CLR_REG_BIT(PWMC_BKR, PWMCBRK_OSSR_MSK)
#define PWMC_RunInactiveOutput()        SET_REG_BIT(PWMC_BKR, PWMCBRK_OSSR_MSK)
#define PWMC_IdleInactiveNoOutput()     CLR_REG_BIT(PWMC_BKR, PWMCBRK_OSSI_MSK)
#define PWMC_IdleInactiveOutput()       SET_REG_BIT(PWMC_BKR, PWMCBRK_OSSI_MSK)

#define HSPWMC_RunInactiveNoOutput()    CLR_HSPWMC_BIT(PWMC_BKR, PWMCBRK_OSSR_MSK)
#define HSPWMC_RunInactiveOutput()      SET_HSPWMC_BIT(PWMC_BKR, PWMCBRK_OSSR_MSK)
#define HSPWMC_IdleInactiveNoOutput()   CLR_HSPWMC_BIT(PWMC_BKR, PWMCBRK_OSSI_MSK)
#define HSPWMC_IdleInactiveOutput()     SET_HSPWMC_BIT(PWMC_BKR, PWMCBRK_OSSI_MSK)

#define PWMCBRK_LOCK_MSK                (BIT1 | BIT0)
#define PWMC_SetLockLevel(n)            MODIFY_REG(PWMC_BKR,  PWMCBRK_LOCK_MSK, ((n) << 0))
#define PWMC_SetUnLock()                PWMC_SetLockLevel(0)

#define HSPWMC_SetLockLevel(n)          MODIFY_HSPWMC(PWMC_BKR,  PWMCBRK_LOCK_MSK, ((n) << 0))
#define HSPWMC_SetUnLock()              HSPWMC_SetLockLevel(0)

#define PWMCOISR_OIS1_MSK               BIT0
#define PWMCOISR_OIS1N_MSK              BIT1
#define PWMCOISR_OIS2_MSK               BIT2
#define PWMCOISR_OIS2N_MSK              BIT3
#define PWMCOISR_OIS3_MSK               BIT4
#define PWMCOISR_OIS3N_MSK              BIT5
#define PWMCOISR_OIS4_MSK               BIT6
#define PWMCOISR_OIS4N_MSK              BIT7
#define PWMCCR3_OIS5_MSK                BIT0
#define PWMCCR3_OIS6_MSK                BIT2
#define PWMC_OC1PIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS1_MSK)
#define PWMC_OC1PIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS1_MSK)
#define PWMC_OC1NIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS1N_MSK)
#define PWMC_OC1NIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS1N_MSK)
#define PWMC_OC2PIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS2_MSK)
#define PWMC_OC2PIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS2_MSK)
#define PWMC_OC2NIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS2N_MSK)
#define PWMC_OC2NIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS2N_MSK)
#define PWMC_OC3PIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS3_MSK)
#define PWMC_OC3PIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS3_MSK)
#define PWMC_OC3NIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS3N_MSK)
#define PWMC_OC3NIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS3N_MSK)
#define PWMC_OC4PIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS4_MSK)
#define PWMC_OC4PIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS4_MSK)
#define PWMC_OC4NIdleLevelLow()         CLR_REG_BIT(PWMC_OISR, PWMCOISR_OIS4N_MSK)
#define PWMC_OC4NIdleLevelHigh()        SET_REG_BIT(PWMC_OISR, PWMCOISR_OIS4N_MSK)
#define PWMC_OC5PIdleLevelLow()         CLR_REG_BIT(PWMC_CR3, PWMCCR3_OIS5_MSK)
#define PWMC_OC5PIdleLevelHigh()        SET_REG_BIT(PWMC_CR3, PWMCCR3_OIS5_MSK)
#define PWMC_OC6PIdleLevelLow()         CLR_REG_BIT(PWMC_CR3, PWMCCR3_OIS6_MSK)
#define PWMC_OC6PIdleLevelHigh()        SET_REG_BIT(PWMC_CR3, PWMCCR3_OIS6_MSK)

#define HSPWMC_OC1PIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS1_MSK)
#define HSPWMC_OC1PIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS1_MSK)
#define HSPWMC_OC1NIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS1N_MSK)
#define HSPWMC_OC1NIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS1N_MSK)
#define HSPWMC_OC2PIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS2_MSK)
#define HSPWMC_OC2PIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS2_MSK)
#define HSPWMC_OC2NIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS2N_MSK)
#define HSPWMC_OC2NIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS2N_MSK)
#define HSPWMC_OC3PIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS3_MSK)
#define HSPWMC_OC3PIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS3_MSK)
#define HSPWMC_OC3NIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS3N_MSK)
#define HSPWMC_OC3NIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS3N_MSK)
#define HSPWMC_OC4PIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS4_MSK)
#define HSPWMC_OC4PIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS4_MSK)
#define HSPWMC_OC4NIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS4N_MSK)
#define HSPWMC_OC4NIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_OISR, PWMCOISR_OIS4N_MSK)
#define HSPWMC_OC5PIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_CR3, PWMCCR3_OIS5_MSK)
#define HSPWMC_OC5PIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_CR3, PWMCCR3_OIS5_MSK)
#define HSPWMC_OC6PIdleLevelLow()       CLR_HSPWMC_BIT(PWMC_CR3, PWMCCR3_OIS6_MSK)
#define HSPWMC_OC6PIdleLevelHigh()      SET_HSPWMC_BIT(PWMC_CR3, PWMCCR3_OIS6_MSK)

