fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMC_SetCounter(n)              (PWMC_CNTRH = HIBYTE(n), PWMC_CNTRL = LOBYTE(n))
#define PWMC_SetClockDivider(n)         (PWMC_PSCRH = HIBYTE(n), PWMC_PSCRL = LOBYTE(n))
#define PWMC_SetReload16(n)             (PWMC_ARRH = HIBYTE(n), PWMC_ARRL = LOBYTE(n))
#define PWMC_SetRepeatCounter(n)        (PWMC_RCRH = HIBYTE(n), PWMC_RCR = LOBYTE(n))

#define HSPWMC_SetCounter(n)            (WRITE_HSPWMC(PWMC_CNTRH, HIBYTE(n)), WRITE_HSPWMC(PWMC_CNTRL, LOBYTE(n)))
#define HSPWMC_SetClockDivider(n)       (WRITE_HSPWMC(PWMC_PSCRH, HIBYTE(n)), WRITE_HSPWMC(PWMC_PSCRL, LOBYTE(n)))
#define HSPWMC_SetReload16(n)           (WRITE_HSPWMC(PWMC_ARRH, HIBYTE(n)), WRITE_HSPWMC(PWMC_ARRL, LOBYTE(n)))
#define HSPWMC_SetRepeatCounter(n)      (WRITE_HSPWMC(PWMC_RCRH, HIBYTE(n)), WRITE_HSPWMC(PWMC_RCR, LOBYTE(n)))

#define PWMC_SetCCR1Value(n)            (PWMC_CCR1H = HIBYTE(n), PWMC_CCR1L = LOBYTE(n))
#define PWMC_SetCCR2Value(n)            (PWMC_CCR2H = HIBYTE(n), PWMC_CCR2L = LOBYTE(n))
#define PWMC_SetCCR3Value(n)            (PWMC_CCR3H = HIBYTE(n), PWMC_CCR3L = LOBYTE(n))
#define PWMC_SetCCR4Value(n)            (PWMC_CCR4H = HIBYTE(n), PWMC_CCR4L = LOBYTE(n))
#define PWMC_SetCCR5Value(n)            (PWMC_CCR5H = HIBYTE(n), PWMC_CCR5L = LOBYTE(n))
#define PWMC_SetCCR6Value(n)            (PWMC_CCR6H = HIBYTE(n), PWMC_CCR6L = LOBYTE(n))

#define HSPWMC_SetCCR1Value(n)          (WRITE_HSPWMC(PWMC_CCR1H, HIBYTE(n)), WRITE_HSPWMC(PWMC_CCR1L, LOBYTE(n)))
#define HSPWMC_SetCCR2Value(n)          (WRITE_HSPWMC(PWMC_CCR2H, HIBYTE(n)), WRITE_HSPWMC(PWMC_CCR2L, LOBYTE(n)))
#define HSPWMC_SetCCR3Value(n)          (WRITE_HSPWMC(PWMC_CCR3H, HIBYTE(n)), WRITE_HSPWMC(PWMC_CCR3L, LOBYTE(n)))
#define HSPWMC_SetCCR4Value(n)          (WRITE_HSPWMC(PWMC_CCR4H, HIBYTE(n)), WRITE_HSPWMC(PWMC_CCR4L, LOBYTE(n)))
#define HSPWMC_SetCCR5Value(n)          (WRITE_HSPWMC(PWMC_CCR5H, HIBYTE(n)), WRITE_HSPWMC(PWMC_CCR5L, LOBYTE(n)))
#define HSPWMC_SetCCR6Value(n)          (WRITE_HSPWMC(PWMC_CCR6H, HIBYTE(n)), WRITE_HSPWMC(PWMC_CCR6L, LOBYTE(n)))

#define PWMC_ReadReload16()             MAKEWORD(PWMC_ARRL, PWMC_ARRH)

#define HSPWMC_ReadReload16()           MAKEWORD(READ_HSPWMC(PWMC_ARRL), READ_HSPWMC(PWMC_ARRH))

#define PWMC_ReadCCR1Value()            MAKEWORD(PWMC_CCR1L, PWMC_CCR1H)
#define PWMC_ReadCCR2Value()            MAKEWORD(PWMC_CCR2L, PWMC_CCR2H)
#define PWMC_ReadCCR3Value()            MAKEWORD(PWMC_CCR3L, PWMC_CCR3H)
#define PWMC_ReadCCR4Value()            MAKEWORD(PWMC_CCR4L, PWMC_CCR4H)
#define PWMC_ReadCCR5Value()            MAKEWORD(PWMC_CCR5L, PWMC_CCR5H)
#define PWMC_ReadCCR6Value()            MAKEWORD(PWMC_CCR6L, PWMC_CCR6H)

#define HSPWMC_ReadCCR1Value()          MAKEWORD(READ_HSPWMC(PWMC_CCR1L), READ_HSPWMC(PWMC_CCR1H))
#define HSPWMC_ReadCCR2Value()          MAKEWORD(READ_HSPWMC(PWMC_CCR2L), READ_HSPWMC(PWMC_CCR2H))
#define HSPWMC_ReadCCR3Value()          MAKEWORD(READ_HSPWMC(PWMC_CCR3L), READ_HSPWMC(PWMC_CCR3H))
#define HSPWMC_ReadCCR4Value()          MAKEWORD(READ_HSPWMC(PWMC_CCR4L), READ_HSPWMC(PWMC_CCR4H))
#define HSPWMC_ReadCCR5Value()          MAKEWORD(READ_HSPWMC(PWMC_CCR5L), READ_HSPWMC(PWMC_CCR5H))
#define HSPWMC_ReadCCR6Value()          MAKEWORD(READ_HSPWMC(PWMC_CCR6L), READ_HSPWMC(PWMC_CCR6H))

#define PWMC_SetDeadTime(n)             PWMC_DTR = LOBYTE(n)

#define HSPWMC_SetDeadTime(n)           WRITE_HSPWMC(PWMC_DTR, LOBYTE(n))

#define PWMCCCR5X_GC5C3_MSK             BIT7
#define PWMCCCR5X_GC5C2_MSK             BIT6
#define PWMCCCR5X_GC5C1_MSK             BIT5
#define PWMC_OC3REFCIndependent()       CLR_REG_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C3_MSK)
#define PWMC_OC2REFCIndependent()       CLR_REG_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C2_MSK)
#define PWMC_OC1REFCIndependent()       CLR_REG_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C1_MSK)
#define PWMC_OC3REFCAndWithOC5REF()     SET_REG_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C3_MSK)
#define PWMC_OC2REFCAndWithOC5REF()     SET_REG_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C2_MSK)
#define PWMC_OC1REFCAndWithOC5REF()     SET_REG_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C1_MSK)

#define HSPWMC_OC3REFCIndependent()     CLR_HSPWMC_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C3_MSK)
#define HSPWMC_OC2REFCIndependent()     CLR_HSPWMC_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C2_MSK)
#define HSPWMC_OC1REFCIndependent()     CLR_HSPWMC_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C1_MSK)
#define HSPWMC_OC3REFCAndWithOC5REF()   SET_HSPWMC_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C3_MSK)
#define HSPWMC_OC2REFCAndWithOC5REF()   SET_HSPWMC_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C2_MSK)
#define HSPWMC_OC1REFCAndWithOC5REF()   SET_HSPWMC_BIT(PWMC_CCR5X, PWMCCCR5X_GC5C1_MSK)

////////////////////////

#define PWMCDER_TDE_MSK                 BIT6
#define PWMCDER_COMDE_MSK               BIT5
#define PWMCDER_CC4DE_MSK               BIT4
#define PWMCDER_CC3DE_MSK               BIT3
#define PWMCDER_CC2DE_MSK               BIT2
#define PWMCDER_CC1DE_MSK               BIT1
#define PWMCDER_UDE_MSK                 BIT0
#define PWMC_TriggerIntAsDMAEvent()     SET_REG_BIT(PWMC_DER, PWMCDER_TDE_MSK)
#define PWMC_COMIntAsDMAEvent()         SET_REG_BIT(PWMC_DER, PWMCDER_COMDE_MSK)
#define PWMC_CC4IntAsDMAEvent()         SET_REG_BIT(PWMC_DER, PWMCDER_CC4DE_MSK)
#define PWMC_CC3IntAsDMAEvent()         SET_REG_BIT(PWMC_DER, PWMCDER_CC3DE_MSK)
#define PWMC_CC2IntAsDMAEvent()         SET_REG_BIT(PWMC_DER, PWMCDER_CC2DE_MSK)
#define PWMC_CC1IntAsDMAEvent()         SET_REG_BIT(PWMC_DER, PWMCDER_CC1DE_MSK)
#define PWMC_UpdateIntAsDMAEvent()      SET_REG_BIT(PWMC_DER, PWMCDER_UDE_MSK)

#define HSPWMC_TriggerIntAsDMAEvent()   SET_HSPWMC_BIT(PWMC_DER, PWMCDER_TDE_MSK)
#define HSPWMC_COMIntAsDMAEvent()       SET_HSPWMC_BIT(PWMC_DER, PWMCDER_COMDE_MSK)
#define HSPWMC_CC4IntAsDMAEvent()       SET_HSPWMC_BIT(PWMC_DER, PWMCDER_CC4DE_MSK)
#define HSPWMC_CC3IntAsDMAEvent()       SET_HSPWMC_BIT(PWMC_DER, PWMCDER_CC3DE_MSK)
#define HSPWMC_CC2IntAsDMAEvent()       SET_HSPWMC_BIT(PWMC_DER, PWMCDER_CC2DE_MSK)
#define HSPWMC_CC1IntAsDMAEvent()       SET_HSPWMC_BIT(PWMC_DER, PWMCDER_CC1DE_MSK)
#define HSPWMC_UpdateIntAsDMAEvent()    SET_HSPWMC_BIT(PWMC_DER, PWMCDER_UDE_MSK)

#define PWMCDBA_DBA_MSK                 (BIT4 | BIT_LN)
#define PWMC_SetDMABaseAddress(d)       MODIFY_REG(PWMC_DBA,  PWMCDBA_DBA_MSK, ((d) << 0))

