fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMC_SetDMABaseAddress(d)     MODIFY_HSPWMC(PWMC_DBA,  PWMCDBA_DBA_MSK, ((d) << 0))

#define PWMCDBL_DBL_MSK                 (BIT4 | BIT_LN)
#define PWMC_SetDMABurstCount(d)        MODIFY_REG(PWMC_DBL,  PWMCDBL_DBL_MSK, ((d) << 0))

#define HSPWMC_SetDMABurstCount(d)      MODIFY_HSPWMC(PWMC_DBL,  PWMCDBL_DBL_MSK, ((d) << 0))

#define PWMCDMACR_SIZE_MSK              (BIT1 | BIT0)
#define PWMC_SetDMABurstBytes(n)        MODIFY_REG(PWMC_DMACR,  PWMCDMACR_SIZE_MSK, ((n) << 0))
#define PWMC_SetDMABurst1Byte()         PWMC_SetDMABurstBytes(0)
#define PWMC_SetDMABurst2Bytes()        PWMC_SetDMABurstBytes(1)
#define PWMC_SetDMABurst3Bytes()        PWMC_SetDMABurstBytes(2)
#define PWMC_SetDMABurst4Bytes()        PWMC_SetDMABurstBytes(3)

#define HSPWMC_SetDMABurstBytes(n)      MODIFY_HSPWMC(PWMC_DMACR,  PWMCDMACR_SIZE_MSK, ((n) << 0))
#define HSPWMC_SetDMABurst1Byte()       HSPWMC_SetDMABurstBytes(0)
#define HSPWMC_SetDMABurst2Bytes()      HSPWMC_SetDMABurstBytes(1)
#define HSPWMC_SetDMABurst3Bytes()      HSPWMC_SetDMABurstBytes(2)
#define HSPWMC_SetDMABurst4Bytes()      HSPWMC_SetDMABurstBytes(3)

#define PWMCDMACR_DSKIP_MSK             BIT4
#define PWMC_DMASkipSpace()             SET_REG_BIT(PWMC_DMACR, PWMCDMACR_DSKIP_MSK)
#define PWMC_DMANeverSkipSpace()        CLR_REG_BIT(PWMC_DMACR, PWMCDMACR_DSKIP_MSK)

#define HSPWMC_DMASkipSpace()           SET_HSPWMC_BIT(PWMC_DMACR, PWMCDMACR_DSKIP_MSK)
#define HSPWMC_DMANeverSkipSpace()      CLR_HSPWMC_BIT(PWMC_DMACR, PWMCDMACR_DSKIP_MSK)

#define PWMCDMACR_DDIR_MSK              BIT3
#define PWMC_SetDMAOutput()             CLR_REG_BIT(PWMC_DMACR, PWMCDMACR_DDIR_MSK)
#define PWMC_SetDMAInput()              SET_REG_BIT(PWMC_DMACR, PWMCDMACR_DDIR_MSK)

#define HSPWMC_SetDMAOutput()           CLR_HSPWMC_BIT(PWMC_DMACR, PWMCDMACR_DDIR_MSK)
#define HSPWMC_SetDMAInput()            SET_HSPWMC_BIT(PWMC_DMACR, PWMCDMACR_DDIR_MSK)

#define PWMCDMACR_DMAEN_MSK             BIT2
#define PWMC_EnableDMA()                SET_REG_BIT(PWMC_DMACR, PWMCDMACR_DMAEN_MSK)
#define PWMC_DisableDMA()               CLR_REG_BIT(PWMC_DMACR, PWMCDMACR_DMAEN_MSK)

#define HSPWMC_EnableDMA()              SET_HSPWMC_BIT(PWMC_DMACR, PWMCDMACR_DMAEN_MSK)
#define HSPWMC_DisableDMA()             CLR_HSPWMC_BIT(PWMC_DMACR, PWMCDMACR_DMAEN_MSK)

////////////////////////

#define PWMDENO_ENO5P_MSK               BIT0
#define PWMDENO_ENO6P_MSK               BIT2
#define PWMDENO_ENO7P_MSK               BIT4
#define PWMDENO_ENO8P_MSK               BIT6
#define PWMD_EnablePWM5POutput()        SET_REG_BIT(PWMD_ENO, PWMDENO_ENO5P_MSK)
#define PWMD_DisablePWM5POutput()       CLR_REG_BIT(PWMD_ENO, PWMDENO_ENO5P_MSK)
#define PWMD_EnablePWM6POutput()        SET_REG_BIT(PWMD_ENO, PWMDENO_ENO6P_MSK)
#define PWMD_DisablePWM6POutput()       CLR_REG_BIT(PWMD_ENO, PWMDENO_ENO6P_MSK)
#define PWMD_EnablePWM7POutput()        SET_REG_BIT(PWMD_ENO, PWMDENO_ENO7P_MSK)
#define PWMD_DisablePWM7POutput()       CLR_REG_BIT(PWMD_ENO, PWMDENO_ENO7P_MSK)
#define PWMD_EnablePWM8POutput()        SET_REG_BIT(PWMD_ENO, PWMDENO_ENO8P_MSK)
#define PWMD_DisablePWM8POutput()       CLR_REG_BIT(PWMD_ENO, PWMDENO_ENO8P_MSK)

#define HSPWMD_EnablePWM5POutput()      SET_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO5P_MSK)
#define HSPWMD_DisablePWM5POutput()     CLR_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO5P_MSK)
#define HSPWMD_EnablePWM6POutput()      SET_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO6P_MSK)
#define HSPWMD_DisablePWM6POutput()     CLR_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO6P_MSK)
#define HSPWMD_EnablePWM7POutput()      SET_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO7P_MSK)
#define HSPWMD_DisablePWM7POutput()     CLR_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO7P_MSK)
#define HSPWMD_EnablePWM8POutput()      SET_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO8P_MSK)
#define HSPWMD_DisablePWM8POutput()     CLR_HSPWMD_BIT(PWMD_ENO, PWMDENO_ENO8P_MSK)

#define PWMDIOAUX_AUX5P_MSK             BIT0
#define PWMDIOAUX_AUX6P_MSK             BIT2
#define PWMDIOAUX_AUX7P_MSK             BIT4
#define PWMDIOAUX_AUX8P_MSK             BIT6
#define PWMD_EnoCtrlPWM5P()             CLR_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX5P_MSK)
#define PWMD_EnoBrkCtrlPWM5P()          SET_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX5P_MSK)
#define PWMD_EnoCtrlPWM6P()             CLR_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX6P_MSK)
#define PWMD_EnoBrkCtrlPWM6P()          SET_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX6P_MSK)
#define PWMD_EnoCtrlPWM7P()             CLR_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX7P_MSK)
#define PWMD_EnoBrkCtrlPWM7P()          SET_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX7P_MSK)
#define PWMD_EnoCtrlPWM8P()             CLR_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX8P_MSK)
#define PWMD_EnoBrkCtrlPWM8P()          SET_REG_BIT(PWMD_IOAUX, PWMDIOAUX_AUX8P_MSK)

#define HSPWMD_EnoCtrlPWM5P()           CLR_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX5P_MSK)
#define HSPWMD_EnoBrkCtrlPWM5P()        SET_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX5P_MSK)
#define HSPWMD_EnoCtrlPWM6P()           CLR_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX6P_MSK)
#define HSPWMD_EnoBrkCtrlPWM6P()        SET_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX6P_MSK)
#define HSPWMD_EnoCtrlPWM7P()           CLR_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX7P_MSK)
#define HSPWMD_EnoBrkCtrlPWM7P()        SET_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX7P_MSK)
#define HSPWMD_EnoCtrlPWM8P()           CLR_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX8P_MSK)
#define HSPWMD_EnoBrkCtrlPWM8P()        SET_HSPWMD_BIT(PWMD_IOAUX, PWMDIOAUX_AUX8P_MSK)

#define PWMDCR1_ARPE_MSK                BIT7
#define PWMD_UnbufferARR()              CLR_REG_BIT(PWMD_CR1, PWMDCR1_ARPE_MSK)
#define PWMD_BufferARR()                SET_REG_BIT(PWMD_CR1, PWMDCR1_ARPE_MSK)

#define HSPWMD_UnbufferARR()            CLR_HSPWMD_BIT(PWMD_CR1, PWMDCR1_ARPE_MSK)
#define HSPWMD_BufferARR()              SET_HSPWMD_BIT(PWMD_CR1, PWMDCR1_ARPE_MSK)

#define PWMDCR1_CMS_MSK                 (BIT6 | BIT5)
#define PWMD_SetAlignMode(n)            MODIFY_REG(PWMD_CR1,  PWMDCR1_CMS_MSK, ((n) << 5))
#define PWMD_EdgeAlignMode()            PWMD_SetAlignMode(0)
#define PWMD_CenterAlignMode1()         PWMD_SetAlignMode(1)
#define PWMD_CenterAlignMode2()         PWMD_SetAlignMode(2)
#define PWMD_CenterAlignMode3()         PWMD_SetAlignMode(3)

#define HSPWMD_SetAlignMode(n)          MODIFY_HSPWMD(PWMD_CR1,  PWMDCR1_CMS_MSK, ((n) << 5))
#define HSPWMD_EdgeAlignMode()          HSPWMD_SetAlignMode(0)
#define HSPWMD_CenterAlignMode1()       HSPWMD_SetAlignMode(1)
#define HSPWMD_CenterAlignMode2()       HSPWMD_SetAlignMode(2)
#define HSPWMD_CenterAlignMode3()       HSPWMD_SetAlignMode(3)

#define PWMDCR1_DIR_MSK                 BIT4
#define PWMD_UpCounter()                CLR_REG_BIT(PWMD_CR1, PWMDCR1_DIR_MSK)
#define PWMD_DownCounter()              SET_REG_BIT(PWMD_CR1, PWMDCR1_DIR_MSK)

#define HSPWMD_UpCounter()              CLR_HSPWMD_BIT(PWMD_CR1, PWMDCR1_DIR_MSK)
#define HSPWMD_DownCounter()            SET_HSPWMD_BIT(PWMD_CR1, PWMDCR1_DIR_MSK)

#define PWMDCR1_OPM_MSK                 BIT3
#define PWMD_ContinueMode()             CLR_REG_BIT(PWMD_CR1, PWMDCR1_OPM_MSK)
#define PWMD_OnePulseMode()             SET_REG_BIT(PWMD_CR1, PWMDCR1_OPM_MSK)

#define HSPWMD_ContinueMode()           CLR_HSPWMD_BIT(PWMD_CR1, PWMDCR1_OPM_MSK)
#define HSPWMD_OnePulseMode()           SET_HSPWMD_BIT(PWMD_CR1, PWMDCR1_OPM_MSK)

#define PWMDCR1_URS_MSK                 BIT2
#define PWMD_UpdateRequestMode1()       SET_REG_BIT(PWMD_CR1, PWMDCR1_URS_MSK)
#define PWMD_UpdateRequestMode2()       CLR_REG_BIT(PWMD_CR1, PWMDCR1_URS_MSK)

#define HSPWMD_UpdateRequestMode1()     SET_HSPWMD_BIT(PWMD_CR1, PWMDCR1_URS_MSK)
#define HSPWMD_UpdateRequestMode2()     CLR_HSPWMD_BIT(PWMD_CR1, PWMDCR1_URS_MSK)

#define PWMDCR1_UDIS_MSK                BIT1
#define PWMD_EnableUpdate()             CLR_REG_BIT(PWMD_CR1, PWMDCR1_UDIS_MSK)
#define PWMD_DisableUpdate()            SET_REG_BIT(PWMD_CR1, PWMDCR1_UDIS_MSK)

