fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMD_EnableUpdate()           CLR_HSPWMD_BIT(PWMD_CR1, PWMDCR1_UDIS_MSK)
#define HSPWMD_DisableUpdate()          SET_HSPWMD_BIT(PWMD_CR1, PWMDCR1_UDIS_MSK)

#define PWMDCR1_CEN_MSK                 BIT0
#define PWMD_Run()                      SET_REG_BIT(PWMD_CR1, PWMDCR1_CEN_MSK)
#define PWMD_Stop()                     CLR_REG_BIT(PWMD_CR1, PWMDCR1_CEN_MSK)

#define HSPWMD_Run()                    SET_HSPWMD_BIT(PWMD_CR1, PWMDCR1_CEN_MSK)
#define HSPWMD_Stop()                   CLR_HSPWMD_BIT(PWMD_CR1, PWMDCR1_CEN_MSK)

#define PWMDCR2_TIS_MSK                 BIT7
#define PWMD_PWM5PToTI()                CLR_REG_BIT(PWMD_CR2, PWMDCR2_TIS_MSK)
#define PWMD_Xor5P6P7PToTI()            SET_REG_BIT(PWMD_CR2, PWMDCR2_TIS_MSK)

#define HSPWMD_PWM5PToTI()              CLR_HSPWMD_BIT(PWMD_CR2, PWMDCR2_TIS_MSK)
#define HSPWMD_Xor5P6P7PToTI()          SET_HSPWMD_BIT(PWMD_CR2, PWMDCR2_TIS_MSK)

#define PWMDCR2_MMS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMD_SelectTRGO(n)              MODIFY_REG(PWMD_CR2,  PWMDCR2_MMS_MSK, ((n) << 4))
#define PWMD_ResetAsTRGO()              PWMD_SelectTRGO(0)
#define PWMD_EnableAsTRGO()             PWMD_SelectTRGO(1)
#define PWMD_UpdateAsTRGO()             PWMD_SelectTRGO(2)
#define PWMD_MatchAsTRGO()              PWMD_SelectTRGO(3)
#define PWMD_OC5REFAsTRGO()             PWMD_SelectTRGO(4)
#define PWMD_OC6REFAsTRGO()             PWMD_SelectTRGO(5)
#define PWMD_OC7REFAsTRGO()             PWMD_SelectTRGO(6)
#define PWMD_OC8REFAsTRGO()             PWMD_SelectTRGO(7)

#define HSPWMD_SelectTRGO(n)            MODIFY_HSPWMD(PWMD_CR2,  PWMDCR2_MMS_MSK, ((n) << 4))
#define HSPWMD_ResetAsTRGO()            HSPWMD_SelectTRGO(0)
#define HSPWMD_EnableAsTRGO()           HSPWMD_SelectTRGO(1)
#define HSPWMD_UpdateAsTRGO()           HSPWMD_SelectTRGO(2)
#define HSPWMD_MatchAsTRGO()            HSPWMD_SelectTRGO(3)
#define HSPWMD_OC5REFAsTRGO()           HSPWMD_SelectTRGO(4)
#define HSPWMD_OC6REFAsTRGO()           HSPWMD_SelectTRGO(5)
#define HSPWMD_OC7REFAsTRGO()           HSPWMD_SelectTRGO(6)
#define HSPWMD_OC8REFAsTRGO()           HSPWMD_SelectTRGO(7)

#define PWMDCR2_COMS_MSK                BIT2
#define PWMD_CCOCUpdateMode0()          CLR_REG_BIT(PWMD_CR2, PWMDCR2_COMS_MSK)
#define PWMD_CCOCUpdateMode1()          SET_REG_BIT(PWMD_CR2, PWMDCR2_COMS_MSK)

#define HSPWMD_CCOCUpdateMode0()        CLR_HSPWMD_BIT(PWMD_CR2, PWMDCR2_COMS_MSK)
#define HSPWMD_CCOCUpdateMode1()        SET_HSPWMD_BIT(PWMD_CR2, PWMDCR2_COMS_MSK)

#define PWMDCR2_CCPC_MSK                BIT0
#define PWMD_UnbufferCCOC()             CLR_REG_BIT(PWMD_CR2, PWMDCR2_CCPC_MSK)
#define PWMD_BufferCCOC()               SET_REG_BIT(PWMD_CR2, PWMDCR2_CCPC_MSK)

#define HSPWMD_UnbufferCCOC()           CLR_HSPWMD_BIT(PWMD_CR2, PWMDCR2_CCPC_MSK)
#define HSPWMD_BufferCCOC()             SET_HSPWMD_BIT(PWMD_CR2, PWMDCR2_CCPC_MSK)

#define PWMDSMCR_MSM_MSK                BIT7
#define PWMD_StandaloneMode()           CLR_REG_BIT(PWMD_SMCR, PWMDSMCR_MSM_MSK)
#define PWMD_MasterSlaveMode()          SET_REG_BIT(PWMD_SMCR, PWMDSMCR_MSM_MSK)

#define HSPWMD_StandaloneMode()         CLR_HSPWMD_BIT(PWMD_SMCR, PWMDSMCR_MSM_MSK)
#define HSPWMD_MasterSlaveMode()        SET_HSPWMD_BIT(PWMD_SMCR, PWMDSMCR_MSM_MSK)

#define PWMDSMCR_TS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMD_SelectTRGI(n)              MODIFY_REG(PWMD_SMCR,  PWMDSMCR_TS_MSK, ((n) << 4))
#define PWMD_DisableTRGI()              PWMD_SelectTRGI(0)
#define PWMD_TI5FEDAsTRGI()             PWMD_SelectTRGI(4)
#define PWMD_TI5FP5AsTRGI()             PWMD_SelectTRGI(5)
#define PWMD_TI6FP6AsTRGI()             PWMD_SelectTRGI(6)
#define PWMD_ETRFAsTRGI()               PWMD_SelectTRGI(7)

#define HSPWMD_SelectTRGI(n)            MODIFY_HSPWMD(PWMD_SMCR,  PWMDSMCR_TS_MSK, ((n) << 4))
#define HSPWMD_DisableTRGI()            HSPWMD_SelectTRGI(0)
#define HSPWMD_TI5FEDAsTRGI()           HSPWMD_SelectTRGI(4)
#define HSPWMD_TI5FP5AsTRGI()           HSPWMD_SelectTRGI(5)
#define HSPWMD_TI6FP6AsTRGI()           HSPWMD_SelectTRGI(6)
#define HSPWMD_ETRFAsTRGI()             HSPWMD_SelectTRGI(7)

#define PWMDSMCR_SMS_MSK                (BIT2 | BIT1 | BIT0)
#define PWMD_SetClockMode(n)            MODIFY_REG(PWMD_SMCR,  PWMDSMCR_SMS_MSK, ((n) << 0))
#define PWMD_InternalClockMode()        PWMD_SetClockMode(0)
#define PWMD_EncoderMode1()             PWMD_SetClockMode(1)
#define PWMD_EncoderMode2()             PWMD_SetClockMode(2)
#define PWMD_EncoderMode3()             PWMD_SetClockMode(3)
#define PWMD_TriggerResetMode()         PWMD_SetClockMode(4)
#define PWMD_TriggerGateMode()          PWMD_SetClockMode(5)
#define PWMD_TriggerStartMode()         PWMD_SetClockMode(6)
#define PWMD_ExternalClockMode()        PWMD_SetClockMode(7)

#define HSPWMD_SetClockMode(n)          MODIFY_HSPWMD(PWMD_SMCR,  PWMDSMCR_SMS_MSK, ((n) << 0))
#define HSPWMD_InternalClockMode()      HSPWMD_SetClockMode(0)
#define HSPWMD_EncoderMode1()           HSPWMD_SetClockMode(1)
#define HSPWMD_EncoderMode2()           HSPWMD_SetClockMode(2)
#define HSPWMD_EncoderMode3()           HSPWMD_SetClockMode(3)
#define HSPWMD_TriggerResetMode()       HSPWMD_SetClockMode(4)
#define HSPWMD_TriggerGateMode()        HSPWMD_SetClockMode(5)
#define HSPWMD_TriggerStartMode()       HSPWMD_SetClockMode(6)
#define HSPWMD_ExternalClockMode()      HSPWMD_SetClockMode(7)

#define PWMDETR_ETP_MSK                 BIT7
#define PWMD_ETRNonInverted()           CLR_REG_BIT(PWMD_ETR, PWMDETR_ETP_MSK)
#define PWMD_ETRInverted()              SET_REG_BIT(PWMD_ETR, PWMDETR_ETP_MSK)

#define HSPWMD_ETRNonInverted()         CLR_HSPWMD_BIT(PWMD_ETR, PWMDETR_ETP_MSK)
#define HSPWMD_ETRInverted()            SET_HSPWMD_BIT(PWMD_ETR, PWMDETR_ETP_MSK)

#define PWMDETR_ECE_MSK                 BIT6
#define PWMD_DisableExternalClock2()    CLR_REG_BIT(PWMD_ETR, PWMDETR_ECE_MSK)
#define PWMD_EnableExternalClock2()     SET_REG_BIT(PWMD_ETR, PWMDETR_ECE_MSK)

#define HSPWMD_DisableExternalClock2()  CLR_HSPWMD_BIT(PWMD_ETR, PWMDETR_ECE_MSK)
#define HSPWMD_EnableExternalClock2()   SET_HSPWMD_BIT(PWMD_ETR, PWMDETR_ECE_MSK)

