fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMDETR_ETPS_MSK                (BIT5 | BIT4)
#define PWMD_SetETRDivider(n)           MODIFY_REG(PWMD_ETR,  PWMDETR_ETPS_MSK, ((n) << 4))
#define PWMD_ETRDivider1()              PWMD_SetETRDivider(0)
#define PWMD_ETRDivider2()              PWMD_SetETRDivider(1)
#define PWMD_ETRDivider4()              PWMD_SetETRDivider(2)
#define PWMD_ETRDivider8()              PWMD_SetETRDivider(3)

#define HSPWMD_SetETRDivider(n)         MODIFY_HSPWMD(PWMD_ETR,  PWMDETR_ETPS_MSK, ((n) << 4))
#define HSPWMD_ETRDivider1()            HSPWMD_SetETRDivider(0)
#define HSPWMD_ETRDivider2()            HSPWMD_SetETRDivider(1)
#define HSPWMD_ETRDivider4()            HSPWMD_SetETRDivider(2)
#define HSPWMD_ETRDivider8()            HSPWMD_SetETRDivider(3)

#define PWMDETR_ETF_MSK                 (BIT_LN)
#define PWMD_SetETRFilter(n)            MODIFY_REG(PWMD_ETR,  PWMDETR_ETF_MSK, ((n) << 0))
#define PWMD_ETRFilter1()               PWMD_SetETRFilter(0)
#define PWMD_ETRFilter2()               PWMD_SetETRFilter(1)
#define PWMD_ETRFilter4()               PWMD_SetETRFilter(2)
#define PWMD_ETRFilter8()               PWMD_SetETRFilter(3)
#define PWMD_ETRFilter12()              PWMD_SetETRFilter(4)
#define PWMD_ETRFilter16()              PWMD_SetETRFilter(5)
#define PWMD_ETRFilter24()              PWMD_SetETRFilter(6)
#define PWMD_ETRFilter32()              PWMD_SetETRFilter(7)
#define PWMD_ETRFilter48()              PWMD_SetETRFilter(8)
#define PWMD_ETRFilter64()              PWMD_SetETRFilter(9)
#define PWMD_ETRFilter80()              PWMD_SetETRFilter(10)
#define PWMD_ETRFilter96()              PWMD_SetETRFilter(11)
#define PWMD_ETRFilter128()             PWMD_SetETRFilter(12)
#define PWMD_ETRFilter160()             PWMD_SetETRFilter(13)
#define PWMD_ETRFilter192()             PWMD_SetETRFilter(14)
#define PWMD_ETRFilter256()             PWMD_SetETRFilter(15)

#define HSPWMD_SetETRFilter(n)          MODIFY_HSPWMD(PWMD_ETR,  PWMDETR_ETF_MSK, ((n) << 0))
#define HSPWMD_ETRFilter1()             HSPWMD_SetETRFilter(0)
#define HSPWMD_ETRFilter2()             HSPWMD_SetETRFilter(1)
#define HSPWMD_ETRFilter4()             HSPWMD_SetETRFilter(2)
#define HSPWMD_ETRFilter8()             HSPWMD_SetETRFilter(3)
#define HSPWMD_ETRFilter12()            HSPWMD_SetETRFilter(4)
#define HSPWMD_ETRFilter16()            HSPWMD_SetETRFilter(5)
#define HSPWMD_ETRFilter24()            HSPWMD_SetETRFilter(6)
#define HSPWMD_ETRFilter32()            HSPWMD_SetETRFilter(7)
#define HSPWMD_ETRFilter48()            HSPWMD_SetETRFilter(8)
#define HSPWMD_ETRFilter64()            HSPWMD_SetETRFilter(9)
#define HSPWMD_ETRFilter80()            HSPWMD_SetETRFilter(10)
#define HSPWMD_ETRFilter96()            HSPWMD_SetETRFilter(11)
#define HSPWMD_ETRFilter128()           HSPWMD_SetETRFilter(12)
#define HSPWMD_ETRFilter160()           HSPWMD_SetETRFilter(13)
#define HSPWMD_ETRFilter192()           HSPWMD_SetETRFilter(14)
#define HSPWMD_ETRFilter256()           HSPWMD_SetETRFilter(15)

#define PWMDEGR_BG_MSK                  BIT7
#define PWMDEGR_TG_MSK                  BIT6
#define PWMDEGR_COMG_MSK                BIT5
#define PWMDEGR_CC8G_MSK                BIT4
#define PWMDEGR_CC7G_MSK                BIT3
#define PWMDEGR_CC6G_MSK                BIT2
#define PWMDEGR_CC5G_MSK                BIT1
#define PWMDEGR_UG_MSK                  BIT0
#define PWMD_GenerateBreakEvent()       SET_REG_BIT(PWMD_EGR, PWMDEGR_BG_MSK)
#define PWMD_GenerateTriggerEvent()     SET_REG_BIT(PWMD_EGR, PWMDEGR_TG_MSK)
#define PWMD_GenerateCOMEvent()         SET_REG_BIT(PWMD_EGR, PWMDEGR_COMG_MSK)
#define PWMD_GenerateCC8Event()         SET_REG_BIT(PWMD_EGR, PWMDEGR_CC8G_MSK)
#define PWMD_GenerateCC7Event()         SET_REG_BIT(PWMD_EGR, PWMDEGR_CC7G_MSK)
#define PWMD_GenerateCC6Event()         SET_REG_BIT(PWMD_EGR, PWMDEGR_CC6G_MSK)
#define PWMD_GenerateCC5Event()         SET_REG_BIT(PWMD_EGR, PWMDEGR_CC5G_MSK)
#define PWMD_GenerateUpdateEvent()      SET_REG_BIT(PWMD_EGR, PWMDEGR_UG_MSK)

#define HSPWMD_GenerateBreakEvent()     SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_BG_MSK)
#define HSPWMD_GenerateTriggerEvent()   SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_TG_MSK)
#define HSPWMD_GenerateCOMEvent()       SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_COMG_MSK)
#define HSPWMD_GenerateCC8Event()       SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_CC8G_MSK)
#define HSPWMD_GenerateCC7Event()       SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_CC7G_MSK)
#define HSPWMD_GenerateCC6Event()       SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_CC6G_MSK)
#define HSPWMD_GenerateCC5Event()       SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_CC5G_MSK)
#define HSPWMD_GenerateUpdateEvent()    SET_HSPWMD_BIT(PWMD_EGR, PWMDEGR_UG_MSK)

#define PWMDCCMR1_OC5CE_MSK             BIT7
#define PWMD_EnableETRFClearOC5REF()    SET_REG_BIT(PWMD_CCMR1, PWMDCCMR1_OC5CE_MSK)
#define PWMD_DisableETRFClearOC5REF()   CLR_REG_BIT(PWMD_CCMR1, PWMDCCMR1_OC5CE_MSK)

#define HSPWMD_EnableETRFClearOC5REF()  SET_HSPWMD_BIT(PWMD_CCMR1, PWMDCCMR1_OC5CE_MSK)
#define HSPWMD_DisableETRFClearOC5REF() CLR_HSPWMD_BIT(PWMD_CCMR1, PWMDCCMR1_OC5CE_MSK)

#define PWMDCCMR1_OC5M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMD_SetOC5OutputMode(n)        MODIFY_REG(PWMD_CCMR1,  PWMDCCMR1_OC5M_MSK, ((n) << 4))
#define PWMD_OC5REFFrozen()             PWMD_SetOC5OutputMode(0)
#define PWMD_OC5REFHighIfMatch()        PWMD_SetOC5OutputMode(1)
#define PWMD_OC5REFLowIfMatch()         PWMD_SetOC5OutputMode(2)
#define PWMD_OC5REFToggleIfMatch()      PWMD_SetOC5OutputMode(3)
#define PWMD_OC5REFForceLow()           PWMD_SetOC5OutputMode(4)
#define PWMD_OC5REFForceHigh()          PWMD_SetOC5OutputMode(5)
#define PWMD_OC5REFPWMMode1()           PWMD_SetOC5OutputMode(6)
#define PWMD_OC5REFPWMMode2()           PWMD_SetOC5OutputMode(7)

#define HSPWMD_SetOC5OutputMode(n)      MODIFY_HSPWMD(PWMD_CCMR1,  PWMDCCMR1_OC5M_MSK, ((n) << 4))
#define HSPWMD_OC5REFFrozen()           HSPWMD_SetOC5OutputMode(0)
#define HSPWMD_OC5REFHighIfMatch()      HSPWMD_SetOC5OutputMode(1)
#define HSPWMD_OC5REFLowIfMatch()       HSPWMD_SetOC5OutputMode(2)
#define HSPWMD_OC5REFToggleIfMatch()    HSPWMD_SetOC5OutputMode(3)
#define HSPWMD_OC5REFForceLow()         HSPWMD_SetOC5OutputMode(4)
#define HSPWMD_OC5REFForceHigh()        HSPWMD_SetOC5OutputMode(5)
#define HSPWMD_OC5REFPWMMode1()         HSPWMD_SetOC5OutputMode(6)
#define HSPWMD_OC5REFPWMMode2()         HSPWMD_SetOC5OutputMode(7)

#define PWMDCCMR1_OC5PE_MSK             BIT3
#define PWMD_UnbufferCCR5()             CLR_REG_BIT(PWMD_CCMR1, PWMDCCMR1_OC5PE_MSK)
#define PWMD_BufferCCR5()               SET_REG_BIT(PWMD_CCMR1, PWMDCCMR1_OC5PE_MSK)

#define HSPWMD_UnbufferCCR5()           CLR_HSPWMD_BIT(PWMD_CCMR1, PWMDCCMR1_OC5PE_MSK)
#define HSPWMD_BufferCCR5()             SET_HSPWMD_BIT(PWMD_CCMR1, PWMDCCMR1_OC5PE_MSK)

#define PWMDCCMR1_OC5FE_MSK             BIT2
#define PWMD_DisableOC5FastMode()       CLR_REG_BIT(PWMD_CCMR1, PWMDCCMR1_OC5FE_MSK)
#define PWMD_EnableOC5FastMode()        SET_REG_BIT(PWMD_CCMR1, PWMDCCMR1_OC5FE_MSK)

