fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMD_DisableOC5FastMode()     CLR_HSPWMD_BIT(PWMD_CCMR1, PWMDCCMR1_OC5FE_MSK)
#define HSPWMD_EnableOC5FastMode()      SET_HSPWMD_BIT(PWMD_CCMR1, PWMDCCMR1_OC5FE_MSK)

#define PWMDCCMR1_CC5S_MSK              (BIT1 | BIT0)
#define PWMD_SetCC5Mode(n)              MODIFY_REG(PWMD_CCMR1,  PWMDCCMR1_CC5S_MSK, ((n) << 0))
#define PWMD_CC5Output()                PWMD_SetCC5Mode(0)
#define PWMD_CC5CaptureTI5FP5()         PWMD_SetCC5Mode(1)
#define PWMD_CC5CaptureTI6FP5()         PWMD_SetCC5Mode(2)
#define PWMD_CC5CaptureTRC()            PWMD_SetCC5Mode(3)

#define HSPWMD_SetCC5Mode(n)            MODIFY_HSPWMD(PWMD_CCMR1,  PWMDCCMR1_CC5S_MSK, ((n) << 0))
#define HSPWMD_CC5Output()              HSPWMD_SetCC5Mode(0)
#define HSPWMD_CC5CaptureTI5FP5()       HSPWMD_SetCC5Mode(1)
#define HSPWMD_CC5CaptureTI6FP5()       HSPWMD_SetCC5Mode(2)
#define HSPWMD_CC5CaptureTRC()          HSPWMD_SetCC5Mode(3)

#define PWMDCCMR1_IC5F_MSK              (BIT_HN)
#define PWMD_SetIC5Filter(n)            MODIFY_REG(PWMD_CCMR1,  PWMDCCMR1_IC5F_MSK, ((n) << 4))
#define PWMD_IC5Filter1()               PWMD_SetIC5Filter(0)
#define PWMD_IC5Filter2()               PWMD_SetIC5Filter(1)
#define PWMD_IC5Filter4()               PWMD_SetIC5Filter(2)
#define PWMD_IC5Filter8()               PWMD_SetIC5Filter(3)
#define PWMD_IC5Filter12()              PWMD_SetIC5Filter(4)
#define PWMD_IC5Filter16()              PWMD_SetIC5Filter(5)
#define PWMD_IC5Filter24()              PWMD_SetIC5Filter(6)
#define PWMD_IC5Filter32()              PWMD_SetIC5Filter(7)
#define PWMD_IC5Filter48()              PWMD_SetIC5Filter(8)
#define PWMD_IC5Filter64()              PWMD_SetIC5Filter(9)
#define PWMD_IC5Filter80()              PWMD_SetIC5Filter(10)
#define PWMD_IC5Filter96()              PWMD_SetIC5Filter(11)
#define PWMD_IC5Filter128()             PWMD_SetIC5Filter(12)
#define PWMD_IC5Filter160()             PWMD_SetIC5Filter(13)
#define PWMD_IC5Filter192()             PWMD_SetIC5Filter(14)
#define PWMD_IC5Filter256()             PWMD_SetIC5Filter(15)

#define HSPWMD_SetIC5Filter(n)          MODIFY_HSPWMD(PWMD_CCMR1,  PWMDCCMR1_IC5F_MSK, ((n) << 4))
#define HSPWMD_IC5Filter1()             HSPWMD_SetIC5Filter(0)
#define HSPWMD_IC5Filter2()             HSPWMD_SetIC5Filter(1)
#define HSPWMD_IC5Filter4()             HSPWMD_SetIC5Filter(2)
#define HSPWMD_IC5Filter8()             HSPWMD_SetIC5Filter(3)
#define HSPWMD_IC5Filter12()            HSPWMD_SetIC5Filter(4)
#define HSPWMD_IC5Filter16()            HSPWMD_SetIC5Filter(5)
#define HSPWMD_IC5Filter24()            HSPWMD_SetIC5Filter(6)
#define HSPWMD_IC5Filter32()            HSPWMD_SetIC5Filter(7)
#define HSPWMD_IC5Filter48()            HSPWMD_SetIC5Filter(8)
#define HSPWMD_IC5Filter64()            HSPWMD_SetIC5Filter(9)
#define HSPWMD_IC5Filter80()            HSPWMD_SetIC5Filter(10)
#define HSPWMD_IC5Filter96()            HSPWMD_SetIC5Filter(11)
#define HSPWMD_IC5Filter128()           HSPWMD_SetIC5Filter(12)
#define HSPWMD_IC5Filter160()           HSPWMD_SetIC5Filter(13)
#define HSPWMD_IC5Filter192()           HSPWMD_SetIC5Filter(14)
#define HSPWMD_IC5Filter256()           HSPWMD_SetIC5Filter(15)

#define PWMDCCMR1_IC5PS_MSK             (BIT3 | BIT2)
#define PWMD_SetIC5Divider(n)           MODIFY_REG(PWMD_CCMR1,  PWMDCCMR1_IC5PS_MSK, ((n) << 2))
#define PWMD_IC5Divider1()              PWMD_SetIC5Divider(0)
#define PWMD_IC5Divider2()              PWMD_SetIC5Divider(1)
#define PWMD_IC5Divider4()              PWMD_SetIC5Divider(2)
#define PWMD_IC5Divider8()              PWMD_SetIC5Divider(3)

#define HSPWMD_SetIC5Divider(n)         MODIFY_HSPWMD(PWMD_CCMR1,  PWMDCCMR1_IC5PS_MSK, ((n) << 2))
#define HSPWMD_IC5Divider1()            HSPWMD_SetIC5Divider(0)
#define HSPWMD_IC5Divider2()            HSPWMD_SetIC5Divider(1)
#define HSPWMD_IC5Divider4()            HSPWMD_SetIC5Divider(2)
#define HSPWMD_IC5Divider8()            HSPWMD_SetIC5Divider(3)

#define PWMDCCMR2_OC6CE_MSK             BIT7
#define PWMD_EnableETRFClearOC6REF()    SET_REG_BIT(PWMD_CCMR2, PWMDCCMR2_OC6CE_MSK)
#define PWMD_DisableETRFClearOC6REF()   CLR_REG_BIT(PWMD_CCMR2, PWMDCCMR2_OC6CE_MSK)

#define HSPWMD_EnableETRFClearOC6REF()  SET_HSPWMD_BIT(PWMD_CCMR2, PWMDCCMR2_OC6CE_MSK)
#define HSPWMD_DisableETRFClearOC6REF() CLR_HSPWMD_BIT(PWMD_CCMR2, PWMDCCMR2_OC6CE_MSK)

#define PWMDCCMR2_OC6M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMD_SetOC6OutputMode(n)        MODIFY_REG(PWMD_CCMR2,  PWMDCCMR2_OC6M_MSK, ((n) << 4))
#define PWMD_OC6REFFrozen()             PWMD_SetOC6OutputMode(0)
#define PWMD_OC6REFHighIfMatch()        PWMD_SetOC6OutputMode(1)
#define PWMD_OC6REFLowIfMatch()         PWMD_SetOC6OutputMode(2)
#define PWMD_OC6REFToggleIfMatch()      PWMD_SetOC6OutputMode(3)
#define PWMD_OC6REFForceLow()           PWMD_SetOC6OutputMode(4)
#define PWMD_OC6REFForceHigh()          PWMD_SetOC6OutputMode(5)
#define PWMD_OC6REFPWMMode1()           PWMD_SetOC6OutputMode(6)
#define PWMD_OC6REFPWMMode2()           PWMD_SetOC6OutputMode(7)

#define HSPWMD_SetOC6OutputMode(n)      MODIFY_HSPWMD(PWMD_CCMR2,  PWMDCCMR2_OC6M_MSK, ((n) << 4))
#define HSPWMD_OC6REFFrozen()           HSPWMD_SetOC6OutputMode(0)
#define HSPWMD_OC6REFHighIfMatch()      HSPWMD_SetOC6OutputMode(1)
#define HSPWMD_OC6REFLowIfMatch()       HSPWMD_SetOC6OutputMode(2)
#define HSPWMD_OC6REFToggleIfMatch()    HSPWMD_SetOC6OutputMode(3)
#define HSPWMD_OC6REFForceLow()         HSPWMD_SetOC6OutputMode(4)
#define HSPWMD_OC6REFForceHigh()        HSPWMD_SetOC6OutputMode(5)
#define HSPWMD_OC6REFPWMMode1()         HSPWMD_SetOC6OutputMode(6)
#define HSPWMD_OC6REFPWMMode2()         HSPWMD_SetOC6OutputMode(7)

#define PWMDCCMR2_OC6PE_MSK             BIT3
#define PWMD_UnbufferCCR6()             CLR_REG_BIT(PWMD_CCMR2, PWMDCCMR2_OC6PE_MSK)
#define PWMD_BufferCCR6()               SET_REG_BIT(PWMD_CCMR2, PWMDCCMR2_OC6PE_MSK)

#define HSPWMD_UnbufferCCR6()           CLR_HSPWMD_BIT(PWMD_CCMR2, PWMDCCMR2_OC6PE_MSK)
#define HSPWMD_BufferCCR6()             SET_HSPWMD_BIT(PWMD_CCMR2, PWMDCCMR2_OC6PE_MSK)

#define PWMDCCMR2_OC6FE_MSK             BIT2
#define PWMD_DisableOC6FastMode()       CLR_REG_BIT(PWMD_CCMR2, PWMDCCMR2_OC6FE_MSK)
#define PWMD_EnableOC6FastMode()        SET_REG_BIT(PWMD_CCMR2, PWMDCCMR2_OC6FE_MSK)

#define HSPWMD_DisableOC6FastMode()     CLR_HSPWMD_BIT(PWMD_CCMR2, PWMDCCMR2_OC6FE_MSK)
#define HSPWMD_EnableOC6FastMode()      SET_HSPWMD_BIT(PWMD_CCMR2, PWMDCCMR2_OC6FE_MSK)

#define PWMDCCMR2_CC6S_MSK              (BIT1 | BIT0)
#define PWMD_SetCC6Mode(n)              MODIFY_REG(PWMD_CCMR2,  PWMDCCMR2_CC6S_MSK, ((n) << 0))
#define PWMD_CC6Output()                PWMD_SetCC6Mode(0)
#define PWMD_CC6CaptureTI6FP6()         PWMD_SetCC6Mode(1)
#define PWMD_CC6CaptureTI5FP6()         PWMD_SetCC6Mode(2)
#define PWMD_CC6CaptureTRC()            PWMD_SetCC6Mode(3)

#define HSPWMD_SetCC6Mode(n)            MODIFY_HSPWMD(PWMD_CCMR2,  PWMDCCMR2_CC6S_MSK, ((n) << 0))
#define HSPWMD_CC6Output()              HSPWMD_SetCC6Mode(0)
#define HSPWMD_CC6CaptureTI6FP6()       HSPWMD_SetCC6Mode(1)
#define HSPWMD_CC6CaptureTI5FP6()       HSPWMD_SetCC6Mode(2)
#define HSPWMD_CC6CaptureTRC()          HSPWMD_SetCC6Mode(3)

