fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMDCCMR2_IC6F_MSK              (BIT_HN)
#define PWMD_SetIC6Filter(n)            MODIFY_REG(PWMD_CCMR2,  PWMDCCMR2_IC6F_MSK, ((n) << 4))
#define PWMD_IC6Filter1()               PWMD_SetIC6Filter(0)
#define PWMD_IC6Filter2()               PWMD_SetIC6Filter(1)
#define PWMD_IC6Filter4()               PWMD_SetIC6Filter(2)
#define PWMD_IC6Filter8()               PWMD_SetIC6Filter(3)
#define PWMD_IC6Filter12()              PWMD_SetIC6Filter(4)
#define PWMD_IC6Filter16()              PWMD_SetIC6Filter(5)
#define PWMD_IC6Filter24()              PWMD_SetIC6Filter(6)
#define PWMD_IC6Filter32()              PWMD_SetIC6Filter(7)
#define PWMD_IC6Filter48()              PWMD_SetIC6Filter(8)
#define PWMD_IC6Filter64()              PWMD_SetIC6Filter(9)
#define PWMD_IC6Filter80()              PWMD_SetIC6Filter(10)
#define PWMD_IC6Filter96()              PWMD_SetIC6Filter(11)
#define PWMD_IC6Filter128()             PWMD_SetIC6Filter(12)
#define PWMD_IC6Filter160()             PWMD_SetIC6Filter(13)
#define PWMD_IC6Filter192()             PWMD_SetIC6Filter(14)
#define PWMD_IC6Filter256()             PWMD_SetIC6Filter(15)

#define HSPWMD_SetIC6Filter(n)          MODIFY_HSPWMD(PWMD_CCMR2,  PWMDCCMR2_IC6F_MSK, ((n) << 4))
#define HSPWMD_IC6Filter1()             HSPWMD_SetIC6Filter(0)
#define HSPWMD_IC6Filter2()             HSPWMD_SetIC6Filter(1)
#define HSPWMD_IC6Filter4()             HSPWMD_SetIC6Filter(2)
#define HSPWMD_IC6Filter8()             HSPWMD_SetIC6Filter(3)
#define HSPWMD_IC6Filter12()            HSPWMD_SetIC6Filter(4)
#define HSPWMD_IC6Filter16()            HSPWMD_SetIC6Filter(5)
#define HSPWMD_IC6Filter24()            HSPWMD_SetIC6Filter(6)
#define HSPWMD_IC6Filter32()            HSPWMD_SetIC6Filter(7)
#define HSPWMD_IC6Filter48()            HSPWMD_SetIC6Filter(8)
#define HSPWMD_IC6Filter64()            HSPWMD_SetIC6Filter(9)
#define HSPWMD_IC6Filter80()            HSPWMD_SetIC6Filter(10)
#define HSPWMD_IC6Filter96()            HSPWMD_SetIC6Filter(11)
#define HSPWMD_IC6Filter128()           HSPWMD_SetIC6Filter(12)
#define HSPWMD_IC6Filter160()           HSPWMD_SetIC6Filter(13)
#define HSPWMD_IC6Filter192()           HSPWMD_SetIC6Filter(14)
#define HSPWMD_IC6Filter256()           HSPWMD_SetIC6Filter(15)

#define PWMDCCMR2_IC6PS_MSK             (BIT3 | BIT2)
#define PWMD_SetIC6Divider(n)           MODIFY_REG(PWMD_CCMR2,  PWMDCCMR2_IC6PS_MSK, ((n) << 2))
#define PWMD_IC6Divider1()              PWMD_SetIC6Divider(0)
#define PWMD_IC6Divider2()              PWMD_SetIC6Divider(1)
#define PWMD_IC6Divider4()              PWMD_SetIC6Divider(2)
#define PWMD_IC6Divider8()              PWMD_SetIC6Divider(3)

#define HSPWMD_SetIC6Divider(n)         MODIFY_HSPWMD(PWMD_CCMR2,  PWMDCCMR2_IC6PS_MSK, ((n) << 2))
#define HSPWMD_IC6Divider1()            HSPWMD_SetIC6Divider(0)
#define HSPWMD_IC6Divider2()            HSPWMD_SetIC6Divider(1)
#define HSPWMD_IC6Divider4()            HSPWMD_SetIC6Divider(2)
#define HSPWMD_IC6Divider8()            HSPWMD_SetIC6Divider(3)

#define PWMDCCMR3_OC7CE_MSK             BIT7
#define PWMD_EnableETRFClearOC7REF()    SET_REG_BIT(PWMD_CCMR3, PWMDCCMR3_OC7CE_MSK)
#define PWMD_DisableETRFClearOC7REF()   CLR_REG_BIT(PWMD_CCMR3, PWMDCCMR3_OC7CE_MSK)

#define HSPWMD_EnableETRFClearOC7REF()  SET_HSPWMD_BIT(PWMD_CCMR3, PWMDCCMR3_OC7CE_MSK)
#define HSPWMD_DisableETRFClearOC7REF() CLR_HSPWMD_BIT(PWMD_CCMR3, PWMDCCMR3_OC7CE_MSK)

#define PWMDCCMR3_OC7M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMD_SetOC7OutputMode(n)        MODIFY_REG(PWMD_CCMR3,  PWMDCCMR3_OC7M_MSK, ((n) << 4))
#define PWMD_OC7REFFrozen()             PWMD_SetOC7OutputMode(0)
#define PWMD_OC7REFHighIfMatch()        PWMD_SetOC7OutputMode(1)
#define PWMD_OC7REFLowIfMatch()         PWMD_SetOC7OutputMode(2)
#define PWMD_OC7REFToggleIfMatch()      PWMD_SetOC7OutputMode(3)
#define PWMD_OC7REFForceLow()           PWMD_SetOC7OutputMode(4)
#define PWMD_OC7REFForceHigh()          PWMD_SetOC7OutputMode(5)
#define PWMD_OC7REFPWMMode1()           PWMD_SetOC7OutputMode(6)
#define PWMD_OC7REFPWMMode2()           PWMD_SetOC7OutputMode(7)

#define HSPWMD_SetOC7OutputMode(n)      MODIFY_HSPWMD(PWMD_CCMR3,  PWMDCCMR3_OC7M_MSK, ((n) << 4))
#define HSPWMD_OC7REFFrozen()           HSPWMD_SetOC7OutputMode(0)
#define HSPWMD_OC7REFHighIfMatch()      HSPWMD_SetOC7OutputMode(1)
#define HSPWMD_OC7REFLowIfMatch()       HSPWMD_SetOC7OutputMode(2)
#define HSPWMD_OC7REFToggleIfMatch()    HSPWMD_SetOC7OutputMode(3)
#define HSPWMD_OC7REFForceLow()         HSPWMD_SetOC7OutputMode(4)
#define HSPWMD_OC7REFForceHigh()        HSPWMD_SetOC7OutputMode(5)
#define HSPWMD_OC7REFPWMMode1()         HSPWMD_SetOC7OutputMode(6)
#define HSPWMD_OC7REFPWMMode2()         HSPWMD_SetOC7OutputMode(7)

#define PWMDCCMR3_OC7PE_MSK             BIT3
#define PWMD_UnbufferCCR7()             CLR_REG_BIT(PWMD_CCMR3, PWMDCCMR3_OC7PE_MSK)
#define PWMD_BufferCCR7()               SET_REG_BIT(PWMD_CCMR3, PWMDCCMR3_OC7PE_MSK)

#define HSPWMD_UnbufferCCR7()           CLR_HSPWMD_BIT(PWMD_CCMR3, PWMDCCMR3_OC7PE_MSK)
#define HSPWMD_BufferCCR7()             SET_HSPWMD_BIT(PWMD_CCMR3, PWMDCCMR3_OC7PE_MSK)

#define PWMDCCMR3_OC7FE_MSK             BIT2
#define PWMD_DisableOC7FastMode()       CLR_REG_BIT(PWMD_CCMR3, PWMDCCMR3_OC7FE_MSK)
#define PWMD_EnableOC7FastMode()        SET_REG_BIT(PWMD_CCMR3, PWMDCCMR3_OC7FE_MSK)

#define HSPWMD_DisableOC7FastMode()     CLR_HSPWMD_BIT(PWMD_CCMR3, PWMDCCMR3_OC7FE_MSK)
#define HSPWMD_EnableOC7FastMode()      SET_HSPWMD_BIT(PWMD_CCMR3, PWMDCCMR3_OC7FE_MSK)

#define PWMDCCMR3_CC7S_MSK              (BIT1 | BIT0)
#define PWMD_SetCC7Mode(n)              MODIFY_REG(PWMD_CCMR3,  PWMDCCMR3_CC7S_MSK, ((n) << 0))
#define PWMD_CC7Output()                PWMD_SetCC7Mode(0)
#define PWMD_CC7CaptureTI7FP7()         PWMD_SetCC7Mode(1)
#define PWMD_CC7CaptureTI8FP7()         PWMD_SetCC7Mode(2)
#define PWMD_CC7CaptureTRC()            PWMD_SetCC7Mode(3)

#define HSPWMD_SetCC7Mode(n)            MODIFY_HSPWMD(PWMD_CCMR3,  PWMDCCMR3_CC7S_MSK, ((n) << 0))
#define HSPWMD_CC7Output()              HSPWMD_SetCC7Mode(0)
#define HSPWMD_CC7CaptureTI7FP7()       HSPWMD_SetCC7Mode(1)
#define HSPWMD_CC7CaptureTI8FP7()       HSPWMD_SetCC7Mode(2)
#define HSPWMD_CC7CaptureTRC()          HSPWMD_SetCC7Mode(3)

#define PWMDCCMR3_IC7F_MSK              (BIT_HN)
#define PWMD_SetIC7Filter(n)            MODIFY_REG(PWMD_CCMR3,  PWMDCCMR3_IC7F_MSK, ((n) << 4))
#define PWMD_IC7Filter1()               PWMD_SetIC7Filter(0)
#define PWMD_IC7Filter2()               PWMD_SetIC7Filter(1)
#define PWMD_IC7Filter4()               PWMD_SetIC7Filter(2)
#define PWMD_IC7Filter8()               PWMD_SetIC7Filter(3)
#define PWMD_IC7Filter12()              PWMD_SetIC7Filter(4)
#define PWMD_IC7Filter16()              PWMD_SetIC7Filter(5)
#define PWMD_IC7Filter24()              PWMD_SetIC7Filter(6)
#define PWMD_IC7Filter32()              PWMD_SetIC7Filter(7)
#define PWMD_IC7Filter48()              PWMD_SetIC7Filter(8)
#define PWMD_IC7Filter64()              PWMD_SetIC7Filter(9)
#define PWMD_IC7Filter80()              PWMD_SetIC7Filter(10)
#define PWMD_IC7Filter96()              PWMD_SetIC7Filter(11)
#define PWMD_IC7Filter128()             PWMD_SetIC7Filter(12)
#define PWMD_IC7Filter160()             PWMD_SetIC7Filter(13)
#define PWMD_IC7Filter192()             PWMD_SetIC7Filter(14)
#define PWMD_IC7Filter256()             PWMD_SetIC7Filter(15)

