fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMD_SetIC7Filter(n)          MODIFY_HSPWMD(PWMD_CCMR3,  PWMDCCMR3_IC7F_MSK, ((n) << 4))
#define HSPWMD_IC7Filter1()             HSPWMD_SetIC7Filter(0)
#define HSPWMD_IC7Filter2()             HSPWMD_SetIC7Filter(1)
#define HSPWMD_IC7Filter4()             HSPWMD_SetIC7Filter(2)
#define HSPWMD_IC7Filter8()             HSPWMD_SetIC7Filter(3)
#define HSPWMD_IC7Filter12()            HSPWMD_SetIC7Filter(4)
#define HSPWMD_IC7Filter16()            HSPWMD_SetIC7Filter(5)
#define HSPWMD_IC7Filter24()            HSPWMD_SetIC7Filter(6)
#define HSPWMD_IC7Filter32()            HSPWMD_SetIC7Filter(7)
#define HSPWMD_IC7Filter48()            HSPWMD_SetIC7Filter(8)
#define HSPWMD_IC7Filter64()            HSPWMD_SetIC7Filter(9)
#define HSPWMD_IC7Filter80()            HSPWMD_SetIC7Filter(10)
#define HSPWMD_IC7Filter96()            HSPWMD_SetIC7Filter(11)
#define HSPWMD_IC7Filter128()           HSPWMD_SetIC7Filter(12)
#define HSPWMD_IC7Filter160()           HSPWMD_SetIC7Filter(13)
#define HSPWMD_IC7Filter192()           HSPWMD_SetIC7Filter(14)
#define HSPWMD_IC7Filter256()           HSPWMD_SetIC7Filter(15)

#define PWMDCCMR3_IC7PS_MSK             (BIT3 | BIT2)
#define PWMD_SetIC7Divider(n)           MODIFY_REG(PWMD_CCMR3,  PWMDCCMR3_IC7PS_MSK, ((n) << 2))
#define PWMD_IC7Divider1()              PWMD_SetIC7Divider(0)
#define PWMD_IC7Divider2()              PWMD_SetIC7Divider(1)
#define PWMD_IC7Divider4()              PWMD_SetIC7Divider(2)
#define PWMD_IC7Divider8()              PWMD_SetIC7Divider(3)

#define HSPWMD_SetIC7Divider(n)         MODIFY_HSPWMD(PWMD_CCMR3,  PWMDCCMR3_IC7PS_MSK, ((n) << 2))
#define HSPWMD_IC7Divider1()            HSPWMD_SetIC7Divider(0)
#define HSPWMD_IC7Divider2()            HSPWMD_SetIC7Divider(1)
#define HSPWMD_IC7Divider4()            HSPWMD_SetIC7Divider(2)
#define HSPWMD_IC7Divider8()            HSPWMD_SetIC7Divider(3)

#define PWMDCCMR4_OC8CE_MSK             BIT7
#define PWMD_EnableETRFClearOC8REF()    SET_REG_BIT(PWMD_CCMR4, PWMDCCMR4_OC8CE_MSK)
#define PWMD_DisableETRFClearOC8REF()   CLR_REG_BIT(PWMD_CCMR4, PWMDCCMR4_OC8CE_MSK)

#define HSPWMD_EnableETRFClearOC8REF()  SET_HSPWMD_BIT(PWMD_CCMR4, PWMDCCMR4_OC8CE_MSK)
#define HSPWMD_DisableETRFClearOC8REF() CLR_HSPWMD_BIT(PWMD_CCMR4, PWMDCCMR4_OC8CE_MSK)

#define PWMDCCMR4_OC8M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMD_SetOC8OutputMode(n)        MODIFY_REG(PWMD_CCMR4,  PWMDCCMR4_OC8M_MSK, ((n) << 4))
#define PWMD_OC8REFFrozen()             PWMD_SetOC8OutputMode(0)
#define PWMD_OC8REFHighIfMatch()        PWMD_SetOC8OutputMode(1)
#define PWMD_OC8REFLowIfMatch()         PWMD_SetOC8OutputMode(2)
#define PWMD_OC8REFToggleIfMatch()      PWMD_SetOC8OutputMode(3)
#define PWMD_OC8REFForceLow()           PWMD_SetOC8OutputMode(4)
#define PWMD_OC8REFForceHigh()          PWMD_SetOC8OutputMode(5)
#define PWMD_OC8REFPWMMode1()           PWMD_SetOC8OutputMode(6)
#define PWMD_OC8REFPWMMode2()           PWMD_SetOC8OutputMode(7)

#define HSPWMD_SetOC8OutputMode(n)      MODIFY_HSPWMD(PWMD_CCMR4,  PWMDCCMR4_OC8M_MSK, ((n) << 4))
#define HSPWMD_OC8REFFrozen()           HSPWMD_SetOC8OutputMode(0)
#define HSPWMD_OC8REFHighIfMatch()      HSPWMD_SetOC8OutputMode(1)
#define HSPWMD_OC8REFLowIfMatch()       HSPWMD_SetOC8OutputMode(2)
#define HSPWMD_OC8REFToggleIfMatch()    HSPWMD_SetOC8OutputMode(3)
#define HSPWMD_OC8REFForceLow()         HSPWMD_SetOC8OutputMode(4)
#define HSPWMD_OC8REFForceHigh()        HSPWMD_SetOC8OutputMode(5)
#define HSPWMD_OC8REFPWMMode1()         HSPWMD_SetOC8OutputMode(6)
#define HSPWMD_OC8REFPWMMode2()         HSPWMD_SetOC8OutputMode(7)

#define PWMDCCMR4_OC8PE_MSK             BIT3
#define PWMD_UnbufferCCR8()             CLR_REG_BIT(PWMD_CCMR4, PWMDCCMR4_OC8PE_MSK)
#define PWMD_BufferCCR8()               SET_REG_BIT(PWMD_CCMR4, PWMDCCMR4_OC8PE_MSK)

#define HSPWMD_UnbufferCCR8()           CLR_HSPWMD_BIT(PWMD_CCMR4, PWMDCCMR4_OC8PE_MSK)
#define HSPWMD_BufferCCR8()             SET_HSPWMD_BIT(PWMD_CCMR4, PWMDCCMR4_OC8PE_MSK)

#define PWMDCCMR4_OC8FE_MSK             BIT2
#define PWMD_DisableOC8FastMode()       CLR_REG_BIT(PWMD_CCMR4, PWMDCCMR4_OC8FE_MSK)
#define PWMD_EnableOC8FastMode()        SET_REG_BIT(PWMD_CCMR4, PWMDCCMR4_OC8FE_MSK)

#define HSPWMD_DisableOC8FastMode()     CLR_HSPWMD_BIT(PWMD_CCMR4, PWMDCCMR4_OC8FE_MSK)
#define HSPWMD_EnableOC8FastMode()      SET_HSPWMD_BIT(PWMD_CCMR4, PWMDCCMR4_OC8FE_MSK)

#define PWMDCCMR4_CC8S_MSK              (BIT1 | BIT0)
#define PWMD_SetCC8Mode(n)              MODIFY_REG(PWMD_CCMR4,  PWMDCCMR4_CC8S_MSK, ((n) << 0))
#define PWMD_CC8Output()                PWMD_SetCC8Mode(0)
#define PWMD_CC8CaptureTI8FP8()         PWMD_SetCC8Mode(1)
#define PWMD_CC8CaptureTI7FP8()         PWMD_SetCC8Mode(2)
#define PWMD_CC8CaptureTRC()            PWMD_SetCC8Mode(3)

#define HSPWMD_SetCC8Mode(n)            MODIFY_HSPWMD(PWMD_CCMR4,  PWMDCCMR4_CC8S_MSK, ((n) << 0))
#define HSPWMD_CC8Output()              HSPWMD_SetCC8Mode(0)
#define HSPWMD_CC8CaptureTI8FP8()       HSPWMD_SetCC8Mode(1)
#define HSPWMD_CC8CaptureTI7FP8()       HSPWMD_SetCC8Mode(2)
#define HSPWMD_CC8CaptureTRC()          HSPWMD_SetCC8Mode(3)

#define PWMDCCMR4_IC8F_MSK              (BIT_HN)
#define PWMD_SetIC8Filter(n)            MODIFY_REG(PWMD_CCMR4,  PWMDCCMR4_IC8F_MSK, ((n) << 4))
#define PWMD_IC8Filter1()               PWMD_SetIC8Filter(0)
#define PWMD_IC8Filter2()               PWMD_SetIC8Filter(1)
#define PWMD_IC8Filter4()               PWMD_SetIC8Filter(2)
#define PWMD_IC8Filter8()               PWMD_SetIC8Filter(3)
#define PWMD_IC8Filter12()              PWMD_SetIC8Filter(4)
#define PWMD_IC8Filter16()              PWMD_SetIC8Filter(5)
#define PWMD_IC8Filter24()              PWMD_SetIC8Filter(6)
#define PWMD_IC8Filter32()              PWMD_SetIC8Filter(7)
#define PWMD_IC8Filter48()              PWMD_SetIC8Filter(8)
#define PWMD_IC8Filter64()              PWMD_SetIC8Filter(9)
#define PWMD_IC8Filter80()              PWMD_SetIC8Filter(10)
#define PWMD_IC8Filter96()              PWMD_SetIC8Filter(11)
#define PWMD_IC8Filter128()             PWMD_SetIC8Filter(12)
#define PWMD_IC8Filter160()             PWMD_SetIC8Filter(13)
#define PWMD_IC8Filter192()             PWMD_SetIC8Filter(14)
#define PWMD_IC8Filter256()             PWMD_SetIC8Filter(15)

#define HSPWMD_SetIC8Filter(n)          MODIFY_HSPWMD(PWMD_CCMR4,  PWMDCCMR4_IC8F_MSK, ((n) << 4))
#define HSPWMD_IC8Filter1()             HSPWMD_SetIC8Filter(0)
#define HSPWMD_IC8Filter2()             HSPWMD_SetIC8Filter(1)
#define HSPWMD_IC8Filter4()             HSPWMD_SetIC8Filter(2)
#define HSPWMD_IC8Filter8()             HSPWMD_SetIC8Filter(3)
#define HSPWMD_IC8Filter12()            HSPWMD_SetIC8Filter(4)
#define HSPWMD_IC8Filter16()            HSPWMD_SetIC8Filter(5)
#define HSPWMD_IC8Filter24()            HSPWMD_SetIC8Filter(6)
#define HSPWMD_IC8Filter32()            HSPWMD_SetIC8Filter(7)
#define HSPWMD_IC8Filter48()            HSPWMD_SetIC8Filter(8)
#define HSPWMD_IC8Filter64()            HSPWMD_SetIC8Filter(9)
#define HSPWMD_IC8Filter80()            HSPWMD_SetIC8Filter(10)
#define HSPWMD_IC8Filter96()            HSPWMD_SetIC8Filter(11)
#define HSPWMD_IC8Filter128()           HSPWMD_SetIC8Filter(12)
#define HSPWMD_IC8Filter160()           HSPWMD_SetIC8Filter(13)
#define HSPWMD_IC8Filter192()           HSPWMD_SetIC8Filter(14)
#define HSPWMD_IC8Filter256()           HSPWMD_SetIC8Filter(15)

#define PWMDCCMR4_IC8PS_MSK             (BIT3 | BIT2)
#define PWMD_SetIC8Divider(n)           MODIFY_REG(PWMD_CCMR4,  PWMDCCMR4_IC8PS_MSK, ((n) << 2))
#define PWMD_IC8Divider1()              PWMD_SetIC8Divider(0)
#define PWMD_IC8Divider2()              PWMD_SetIC8Divider(1)
#define PWMD_IC8Divider4()              PWMD_SetIC8Divider(2)
#define PWMD_IC8Divider8()              PWMD_SetIC8Divider(3)

#define HSPWMD_SetIC8Divider(n)         MODIFY_HSPWMD(PWMD_CCMR4,  PWMDCCMR4_IC8PS_MSK, ((n) << 2))
#define HSPWMD_IC8Divider1()            HSPWMD_SetIC8Divider(0)
#define HSPWMD_IC8Divider2()            HSPWMD_SetIC8Divider(1)
#define HSPWMD_IC8Divider4()            HSPWMD_SetIC8Divider(2)
#define HSPWMD_IC8Divider8()            HSPWMD_SetIC8Divider(3)

