fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMDCCER1_CC5E_MSK              BIT0
#define PWMD_CC5PEnable()               SET_REG_BIT(PWMD_CCER1, PWMDCCER1_CC5E_MSK)
#define PWMD_CC5PDisable()              CLR_REG_BIT(PWMD_CCER1, PWMDCCER1_CC5E_MSK)

#define HSPWMD_CC5PEnable()             SET_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC5E_MSK)
#define HSPWMD_CC5PDisable()            CLR_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC5E_MSK)

#define PWMDCCER1_CC5P_MSK              BIT1
#define PWMD_CC5PNonInverted()          CLR_REG_BIT(PWMD_CCER1, PWMDCCER1_CC5P_MSK)
#define PWMD_CC5PInverted()             SET_REG_BIT(PWMD_CCER1, PWMDCCER1_CC5P_MSK)

#define HSPWMD_CC5PNonInverted()        CLR_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC5P_MSK)
#define HSPWMD_CC5PInverted()           SET_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC5P_MSK)

#define PWMDCCER1_CC6E_MSK              BIT4
#define PWMD_CC6PEnable()               SET_REG_BIT(PWMD_CCER1, PWMDCCER1_CC6E_MSK)
#define PWMD_CC6PDisable()              CLR_REG_BIT(PWMD_CCER1, PWMDCCER1_CC6E_MSK)

#define HSPWMD_CC6PEnable()             SET_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC6E_MSK)
#define HSPWMD_CC6PDisable()            CLR_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC6E_MSK)

#define PWMDCCER1_CC6P_MSK              BIT5
#define PWMD_CC6PNonInverted()          CLR_REG_BIT(PWMD_CCER1, PWMDCCER1_CC6P_MSK)
#define PWMD_CC6PInverted()             SET_REG_BIT(PWMD_CCER1, PWMDCCER1_CC6P_MSK)

#define HSPWMD_CC6PNonInverted()        CLR_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC6P_MSK)
#define HSPWMD_CC6PInverted()           SET_HSPWMD_BIT(PWMD_CCER1, PWMDCCER1_CC6P_MSK)

#define PWMDCCER2_CC7E_MSK              BIT0
#define PWMD_CC7PEnable()               SET_REG_BIT(PWMD_CCER2, PWMDCCER2_CC7E_MSK)
#define PWMD_CC7PDisable()              CLR_REG_BIT(PWMD_CCER2, PWMDCCER2_CC7E_MSK)

#define HSPWMD_CC7PEnable()             SET_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC7E_MSK)
#define HSPWMD_CC7PDisable()            CLR_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC7E_MSK)

#define PWMDCCER2_CC7P_MSK              BIT1
#define PWMD_CC7PNonInverted()          CLR_REG_BIT(PWMD_CCER2, PWMDCCER2_CC7P_MSK)
#define PWMD_CC7PInverted()             SET_REG_BIT(PWMD_CCER2, PWMDCCER2_CC7P_MSK)

#define HSPWMD_CC7PNonInverted()        CLR_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC7P_MSK)
#define HSPWMD_CC7PInverted()           SET_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC7P_MSK)

#define PWMDCCER2_CC8E_MSK              BIT4
#define PWMD_CC8PEnable()               SET_REG_BIT(PWMD_CCER2, PWMDCCER2_CC8E_MSK)
#define PWMD_CC8PDisable()              CLR_REG_BIT(PWMD_CCER2, PWMDCCER2_CC8E_MSK)

#define HSPWMD_CC8PEnable()             SET_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC8E_MSK)
#define HSPWMD_CC8PDisable()            CLR_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC8E_MSK)

#define PWMDCCER2_CC8P_MSK              BIT5
#define PWMD_CC8PNonInverted()          CLR_REG_BIT(PWMD_CCER2, PWMDCCER2_CC8P_MSK)
#define PWMD_CC8PInverted()             SET_REG_BIT(PWMD_CCER2, PWMDCCER2_CC8P_MSK)

#define HSPWMD_CC8PNonInverted()        CLR_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC8P_MSK)
#define HSPWMD_CC8PInverted()           SET_HSPWMD_BIT(PWMD_CCER2, PWMDCCER2_CC8P_MSK)

#define PWMDBRK_MOE_MSK                 BIT7
#define PWMD_EnableMainOutput()         SET_REG_BIT(PWMD_BKR, PWMDBRK_MOE_MSK)
#define PWMD_DisableMainOutput()        CLR_REG_BIT(PWMD_BKR, PWMDBRK_MOE_MSK)

#define HSPWMD_EnableMainOutput()       SET_HSPWMD_BIT(PWMD_BKR, PWMDBRK_MOE_MSK)
#define HSPWMD_DisableMainOutput()      CLR_HSPWMD_BIT(PWMD_BKR, PWMDBRK_MOE_MSK)

#define PWMDBRK_AOE_MSK                 BIT6
#define PWMD_EnableAutoOutput()         SET_REG_BIT(PWMD_BKR, PWMDBRK_AOE_MSK)
#define PWMD_DisableAutoOutput()        CLR_REG_BIT(PWMD_BKR, PWMDBRK_AOE_MSK)

#define HSPWMD_EnableAutoOutput()       SET_HSPWMD_BIT(PWMD_BKR, PWMDBRK_AOE_MSK)
#define HSPWMD_DisableAutoOutput()      CLR_HSPWMD_BIT(PWMD_BKR, PWMDBRK_AOE_MSK)

#define PWMDBRK_BKP_MSK                 BIT5
#define PWMD_BRKNonInverted()           SET_REG_BIT(PWMD_BKR, PWMDBRK_BKP_MSK)
#define PWMD_BRKInverted()              CLR_REG_BIT(PWMD_BKR, PWMDBRK_BKP_MSK)

#define HSPWMD_BRKNonInverted()         SET_HSPWMD_BIT(PWMD_BKR, PWMDBRK_BKP_MSK)
#define HSPWMD_BRKInverted()            CLR_HSPWMD_BIT(PWMD_BKR, PWMDBRK_BKP_MSK)

#define PWMDBRK_BKE_MSK                 BIT4
#define PWMD_BRKEnable()                SET_REG_BIT(PWMD_BKR, PWMDBRK_BKE_MSK)
#define PWMD_BRKDisable()               CLR_REG_BIT(PWMD_BKR, PWMDBRK_BKE_MSK)

#define HSPWMD_BRKEnable()              SET_HSPWMD_BIT(PWMD_BKR, PWMDBRK_BKE_MSK)
#define HSPWMD_BRKDisable()             CLR_HSPWMD_BIT(PWMD_BKR, PWMDBRK_BKE_MSK)

#define PWMDBRK_OSSR_MSK                BIT3
#define PWMDBRK_OSSI_MSK                BIT2
#define PWMD_RunInactiveNoOutput()      CLR_REG_BIT(PWMD_BKR, PWMDBRK_OSSR_MSK)
#define PWMD_RunInactiveOutput()        SET_REG_BIT(PWMD_BKR, PWMDBRK_OSSR_MSK)
#define PWMD_IdleInactiveNoOutput()     CLR_REG_BIT(PWMD_BKR, PWMDBRK_OSSI_MSK)
#define PWMD_IdleInactiveOutput()       SET_REG_BIT(PWMD_BKR, PWMDBRK_OSSI_MSK)

#define HSPWMD_RunInactiveNoOutput()    CLR_HSPWMD_BIT(PWMD_BKR, PWMDBRK_OSSR_MSK)
#define HSPWMD_RunInactiveOutput()      SET_HSPWMD_BIT(PWMD_BKR, PWMDBRK_OSSR_MSK)
#define HSPWMD_IdleInactiveNoOutput()   CLR_HSPWMD_BIT(PWMD_BKR, PWMDBRK_OSSI_MSK)
#define HSPWMD_IdleInactiveOutput()     SET_HSPWMD_BIT(PWMD_BKR, PWMDBRK_OSSI_MSK)

#define PWMDBRK_LOCK_MSK                (BIT1 | BIT0)
#define PWMD_SetLockLevel(n)            MODIFY_REG(PWMD_BKR,  PWMDBRK_LOCK_MSK, ((n) << 0))
#define PWMD_SetUnLock()                PWMD_SetLockLevel(0)

#define HSPWMD_SetLockLevel(n)          MODIFY_HSPWMD(PWMD_BKR,  PWMDBRK_LOCK_MSK, ((n) << 0))
#define HSPWMD_SetUnLock()              HSPWMD_SetLockLevel(0)

#define PWMDOISR_OIS5_MSK               BIT0
#define PWMDOISR_OIS6_MSK               BIT2
#define PWMDOISR_OIS7_MSK               BIT4
#define PWMDOISR_OIS8_MSK               BIT6
#define PWMD_OC5PIdleLevelLow()         CLR_REG_BIT(PWMD_OISR, PWMDOISR_OIS5_MSK)
#define PWMD_OC5PIdleLevelHigh()        SET_REG_BIT(PWMD_OISR, PWMDOISR_OIS5_MSK)
#define PWMD_OC6PIdleLevelLow()         CLR_REG_BIT(PWMD_OISR, PWMDOISR_OIS6_MSK)
#define PWMD_OC6PIdleLevelHigh()        SET_REG_BIT(PWMD_OISR, PWMDOISR_OIS6_MSK)
#define PWMD_OC7PIdleLevelLow()         CLR_REG_BIT(PWMD_OISR, PWMDOISR_OIS7_MSK)
#define PWMD_OC7PIdleLevelHigh()        SET_REG_BIT(PWMD_OISR, PWMDOISR_OIS7_MSK)
#define PWMD_OC8PIdleLevelLow()         CLR_REG_BIT(PWMD_OISR, PWMDOISR_OIS8_MSK)
#define PWMD_OC8PIdleLevelHigh()        SET_REG_BIT(PWMD_OISR, PWMDOISR_OIS8_MSK)

#define HSPWMD_OC5PIdleLevelLow()       CLR_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS5_MSK)
#define HSPWMD_OC5PIdleLevelHigh()      SET_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS5_MSK)
#define HSPWMD_OC6PIdleLevelLow()       CLR_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS6_MSK)
#define HSPWMD_OC6PIdleLevelHigh()      SET_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS6_MSK)
#define HSPWMD_OC7PIdleLevelLow()       CLR_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS7_MSK)
#define HSPWMD_OC7PIdleLevelHigh()      SET_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS7_MSK)
#define HSPWMD_OC8PIdleLevelLow()       CLR_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS8_MSK)
#define HSPWMD_OC8PIdleLevelHigh()      SET_HSPWMD_BIT(PWMD_OISR, PWMDOISR_OIS8_MSK)

