fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMD_SetCounter(n)              (PWMD_CNTRH = HIBYTE(n), PWMD_CNTRL = LOBYTE(n))
#define PWMD_SetClockDivider(n)         (PWMD_PSCRH = HIBYTE(n), PWMD_PSCRL = LOBYTE(n))
#define PWMD_SetReload16(n)             (PWMD_ARRH = HIBYTE(n), PWMD_ARRL = LOBYTE(n))
#define PWMD_SetRepeatCounter(n)        (PWMD_RCRH = HIBYTE(n), PWMD_RCR = LOBYTE(n))

#define HSPWMD_SetCounter(n)            (WRITE_HSPWMD(PWMD_CNTRH, HIBYTE(n)), WRITE_HSPWMD(PWMD_CNTRL, LOBYTE(n)))
#define HSPWMD_SetClockDivider(n)       (WRITE_HSPWMD(PWMD_PSCRH, HIBYTE(n)), WRITE_HSPWMD(PWMD_PSCRL, LOBYTE(n)))
#define HSPWMD_SetReload16(n)           (WRITE_HSPWMD(PWMD_ARRH, HIBYTE(n)), WRITE_HSPWMD(PWMD_ARRL, LOBYTE(n)))
#define HSPWMD_SetRepeatCounter(n)      (WRITE_HSPWMD(PWMD_RCRH, HIBYTE(n)), WRITE_HSPWMD(PWMD_RCR, LOBYTE(n)))

#define PWMD_SetCCR5Value(n)            (PWMD_CCR5H = HIBYTE(n), PWMD_CCR5L = LOBYTE(n))
#define PWMD_SetCCR6Value(n)            (PWMD_CCR6H = HIBYTE(n), PWMD_CCR6L = LOBYTE(n))
#define PWMD_SetCCR7Value(n)            (PWMD_CCR7H = HIBYTE(n), PWMD_CCR7L = LOBYTE(n))
#define PWMD_SetCCR8Value(n)            (PWMD_CCR8H = HIBYTE(n), PWMD_CCR8L = LOBYTE(n))

#define HSPWMD_SetCCR5Value(n)          (WRITE_HSPWMD(PWMD_CCR5H, HIBYTE(n)), WRITE_HSPWMD(PWMD_CCR5L, LOBYTE(n)))
#define HSPWMD_SetCCR6Value(n)          (WRITE_HSPWMD(PWMD_CCR6H, HIBYTE(n)), WRITE_HSPWMD(PWMD_CCR6L, LOBYTE(n)))
#define HSPWMD_SetCCR7Value(n)          (WRITE_HSPWMD(PWMD_CCR7H, HIBYTE(n)), WRITE_HSPWMD(PWMD_CCR7L, LOBYTE(n)))
#define HSPWMD_SetCCR8Value(n)          (WRITE_HSPWMD(PWMD_CCR8H, HIBYTE(n)), WRITE_HSPWMD(PWMD_CCR8L, LOBYTE(n)))

#define PWMD_ReadReload16()             MAKEWORD(PWMD_ARRL, PWMD_ARRH)

#define HSPWMD_ReadReload16()           MAKEWORD(READ_HSPWMD(PWMD_ARRL), READ_HSPWMD(PWMD_ARRH))

#define PWMD_ReadCCR5Value()            MAKEWORD(PWMD_CCR5L, PWMD_CCR5H)
#define PWMD_ReadCCR6Value()            MAKEWORD(PWMD_CCR6L, PWMD_CCR6H)
#define PWMD_ReadCCR7Value()            MAKEWORD(PWMD_CCR7L, PWMD_CCR7H)
#define PWMD_ReadCCR8Value()            MAKEWORD(PWMD_CCR8L, PWMD_CCR8H)

#define HSPWMD_ReadCCR5Value()          MAKEWORD(READ_HSPWMD(PWMD_CCR5L), READ_HSPWMD(PWMD_CCR5H))
#define HSPWMD_ReadCCR6Value()          MAKEWORD(READ_HSPWMD(PWMD_CCR6L), READ_HSPWMD(PWMD_CCR6H))
#define HSPWMD_ReadCCR7Value()          MAKEWORD(READ_HSPWMD(PWMD_CCR7L), READ_HSPWMD(PWMD_CCR7H))
#define HSPWMD_ReadCCR8Value()          MAKEWORD(READ_HSPWMD(PWMD_CCR8L), READ_HSPWMD(PWMD_CCR8H))

#define PWMD_SetDeadTime(n)             PWMD_DTR = LOBYTE(n)

#define HSPWMD_SetDeadTime(n)           WRITE_HSPWMD(PWMD_DTR, LOBYTE(n))

////////////////////////

#define PWMEENO_ENO1P_MSK               BIT0
#define PWMEENO_ENO1N_MSK               BIT1
#define PWMEENO_ENO2P_MSK               BIT2
#define PWMEENO_ENO2N_MSK               BIT3
#define PWMEENO_ENO3P_MSK               BIT4
#define PWMEENO_ENO3N_MSK               BIT5
#define PWMEENO_ENO4P_MSK               BIT6
#define PWMEENO_ENO4N_MSK               BIT7
#define PWMEENO2_ENO5P_MSK              BIT0
#define PWMEENO2_ENO6P_MSK              BIT2
#define PWME_EnablePWM1POutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO1P_MSK)
#define PWME_DisablePWM1POutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO1P_MSK)
#define PWME_EnablePWM1NOutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO1N_MSK)
#define PWME_DisablePWM1NOutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO1N_MSK)
#define PWME_EnablePWM2POutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO2P_MSK)
#define PWME_DisablePWM2POutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO2P_MSK)
#define PWME_EnablePWM2NOutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO2N_MSK)
#define PWME_DisablePWM2NOutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO2N_MSK)
#define PWME_EnablePWM3POutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO3P_MSK)
#define PWME_DisablePWM3POutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO3P_MSK)
#define PWME_EnablePWM3NOutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO3N_MSK)
#define PWME_DisablePWM3NOutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO3N_MSK)
#define PWME_EnablePWM4POutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO4P_MSK)
#define PWME_DisablePWM4POutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO4P_MSK)
#define PWME_EnablePWM4NOutput()        SET_REG_BIT(PWME_ENO, PWMEENO_ENO4N_MSK)
#define PWME_DisablePWM4NOutput()       CLR_REG_BIT(PWME_ENO, PWMEENO_ENO4N_MSK)
#define PWME_EnablePWM5POutput()        SET_REG_BIT(PWME_ENO2, PWMEENO2_ENO5P_MSK)
#define PWME_DisablePWM5POutput()       CLR_REG_BIT(PWME_ENO2, PWMEENO2_ENO5P_MSK)
#define PWME_EnablePWM6POutput()        SET_REG_BIT(PWME_ENO2, PWMEENO2_ENO6P_MSK)
#define PWME_DisablePWM6POutput()       CLR_REG_BIT(PWME_ENO2, PWMEENO2_ENO6P_MSK)

#define HSPWME_EnablePWM1POutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO1P_MSK)
#define HSPWME_DisablePWM1POutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO1P_MSK)
#define HSPWME_EnablePWM1NOutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO1N_MSK)
#define HSPWME_DisablePWM1NOutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO1N_MSK)
#define HSPWME_EnablePWM2POutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO2P_MSK)
#define HSPWME_DisablePWM2POutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO2P_MSK)
#define HSPWME_EnablePWM2NOutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO2N_MSK)
#define HSPWME_DisablePWM2NOutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO2N_MSK)
#define HSPWME_EnablePWM3POutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO3P_MSK)
#define HSPWME_DisablePWM3POutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO3P_MSK)
#define HSPWME_EnablePWM3NOutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO3N_MSK)
#define HSPWME_DisablePWM3NOutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO3N_MSK)
#define HSPWME_EnablePWM4POutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO4P_MSK)
#define HSPWME_DisablePWM4POutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO4P_MSK)
#define HSPWME_EnablePWM4NOutput()      SET_HSPWME_BIT(PWME_ENO, PWMEENO_ENO4N_MSK)
#define HSPWME_DisablePWM4NOutput()     CLR_HSPWME_BIT(PWME_ENO, PWMEENO_ENO4N_MSK)
#define HSPWME_EnablePWM5POutput()      SET_HSPWME_BIT(PWME_ENO2, PWMEENO2_ENO5P_MSK)
#define HSPWME_DisablePWM5POutput()     CLR_HSPWME_BIT(PWME_ENO2, PWMEENO2_ENO5P_MSK)
#define HSPWME_EnablePWM6POutput()      SET_HSPWME_BIT(PWME_ENO2, PWMEENO2_ENO6P_MSK)
#define HSPWME_DisablePWM6POutput()     CLR_HSPWME_BIT(PWME_ENO2, PWMEENO2_ENO6P_MSK)

#define PWMEIOAUX_AUX1P_MSK             BIT0
#define PWMEIOAUX_AUX1N_MSK             BIT1
#define PWMEIOAUX_AUX2P_MSK             BIT2
#define PWMEIOAUX_AUX2N_MSK             BIT3
#define PWMEIOAUX_AUX3P_MSK             BIT4
#define PWMEIOAUX_AUX3N_MSK             BIT5
#define PWMEIOAUX_AUX4P_MSK             BIT6
#define PWMEIOAUX_AUX4N_MSK             BIT7
#define PWMEIOAUX2_AUX5P_MSK            BIT0
#define PWMEIOAUX2_AUX6P_MSK            BIT2
#define PWME_EnoCtrlPWM1P()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX1P_MSK)
#define PWME_EnoBrkCtrlPWM1P()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX1P_MSK)
#define PWME_EnoCtrlPWM1N()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX1N_MSK)
#define PWME_EnoBrkCtrlPWM1N()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX1N_MSK)
#define PWME_EnoCtrlPWM2P()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX2P_MSK)
#define PWME_EnoBrkCtrlPWM2P()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX2P_MSK)
#define PWME_EnoCtrlPWM2N()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX2N_MSK)
#define PWME_EnoBrkCtrlPWM2N()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX2N_MSK)
#define PWME_EnoCtrlPWM3P()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX3P_MSK)
#define PWME_EnoBrkCtrlPWM3P()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX3P_MSK)
#define PWME_EnoCtrlPWM3N()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX3N_MSK)
#define PWME_EnoBrkCtrlPWM3N()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX3N_MSK)
#define PWME_EnoCtrlPWM4P()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX4P_MSK)
#define PWME_EnoBrkCtrlPWM4P()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX4P_MSK)
#define PWME_EnoCtrlPWM4N()             CLR_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX4N_MSK)
#define PWME_EnoBrkCtrlPWM4N()          SET_REG_BIT(PWME_IOAUX, PWMEIOAUX_AUX4N_MSK)
#define PWME_EnoCtrlPWM5P()             CLR_REG_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX5P_MSK)
#define PWME_EnoBrkCtrlPWM5P()          SET_REG_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX5P_MSK)
#define PWME_EnoCtrlPWM6P()             CLR_REG_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX6P_MSK)
#define PWME_EnoBrkCtrlPWM6P()          SET_REG_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX6P_MSK)

#define HSPWME_EnoCtrlPWM1P()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX1P_MSK)
#define HSPWME_EnoBrkCtrlPWM1P()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX1P_MSK)
#define HSPWME_EnoCtrlPWM1N()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX1N_MSK)
#define HSPWME_EnoBrkCtrlPWM1N()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX1N_MSK)
#define HSPWME_EnoCtrlPWM2P()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX2P_MSK)
#define HSPWME_EnoBrkCtrlPWM2P()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX2P_MSK)
#define HSPWME_EnoCtrlPWM2N()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX2N_MSK)
#define HSPWME_EnoBrkCtrlPWM2N()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX2N_MSK)
#define HSPWME_EnoCtrlPWM3P()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX3P_MSK)
#define HSPWME_EnoBrkCtrlPWM3P()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX3P_MSK)
#define HSPWME_EnoCtrlPWM3N()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX3N_MSK)
#define HSPWME_EnoBrkCtrlPWM3N()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX3N_MSK)
#define HSPWME_EnoCtrlPWM4P()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX4P_MSK)
#define HSPWME_EnoBrkCtrlPWM4P()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX4P_MSK)
#define HSPWME_EnoCtrlPWM4N()           CLR_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX4N_MSK)
#define HSPWME_EnoBrkCtrlPWM4N()        SET_HSPWME_BIT(PWME_IOAUX, PWMEIOAUX_AUX4N_MSK)
#define HSPWME_EnoCtrlPWM5P()           CLR_HSPWME_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX5P_MSK)
#define HSPWME_EnoBrkCtrlPWM5P()        SET_HSPWME_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX5P_MSK)
#define HSPWME_EnoCtrlPWM6P()           CLR_HSPWME_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX6P_MSK)
#define HSPWME_EnoBrkCtrlPWM6P()        SET_HSPWME_BIT(PWME_IOAUX2, PWMEIOAUX2_AUX6P_MSK)

#define PWMECR1_ARPE_MSK                BIT7
#define PWME_UnbufferARR()              CLR_REG_BIT(PWME_CR1, PWMECR1_ARPE_MSK)
#define PWME_BufferARR()                SET_REG_BIT(PWME_CR1, PWMECR1_ARPE_MSK)

