fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWME_UnbufferARR()            CLR_HSPWME_BIT(PWME_CR1, PWMECR1_ARPE_MSK)
#define HSPWME_BufferARR()              SET_HSPWME_BIT(PWME_CR1, PWMECR1_ARPE_MSK)

#define PWMECR1_CMS_MSK                 (BIT6 | BIT5)
#define PWME_SetAlignMode(n)            MODIFY_REG(PWME_CR1,  PWMECR1_CMS_MSK, ((n) << 5))
#define PWME_EdgeAlignMode()            PWME_SetAlignMode(0)
#define PWME_CenterAlignMode1()         PWME_SetAlignMode(1)
#define PWME_CenterAlignMode2()         PWME_SetAlignMode(2)
#define PWME_CenterAlignMode3()         PWME_SetAlignMode(3)

#define HSPWME_SetAlignMode(n)          MODIFY_HSPWME(PWME_CR1,  PWMECR1_CMS_MSK, ((n) << 5))
#define HSPWME_EdgeAlignMode()          HSPWME_SetAlignMode(0)
#define HSPWME_CenterAlignMode1()       HSPWME_SetAlignMode(1)
#define HSPWME_CenterAlignMode2()       HSPWME_SetAlignMode(2)
#define HSPWME_CenterAlignMode3()       HSPWME_SetAlignMode(3)

#define PWMECR1_DIR_MSK                 BIT4
#define PWME_UpCounter()                CLR_REG_BIT(PWME_CR1, PWMECR1_DIR_MSK)
#define PWME_DownCounter()              SET_REG_BIT(PWME_CR1, PWMECR1_DIR_MSK)

#define HSPWME_UpCounter()              CLR_HSPWME_BIT(PWME_CR1, PWMECR1_DIR_MSK)
#define HSPWME_DownCounter()            SET_HSPWME_BIT(PWME_CR1, PWMECR1_DIR_MSK)

#define PWMECR1_OPM_MSK                 BIT3
#define PWME_ContinueMode()             CLR_REG_BIT(PWME_CR1, PWMECR1_OPM_MSK)
#define PWME_OnePulseMode()             SET_REG_BIT(PWME_CR1, PWMECR1_OPM_MSK)

#define HSPWME_ContinueMode()           CLR_HSPWME_BIT(PWME_CR1, PWMECR1_OPM_MSK)
#define HSPWME_OnePulseMode()           SET_HSPWME_BIT(PWME_CR1, PWMECR1_OPM_MSK)

#define PWMECR1_URS_MSK                 BIT2
#define PWME_UpdateRequestMode1()       SET_REG_BIT(PWME_CR1, PWMECR1_URS_MSK)
#define PWME_UpdateRequestMode2()       CLR_REG_BIT(PWME_CR1, PWMECR1_URS_MSK)

#define HSPWME_UpdateRequestMode1()     SET_HSPWME_BIT(PWME_CR1, PWMECR1_URS_MSK)
#define HSPWME_UpdateRequestMode2()     CLR_HSPWME_BIT(PWME_CR1, PWMECR1_URS_MSK)

#define PWMECR1_UDIS_MSK                BIT1
#define PWME_EnableUpdate()             CLR_REG_BIT(PWME_CR1, PWMECR1_UDIS_MSK)
#define PWME_DisableUpdate()            SET_REG_BIT(PWME_CR1, PWMECR1_UDIS_MSK)

#define HSPWME_EnableUpdate()           CLR_HSPWME_BIT(PWME_CR1, PWMECR1_UDIS_MSK)
#define HSPWME_DisableUpdate()          SET_HSPWME_BIT(PWME_CR1, PWMECR1_UDIS_MSK)

#define PWMECR1_CEN_MSK                 BIT0
#define PWME_Run()                      SET_REG_BIT(PWME_CR1, PWMECR1_CEN_MSK)
#define PWME_Stop()                     CLR_REG_BIT(PWME_CR1, PWMECR1_CEN_MSK)

#define HSPWME_Run()                    SET_HSPWME_BIT(PWME_CR1, PWMECR1_CEN_MSK)
#define HSPWME_Stop()                   CLR_HSPWME_BIT(PWME_CR1, PWMECR1_CEN_MSK)

#define PWMECR2_TIS_MSK                 BIT7
#define PWME_PWM1PToTI()                CLR_REG_BIT(PWME_CR2, PWMECR2_TIS_MSK)
#define PWME_Xor1P2P3PToTI()            SET_REG_BIT(PWME_CR2, PWMECR2_TIS_MSK)

#define HSPWME_PWM1PToTI()              CLR_HSPWME_BIT(PWME_CR2, PWMECR2_TIS_MSK)
#define HSPWME_Xor1P2P3PToTI()          SET_HSPWME_BIT(PWME_CR2, PWMECR2_TIS_MSK)

#define PWMECR2_MMS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWME_SelectTRGO(n)              MODIFY_REG(PWME_CR2,  PWMECR2_MMS_MSK, ((n) << 4))
#define PWME_ResetAsTRGO()              PWME_SelectTRGO(0)
#define PWME_EnableAsTRGO()             PWME_SelectTRGO(1)
#define PWME_UpdateAsTRGO()             PWME_SelectTRGO(2)
#define PWME_MatchAsTRGO()              PWME_SelectTRGO(3)
#define PWME_OC1REFAsTRGO()             PWME_SelectTRGO(4)
#define PWME_OC2REFAsTRGO()             PWME_SelectTRGO(5)
#define PWME_OC3REFAsTRGO()             PWME_SelectTRGO(6)
#define PWME_OC4REFAsTRGO()             PWME_SelectTRGO(7)

#define HSPWME_SelectTRGO(n)            MODIFY_HSPWME(PWME_CR2,  PWMECR2_MMS_MSK, ((n) << 4))
#define HSPWME_ResetAsTRGO()            HSPWME_SelectTRGO(0)
#define HSPWME_EnableAsTRGO()           HSPWME_SelectTRGO(1)
#define HSPWME_UpdateAsTRGO()           HSPWME_SelectTRGO(2)
#define HSPWME_MatchAsTRGO()            HSPWME_SelectTRGO(3)
#define HSPWME_OC1REFAsTRGO()           HSPWME_SelectTRGO(4)
#define HSPWME_OC2REFAsTRGO()           HSPWME_SelectTRGO(5)
#define HSPWME_OC3REFAsTRGO()           HSPWME_SelectTRGO(6)
#define HSPWME_OC4REFAsTRGO()           HSPWME_SelectTRGO(7)

#define PWMECR2_COMS_MSK                BIT2
#define PWME_CCOCUpdateMode0()          CLR_REG_BIT(PWME_CR2, PWMECR2_COMS_MSK)
#define PWME_CCOCUpdateMode1()          SET_REG_BIT(PWME_CR2, PWMECR2_COMS_MSK)

#define HSPWME_CCOCUpdateMode0()        CLR_HSPWME_BIT(PWME_CR2, PWMECR2_COMS_MSK)
#define HSPWME_CCOCUpdateMode1()        SET_HSPWME_BIT(PWME_CR2, PWMECR2_COMS_MSK)

#define PWMECR2_CCPC_MSK                BIT0
#define PWME_UnbufferCCOC()             CLR_REG_BIT(PWME_CR2, PWMECR2_CCPC_MSK)
#define PWME_BufferCCOC()               SET_REG_BIT(PWME_CR2, PWMECR2_CCPC_MSK)

#define HSPWME_UnbufferCCOC()           CLR_HSPWME_BIT(PWME_CR2, PWMECR2_CCPC_MSK)
#define HSPWME_BufferCCOC()             SET_HSPWME_BIT(PWME_CR2, PWMECR2_CCPC_MSK)

#define PWMESMCR_MSM_MSK                BIT7
#define PWME_StandaloneMode()           CLR_REG_BIT(PWME_SMCR, PWMESMCR_MSM_MSK)
#define PWME_MasterSlaveMode()          SET_REG_BIT(PWME_SMCR, PWMESMCR_MSM_MSK)

#define HSPWME_StandaloneMode()         CLR_HSPWME_BIT(PWME_SMCR, PWMESMCR_MSM_MSK)
#define HSPWME_MasterSlaveMode()        SET_HSPWME_BIT(PWME_SMCR, PWMESMCR_MSM_MSK)

#define PWMESMCR_TS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWME_SelectTRGI(n)              MODIFY_REG(PWME_SMCR,  PWMESMCR_TS_MSK, ((n) << 4))
#define PWME_DisableTRGI()              PWME_SelectTRGI(0)
#define PWME_ITR2AsTRGI()               PWME_SelectTRGI(2)
#define PWME_TI1FEDAsTRGI()             PWME_SelectTRGI(4)
#define PWME_TI1FP1AsTRGI()             PWME_SelectTRGI(5)
#define PWME_TI2FP2AsTRGI()             PWME_SelectTRGI(6)
#define PWME_ETRFAsTRGI()               PWME_SelectTRGI(7)

#define HSPWME_SelectTRGI(n)            MODIFY_HSPWME(PWME_SMCR,  PWMESMCR_TS_MSK, ((n) << 4))
#define HSPWME_DisableTRGI()            HSPWME_SelectTRGI(0)
#define HSPWME_ITR2AsTRGI()             HSPWME_SelectTRGI(2)
#define HSPWME_TI1FEDAsTRGI()           HSPWME_SelectTRGI(4)
#define HSPWME_TI1FP1AsTRGI()           HSPWME_SelectTRGI(5)
#define HSPWME_TI2FP2AsTRGI()           HSPWME_SelectTRGI(6)
#define HSPWME_ETRFAsTRGI()             HSPWME_SelectTRGI(7)

#define PWMESMCR_SMS_MSK                (BIT2 | BIT1 | BIT0)
#define PWME_SetClockMode(n)            MODIFY_REG(PWME_SMCR,  PWMESMCR_SMS_MSK, ((n) << 0))
#define PWME_InternalClockMode()        PWME_SetClockMode(0)
#define PWME_EncoderMode1()             PWME_SetClockMode(1)
#define PWME_EncoderMode2()             PWME_SetClockMode(2)
#define PWME_EncoderMode3()             PWME_SetClockMode(3)
#define PWME_TriggerResetMode()         PWME_SetClockMode(4)
#define PWME_TriggerGateMode()          PWME_SetClockMode(5)
#define PWME_TriggerStartMode()         PWME_SetClockMode(6)
#define PWME_ExternalClockMode()        PWME_SetClockMode(7)

#define HSPWME_SetClockMode(n)          MODIFY_HSPWME(PWME_SMCR,  PWMESMCR_SMS_MSK, ((n) << 0))
#define HSPWME_InternalClockMode()      HSPWME_SetClockMode(0)
#define HSPWME_EncoderMode1()           HSPWME_SetClockMode(1)
#define HSPWME_EncoderMode2()           HSPWME_SetClockMode(2)
#define HSPWME_EncoderMode3()           HSPWME_SetClockMode(3)
#define HSPWME_TriggerResetMode()       HSPWME_SetClockMode(4)
#define HSPWME_TriggerGateMode()        HSPWME_SetClockMode(5)
#define HSPWME_TriggerStartMode()       HSPWME_SetClockMode(6)
#define HSPWME_ExternalClockMode()      HSPWME_SetClockMode(7)

#define PWMEETR_ETP_MSK                 BIT7
#define PWME_ETRNonInverted()           CLR_REG_BIT(PWME_ETR, PWMEETR_ETP_MSK)
#define PWME_ETRInverted()              SET_REG_BIT(PWME_ETR, PWMEETR_ETP_MSK)

#define HSPWME_ETRNonInverted()         CLR_HSPWME_BIT(PWME_ETR, PWMEETR_ETP_MSK)
#define HSPWME_ETRInverted()            SET_HSPWME_BIT(PWME_ETR, PWMEETR_ETP_MSK)

#define PWMEETR_ECE_MSK                 BIT6
#define PWME_DisableExternalClock2()    CLR_REG_BIT(PWME_ETR, PWMEETR_ECE_MSK)
#define PWME_EnableExternalClock2()     SET_REG_BIT(PWME_ETR, PWMEETR_ECE_MSK)

#define HSPWME_DisableExternalClock2()  CLR_HSPWME_BIT(PWME_ETR, PWMEETR_ECE_MSK)
#define HSPWME_EnableExternalClock2()   SET_HSPWME_BIT(PWME_ETR, PWMEETR_ECE_MSK)

#define PWMEETR_ETPS_MSK                (BIT5 | BIT4)
#define PWME_SetETRDivider(n)           MODIFY_REG(PWME_ETR,  PWMEETR_ETPS_MSK, ((n) << 4))
#define PWME_ETRDivider1()              PWME_SetETRDivider(0)
#define PWME_ETRDivider2()              PWME_SetETRDivider(1)
#define PWME_ETRDivider4()              PWME_SetETRDivider(2)
#define PWME_ETRDivider8()              PWME_SetETRDivider(3)

#define HSPWME_SetETRDivider(n)         MODIFY_HSPWME(PWME_ETR,  PWMEETR_ETPS_MSK, ((n) << 4))
#define HSPWME_ETRDivider1()            HSPWME_SetETRDivider(0)
#define HSPWME_ETRDivider2()            HSPWME_SetETRDivider(1)
#define HSPWME_ETRDivider4()            HSPWME_SetETRDivider(2)
#define HSPWME_ETRDivider8()            HSPWME_SetETRDivider(3)

#define PWMEETR_ETF_MSK                 (BIT_LN)
#define PWME_SetETRFilter(n)            MODIFY_REG(PWME_ETR,  PWMEETR_ETF_MSK, ((n) << 0))
#define PWME_ETRFilter1()               PWME_SetETRFilter(0)
#define PWME_ETRFilter2()               PWME_SetETRFilter(1)
#define PWME_ETRFilter4()               PWME_SetETRFilter(2)
#define PWME_ETRFilter8()               PWME_SetETRFilter(3)
#define PWME_ETRFilter12()              PWME_SetETRFilter(4)
#define PWME_ETRFilter16()              PWME_SetETRFilter(5)
#define PWME_ETRFilter24()              PWME_SetETRFilter(6)
#define PWME_ETRFilter32()              PWME_SetETRFilter(7)
#define PWME_ETRFilter48()              PWME_SetETRFilter(8)
#define PWME_ETRFilter64()              PWME_SetETRFilter(9)
#define PWME_ETRFilter80()              PWME_SetETRFilter(10)
#define PWME_ETRFilter96()              PWME_SetETRFilter(11)
#define PWME_ETRFilter128()             PWME_SetETRFilter(12)
#define PWME_ETRFilter160()             PWME_SetETRFilter(13)
#define PWME_ETRFilter192()             PWME_SetETRFilter(14)
#define PWME_ETRFilter256()             PWME_SetETRFilter(15)

#define HSPWME_SetETRFilter(n)          MODIFY_HSPWME(PWME_ETR,  PWMEETR_ETF_MSK, ((n) << 0))
#define HSPWME_ETRFilter1()             HSPWME_SetETRFilter(0)
#define HSPWME_ETRFilter2()             HSPWME_SetETRFilter(1)
#define HSPWME_ETRFilter4()             HSPWME_SetETRFilter(2)
#define HSPWME_ETRFilter8()             HSPWME_SetETRFilter(3)
#define HSPWME_ETRFilter12()            HSPWME_SetETRFilter(4)
#define HSPWME_ETRFilter16()            HSPWME_SetETRFilter(5)
#define HSPWME_ETRFilter24()            HSPWME_SetETRFilter(6)
#define HSPWME_ETRFilter32()            HSPWME_SetETRFilter(7)
#define HSPWME_ETRFilter48()            HSPWME_SetETRFilter(8)
#define HSPWME_ETRFilter64()            HSPWME_SetETRFilter(9)
#define HSPWME_ETRFilter80()            HSPWME_SetETRFilter(10)
#define HSPWME_ETRFilter96()            HSPWME_SetETRFilter(11)
#define HSPWME_ETRFilter128()           HSPWME_SetETRFilter(12)
#define HSPWME_ETRFilter160()           HSPWME_SetETRFilter(13)
#define HSPWME_ETRFilter192()           HSPWME_SetETRFilter(14)
#define HSPWME_ETRFilter256()           HSPWME_SetETRFilter(15)

#define PWMEEGR_BG_MSK                  BIT7
#define PWMEEGR_TG_MSK                  BIT6
#define PWMEEGR_COMG_MSK                BIT5
#define PWMEEGR_CC4G_MSK                BIT4
#define PWMEEGR_CC3G_MSK                BIT3
#define PWMEEGR_CC2G_MSK                BIT2
#define PWMEEGR_CC1G_MSK                BIT1
#define PWMEEGR_UG_MSK                  BIT0
#define PWME_GenerateBreakEvent()       SET_REG_BIT(PWME_EGR, PWMEEGR_BG_MSK)
#define PWME_GenerateTriggerEvent()     SET_REG_BIT(PWME_EGR, PWMEEGR_TG_MSK)
#define PWME_GenerateCOMEvent()         SET_REG_BIT(PWME_EGR, PWMEEGR_COMG_MSK)
#define PWME_GenerateCC4Event()         SET_REG_BIT(PWME_EGR, PWMEEGR_CC4G_MSK)
#define PWME_GenerateCC3Event()         SET_REG_BIT(PWME_EGR, PWMEEGR_CC3G_MSK)
#define PWME_GenerateCC2Event()         SET_REG_BIT(PWME_EGR, PWMEEGR_CC2G_MSK)
#define PWME_GenerateCC1Event()         SET_REG_BIT(PWME_EGR, PWMEEGR_CC1G_MSK)
#define PWME_GenerateUpdateEvent()      SET_REG_BIT(PWME_EGR, PWMEEGR_UG_MSK)

#define HSPWME_GenerateBreakEvent()     SET_HSPWME_BIT(PWME_EGR, PWMEEGR_BG_MSK)
#define HSPWME_GenerateTriggerEvent()   SET_HSPWME_BIT(PWME_EGR, PWMEEGR_TG_MSK)
#define HSPWME_GenerateCOMEvent()       SET_HSPWME_BIT(PWME_EGR, PWMEEGR_COMG_MSK)
#define HSPWME_GenerateCC4Event()       SET_HSPWME_BIT(PWME_EGR, PWMEEGR_CC4G_MSK)
#define HSPWME_GenerateCC3Event()       SET_HSPWME_BIT(PWME_EGR, PWMEEGR_CC3G_MSK)
#define HSPWME_GenerateCC2Event()       SET_HSPWME_BIT(PWME_EGR, PWMEEGR_CC2G_MSK)
#define HSPWME_GenerateCC1Event()       SET_HSPWME_BIT(PWME_EGR, PWMEEGR_CC1G_MSK)
#define HSPWME_GenerateUpdateEvent()    SET_HSPWME_BIT(PWME_EGR, PWMEEGR_UG_MSK)

#define PWMECCMR1_OC1CE_MSK             BIT7
#define PWME_EnableETRFClearOC1REF()    SET_REG_BIT(PWME_CCMR1, PWMECCMR1_OC1CE_MSK)
#define PWME_DisableETRFClearOC1REF()   CLR_REG_BIT(PWME_CCMR1, PWMECCMR1_OC1CE_MSK)

#define HSPWME_EnableETRFClearOC1REF()  SET_HSPWME_BIT(PWME_CCMR1, PWMECCMR1_OC1CE_MSK)
#define HSPWME_DisableETRFClearOC1REF() CLR_HSPWME_BIT(PWME_CCMR1, PWMECCMR1_OC1CE_MSK)

#define PWMECCMR1_OC1M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMECCMR1X_OC1M3_MSK            BIT0
#define PWME_SetOC1OutputMode(n)        MODIFY_REG(PWME_CCMR1,  PWMECCMR1_OC1M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWME_CCMR1X, PWMECCMR1X_OC1M3_MSK, (((n) >> 3) << 0))
#define PWME_OC1REFFrozen()             PWME_SetOC1OutputMode(0)
#define PWME_OC1REFHighIfMatch()        PWME_SetOC1OutputMode(1)
#define PWME_OC1REFLowIfMatch()         PWME_SetOC1OutputMode(2)
#define PWME_OC1REFToggleIfMatch()      PWME_SetOC1OutputMode(3)
#define PWME_OC1REFForceLow()           PWME_SetOC1OutputMode(4)
#define PWME_OC1REFForceHigh()          PWME_SetOC1OutputMode(5)
#define PWME_OC1REFPWMMode1()           PWME_SetOC1OutputMode(6)
#define PWME_OC1REFPWMMode2()           PWME_SetOC1OutputMode(7)
#define PWME_OC1REFReTrigOPMPWM1()      PWME_SetOC1OutputMode(8)
#define PWME_OC1REFReTrigOPMPWM2()      PWME_SetOC1OutputMode(9)
#define PWME_OC1REFCombinedPWM1()       PWME_SetOC1OutputMode(12)
#define PWME_OC1REFCombinedPWM2()       PWME_SetOC1OutputMode(13)
#define PWME_OC1REFAsymmetricPWM1()     PWME_SetOC1OutputMode(14)
#define PWME_OC1REFAsymmetricPWM2()     PWME_SetOC1OutputMode(15)

#define HSPWME_SetOC1OutputMode(n)      MODIFY_HSPWME(PWME_CCMR1,  PWMECCMR1_OC1M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWME(PWME_CCMR1X, PWMECCMR1X_OC1M3_MSK, (((n) >> 3) << 0))
#define HSPWME_OC1REFFrozen()           HSPWME_SetOC1OutputMode(0)
#define HSPWME_OC1REFHighIfMatch()      HSPWME_SetOC1OutputMode(1)
#define HSPWME_OC1REFLowIfMatch()       HSPWME_SetOC1OutputMode(2)
#define HSPWME_OC1REFToggleIfMatch()    HSPWME_SetOC1OutputMode(3)
#define HSPWME_OC1REFForceLow()         HSPWME_SetOC1OutputMode(4)
#define HSPWME_OC1REFForceHigh()        HSPWME_SetOC1OutputMode(5)
#define HSPWME_OC1REFPWMMode1()         HSPWME_SetOC1OutputMode(6)
#define HSPWME_OC1REFPWMMode2()         HSPWME_SetOC1OutputMode(7)
#define HSPWME_OC1REFReTrigOPMPWM1()    HSPWME_SetOC1OutputMode(8)
#define HSPWME_OC1REFReTrigOPMPWM2()    HSPWME_SetOC1OutputMode(9)
#define HSPWME_OC1REFCombinedPWM1()     HSPWME_SetOC1OutputMode(12)
#define HSPWME_OC1REFCombinedPWM2()     HSPWME_SetOC1OutputMode(13)
#define HSPWME_OC1REFAsymmetricPWM1()   HSPWME_SetOC1OutputMode(14)
#define HSPWME_OC1REFAsymmetricPWM2()   HSPWME_SetOC1OutputMode(15)

#define PWMECCMR1_OC1PE_MSK             BIT3
#define PWME_UnbufferCCR1()             CLR_REG_BIT(PWME_CCMR1, PWMECCMR1_OC1PE_MSK)
#define PWME_BufferCCR1()               SET_REG_BIT(PWME_CCMR1, PWMECCMR1_OC1PE_MSK)

#define HSPWME_UnbufferCCR1()           CLR_HSPWME_BIT(PWME_CCMR1, PWMECCMR1_OC1PE_MSK)
#define HSPWME_BufferCCR1()             SET_HSPWME_BIT(PWME_CCMR1, PWMECCMR1_OC1PE_MSK)

#define PWMECCMR1_OC1FE_MSK             BIT2
#define PWME_DisableOC1FastMode()       CLR_REG_BIT(PWME_CCMR1, PWMECCMR1_OC1FE_MSK)
#define PWME_EnableOC1FastMode()        SET_REG_BIT(PWME_CCMR1, PWMECCMR1_OC1FE_MSK)

#define HSPWME_DisableOC1FastMode()     CLR_HSPWME_BIT(PWME_CCMR1, PWMECCMR1_OC1FE_MSK)
#define HSPWME_EnableOC1FastMode()      SET_HSPWME_BIT(PWME_CCMR1, PWMECCMR1_OC1FE_MSK)

#define PWMECCMR1_CC1S_MSK              (BIT1 | BIT0)
#define PWME_SetCC1Mode(n)              MODIFY_REG(PWME_CCMR1,  PWMECCMR1_CC1S_MSK, ((n) << 0))
#define PWME_CC1Output()                PWME_SetCC1Mode(0)
#define PWME_CC1CaptureTI1FP1()         PWME_SetCC1Mode(1)
#define PWME_CC1CaptureTI2FP1()         PWME_SetCC1Mode(2)
#define PWME_CC1CaptureTRC()            PWME_SetCC1Mode(3)

