fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWME_SetCC1Mode(n)            MODIFY_HSPWME(PWME_CCMR1,  PWMECCMR1_CC1S_MSK, ((n) << 0))
#define HSPWME_CC1Output()              HSPWME_SetCC1Mode(0)
#define HSPWME_CC1CaptureTI1FP1()       HSPWME_SetCC1Mode(1)
#define HSPWME_CC1CaptureTI2FP1()       HSPWME_SetCC1Mode(2)
#define HSPWME_CC1CaptureTRC()          HSPWME_SetCC1Mode(3)

#define PWMECCMR1_IC1F_MSK              (BIT_HN)
#define PWME_SetIC1Filter(n)            MODIFY_REG(PWME_CCMR1,  PWMECCMR1_IC1F_MSK, ((n) << 4))
#define PWME_IC1Filter1()               PWME_SetIC1Filter(0)
#define PWME_IC1Filter2()               PWME_SetIC1Filter(1)
#define PWME_IC1Filter4()               PWME_SetIC1Filter(2)
#define PWME_IC1Filter8()               PWME_SetIC1Filter(3)
#define PWME_IC1Filter12()              PWME_SetIC1Filter(4)
#define PWME_IC1Filter16()              PWME_SetIC1Filter(5)
#define PWME_IC1Filter24()              PWME_SetIC1Filter(6)
#define PWME_IC1Filter32()              PWME_SetIC1Filter(7)
#define PWME_IC1Filter48()              PWME_SetIC1Filter(8)
#define PWME_IC1Filter64()              PWME_SetIC1Filter(9)
#define PWME_IC1Filter80()              PWME_SetIC1Filter(10)
#define PWME_IC1Filter96()              PWME_SetIC1Filter(11)
#define PWME_IC1Filter128()             PWME_SetIC1Filter(12)
#define PWME_IC1Filter160()             PWME_SetIC1Filter(13)
#define PWME_IC1Filter192()             PWME_SetIC1Filter(14)
#define PWME_IC1Filter256()             PWME_SetIC1Filter(15)

#define HSPWME_SetIC1Filter(n)          MODIFY_HSPWME(PWME_CCMR1,  PWMECCMR1_IC1F_MSK, ((n) << 4))
#define HSPWME_IC1Filter1()             HSPWME_SetIC1Filter(0)
#define HSPWME_IC1Filter2()             HSPWME_SetIC1Filter(1)
#define HSPWME_IC1Filter4()             HSPWME_SetIC1Filter(2)
#define HSPWME_IC1Filter8()             HSPWME_SetIC1Filter(3)
#define HSPWME_IC1Filter12()            HSPWME_SetIC1Filter(4)
#define HSPWME_IC1Filter16()            HSPWME_SetIC1Filter(5)
#define HSPWME_IC1Filter24()            HSPWME_SetIC1Filter(6)
#define HSPWME_IC1Filter32()            HSPWME_SetIC1Filter(7)
#define HSPWME_IC1Filter48()            HSPWME_SetIC1Filter(8)
#define HSPWME_IC1Filter64()            HSPWME_SetIC1Filter(9)
#define HSPWME_IC1Filter80()            HSPWME_SetIC1Filter(10)
#define HSPWME_IC1Filter96()            HSPWME_SetIC1Filter(11)
#define HSPWME_IC1Filter128()           HSPWME_SetIC1Filter(12)
#define HSPWME_IC1Filter160()           HSPWME_SetIC1Filter(13)
#define HSPWME_IC1Filter192()           HSPWME_SetIC1Filter(14)
#define HSPWME_IC1Filter256()           HSPWME_SetIC1Filter(15)

#define PWMECCMR1_IC1PS_MSK             (BIT3 | BIT2)
#define PWME_SetIC1Divider(n)           MODIFY_REG(PWME_CCMR1,  PWMECCMR1_IC1PS_MSK, ((n) << 2))
#define PWME_IC1Divider1()              PWME_SetIC1Divider(0)
#define PWME_IC1Divider2()              PWME_SetIC1Divider(1)
#define PWME_IC1Divider4()              PWME_SetIC1Divider(2)
#define PWME_IC1Divider8()              PWME_SetIC1Divider(3)

#define HSPWME_SetIC1Divider(n)         MODIFY_HSPWME(PWME_CCMR1,  PWMECCMR1_IC1PS_MSK, ((n) << 2))
#define HSPWME_IC1Divider1()            HSPWME_SetIC1Divider(0)
#define HSPWME_IC1Divider2()            HSPWME_SetIC1Divider(1)
#define HSPWME_IC1Divider4()            HSPWME_SetIC1Divider(2)
#define HSPWME_IC1Divider8()            HSPWME_SetIC1Divider(3)

#define PWMECCMR2_OC2CE_MSK             BIT7
#define PWME_EnableETRFClearOC2REF()    SET_REG_BIT(PWME_CCMR2, PWMECCMR2_OC2CE_MSK)
#define PWME_DisableETRFClearOC2REF()   CLR_REG_BIT(PWME_CCMR2, PWMECCMR2_OC2CE_MSK)

#define HSPWME_EnableETRFClearOC2REF()  SET_HSPWME_BIT(PWME_CCMR2, PWMECCMR2_OC2CE_MSK)
#define HSPWME_DisableETRFClearOC2REF() CLR_HSPWME_BIT(PWME_CCMR2, PWMECCMR2_OC2CE_MSK)

#define PWMECCMR2_OC2M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMECCMR2X_OC2M3_MSK            BIT0
#define PWME_SetOC2OutputMode(n)        MODIFY_REG(PWME_CCMR2,  PWMECCMR2_OC2M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWME_CCMR2X, PWMECCMR2X_OC2M3_MSK, (((n) >> 3) << 0))
#define PWME_OC2REFFrozen()             PWME_SetOC2OutputMode(0)
#define PWME_OC2REFHighIfMatch()        PWME_SetOC2OutputMode(1)
#define PWME_OC2REFLowIfMatch()         PWME_SetOC2OutputMode(2)
#define PWME_OC2REFToggleIfMatch()      PWME_SetOC2OutputMode(3)
#define PWME_OC2REFForceLow()           PWME_SetOC2OutputMode(4)
#define PWME_OC2REFForceHigh()          PWME_SetOC2OutputMode(5)
#define PWME_OC2REFPWMMode1()           PWME_SetOC2OutputMode(6)
#define PWME_OC2REFPWMMode2()           PWME_SetOC2OutputMode(7)
#define PWME_OC2REFReTrigOPMPWM1()      PWME_SetOC2OutputMode(8)
#define PWME_OC2REFReTrigOPMPWM2()      PWME_SetOC2OutputMode(9)
#define PWME_OC2REFCombinedPWM1()       PWME_SetOC2OutputMode(12)
#define PWME_OC2REFCombinedPWM2()       PWME_SetOC2OutputMode(13)
#define PWME_OC2REFAsymmetricPWM1()     PWME_SetOC2OutputMode(14)
#define PWME_OC2REFAsymmetricPWM2()     PWME_SetOC2OutputMode(15)

#define HSPWME_SetOC2OutputMode(n)      MODIFY_HSPWME(PWME_CCMR2,  PWMECCMR2_OC2M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWME(PWME_CCMR2X, PWMECCMR2X_OC2M3_MSK, (((n) >> 3) << 0))
#define HSPWME_OC2REFFrozen()           HSPWME_SetOC2OutputMode(0)
#define HSPWME_OC2REFHighIfMatch()      HSPWME_SetOC2OutputMode(1)
#define HSPWME_OC2REFLowIfMatch()       HSPWME_SetOC2OutputMode(2)
#define HSPWME_OC2REFToggleIfMatch()    HSPWME_SetOC2OutputMode(3)
#define HSPWME_OC2REFForceLow()         HSPWME_SetOC2OutputMode(4)
#define HSPWME_OC2REFForceHigh()        HSPWME_SetOC2OutputMode(5)
#define HSPWME_OC2REFPWMMode1()         HSPWME_SetOC2OutputMode(6)
#define HSPWME_OC2REFPWMMode2()         HSPWME_SetOC2OutputMode(7)
#define HSPWME_OC2REFReTrigOPMPWM1()    HSPWME_SetOC2OutputMode(8)
#define HSPWME_OC2REFReTrigOPMPWM2()    HSPWME_SetOC2OutputMode(9)
#define HSPWME_OC2REFCombinedPWM1()     HSPWME_SetOC2OutputMode(12)
#define HSPWME_OC2REFCombinedPWM2()     HSPWME_SetOC2OutputMode(13)
#define HSPWME_OC2REFAsymmetricPWM1()   HSPWME_SetOC2OutputMode(14)
#define HSPWME_OC2REFAsymmetricPWM2()   HSPWME_SetOC2OutputMode(15)

#define PWMECCMR2_OC2PE_MSK             BIT3
#define PWME_UnbufferCCR2()             CLR_REG_BIT(PWME_CCMR2, PWMECCMR2_OC2PE_MSK)
#define PWME_BufferCCR2()               SET_REG_BIT(PWME_CCMR2, PWMECCMR2_OC2PE_MSK)

#define HSPWME_UnbufferCCR2()           CLR_HSPWME_BIT(PWME_CCMR2, PWMECCMR2_OC2PE_MSK)
#define HSPWME_BufferCCR2()             SET_HSPWME_BIT(PWME_CCMR2, PWMECCMR2_OC2PE_MSK)

#define PWMECCMR2_OC2FE_MSK             BIT2
#define PWME_DisableOC2FastMode()       CLR_REG_BIT(PWME_CCMR2, PWMECCMR2_OC2FE_MSK)
#define PWME_EnableOC2FastMode()        SET_REG_BIT(PWME_CCMR2, PWMECCMR2_OC2FE_MSK)

#define HSPWME_DisableOC2FastMode()     CLR_HSPWME_BIT(PWME_CCMR2, PWMECCMR2_OC2FE_MSK)
#define HSPWME_EnableOC2FastMode()      SET_HSPWME_BIT(PWME_CCMR2, PWMECCMR2_OC2FE_MSK)

#define PWMECCMR2_CC2S_MSK              (BIT1 | BIT0)
#define PWME_SetCC2Mode(n)              MODIFY_REG(PWME_CCMR2,  PWMECCMR2_CC2S_MSK, ((n) << 0))
#define PWME_CC2Output()                PWME_SetCC2Mode(0)
#define PWME_CC2CaptureTI2FP2()         PWME_SetCC2Mode(1)
#define PWME_CC2CaptureTI1FP2()         PWME_SetCC2Mode(2)
#define PWME_CC2CaptureTRC()            PWME_SetCC2Mode(3)

#define HSPWME_SetCC2Mode(n)            MODIFY_HSPWME(PWME_CCMR2,  PWMECCMR2_CC2S_MSK, ((n) << 0))
#define HSPWME_CC2Output()              HSPWME_SetCC2Mode(0)
#define HSPWME_CC2CaptureTI2FP2()       HSPWME_SetCC2Mode(1)
#define HSPWME_CC2CaptureTI1FP2()       HSPWME_SetCC2Mode(2)
#define HSPWME_CC2CaptureTRC()          HSPWME_SetCC2Mode(3)

#define PWMECCMR2_IC2F_MSK              (BIT_HN)
#define PWME_SetIC2Filter(n)            MODIFY_REG(PWME_CCMR2,  PWMECCMR2_IC2F_MSK, ((n) << 4))
#define PWME_IC2Filter1()               PWME_SetIC2Filter(0)
#define PWME_IC2Filter2()               PWME_SetIC2Filter(1)
#define PWME_IC2Filter4()               PWME_SetIC2Filter(2)
#define PWME_IC2Filter8()               PWME_SetIC2Filter(3)
#define PWME_IC2Filter12()              PWME_SetIC2Filter(4)
#define PWME_IC2Filter16()              PWME_SetIC2Filter(5)
#define PWME_IC2Filter24()              PWME_SetIC2Filter(6)
#define PWME_IC2Filter32()              PWME_SetIC2Filter(7)
#define PWME_IC2Filter48()              PWME_SetIC2Filter(8)
#define PWME_IC2Filter64()              PWME_SetIC2Filter(9)
#define PWME_IC2Filter80()              PWME_SetIC2Filter(10)
#define PWME_IC2Filter96()              PWME_SetIC2Filter(11)
#define PWME_IC2Filter128()             PWME_SetIC2Filter(12)
#define PWME_IC2Filter160()             PWME_SetIC2Filter(13)
#define PWME_IC2Filter192()             PWME_SetIC2Filter(14)
#define PWME_IC2Filter256()             PWME_SetIC2Filter(15)

#define HSPWME_SetIC2Filter(n)          MODIFY_HSPWME(PWME_CCMR2,  PWMECCMR2_IC2F_MSK, ((n) << 4))
#define HSPWME_IC2Filter1()             HSPWME_SetIC2Filter(0)
#define HSPWME_IC2Filter2()             HSPWME_SetIC2Filter(1)
#define HSPWME_IC2Filter4()             HSPWME_SetIC2Filter(2)
#define HSPWME_IC2Filter8()             HSPWME_SetIC2Filter(3)
#define HSPWME_IC2Filter12()            HSPWME_SetIC2Filter(4)
#define HSPWME_IC2Filter16()            HSPWME_SetIC2Filter(5)
#define HSPWME_IC2Filter24()            HSPWME_SetIC2Filter(6)
#define HSPWME_IC2Filter32()            HSPWME_SetIC2Filter(7)
#define HSPWME_IC2Filter48()            HSPWME_SetIC2Filter(8)
#define HSPWME_IC2Filter64()            HSPWME_SetIC2Filter(9)
#define HSPWME_IC2Filter80()            HSPWME_SetIC2Filter(10)
#define HSPWME_IC2Filter96()            HSPWME_SetIC2Filter(11)
#define HSPWME_IC2Filter128()           HSPWME_SetIC2Filter(12)
#define HSPWME_IC2Filter160()           HSPWME_SetIC2Filter(13)
#define HSPWME_IC2Filter192()           HSPWME_SetIC2Filter(14)
#define HSPWME_IC2Filter256()           HSPWME_SetIC2Filter(15)

#define PWMECCMR2_IC2PS_MSK             (BIT3 | BIT2)
#define PWME_SetIC2Divider(n)           MODIFY_REG(PWME_CCMR2,  PWMECCMR2_IC2PS_MSK, ((n) << 2))
#define PWME_IC2Divider1()              PWME_SetIC2Divider(0)
#define PWME_IC2Divider2()              PWME_SetIC2Divider(1)
#define PWME_IC2Divider4()              PWME_SetIC2Divider(2)
#define PWME_IC2Divider8()              PWME_SetIC2Divider(3)

#define HSPWME_SetIC2Divider(n)         MODIFY_HSPWME(PWME_CCMR2,  PWMECCMR2_IC2PS_MSK, ((n) << 2))
#define HSPWME_IC2Divider1()            HSPWME_SetIC2Divider(0)
#define HSPWME_IC2Divider2()            HSPWME_SetIC2Divider(1)
#define HSPWME_IC2Divider4()            HSPWME_SetIC2Divider(2)
#define HSPWME_IC2Divider8()            HSPWME_SetIC2Divider(3)

