fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMECCMR3_OC3CE_MSK             BIT7
#define PWME_EnableETRFClearOC3REF()    SET_REG_BIT(PWME_CCMR3, PWMECCMR3_OC3CE_MSK)
#define PWME_DisableETRFClearOC3REF()   CLR_REG_BIT(PWME_CCMR3, PWMECCMR3_OC3CE_MSK)

#define HSPWME_EnableETRFClearOC3REF()  SET_HSPWME_BIT(PWME_CCMR3, PWMECCMR3_OC3CE_MSK)
#define HSPWME_DisableETRFClearOC3REF() CLR_HSPWME_BIT(PWME_CCMR3, PWMECCMR3_OC3CE_MSK)

#define PWMECCMR3_OC3M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMECCMR3X_OC3M3_MSK            BIT0
#define PWME_SetOC3OutputMode(n)        MODIFY_REG(PWME_CCMR3,  PWMECCMR3_OC3M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWME_CCMR3X, PWMECCMR3X_OC3M3_MSK, (((n) >> 3) << 0))
#define PWME_OC3REFFrozen()             PWME_SetOC3OutputMode(0)
#define PWME_OC3REFHighIfMatch()        PWME_SetOC3OutputMode(1)
#define PWME_OC3REFLowIfMatch()         PWME_SetOC3OutputMode(2)
#define PWME_OC3REFToggleIfMatch()      PWME_SetOC3OutputMode(3)
#define PWME_OC3REFForceLow()           PWME_SetOC3OutputMode(4)
#define PWME_OC3REFForceHigh()          PWME_SetOC3OutputMode(5)
#define PWME_OC3REFPWMMode1()           PWME_SetOC3OutputMode(6)
#define PWME_OC3REFPWMMode2()           PWME_SetOC3OutputMode(7)
#define PWME_OC3REFReTrigOPMPWM1()      PWME_SetOC3OutputMode(8)
#define PWME_OC3REFReTrigOPMPWM2()      PWME_SetOC3OutputMode(9)
#define PWME_OC3REFCombinedPWM1()       PWME_SetOC3OutputMode(12)
#define PWME_OC3REFCombinedPWM2()       PWME_SetOC3OutputMode(13)
#define PWME_OC3REFAsymmetricPWM1()     PWME_SetOC3OutputMode(14)
#define PWME_OC3REFAsymmetricPWM2()     PWME_SetOC3OutputMode(15)

#define HSPWME_SetOC3OutputMode(n)      MODIFY_HSPWME(PWME_CCMR3,  PWMECCMR3_OC3M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWME(PWME_CCMR3X, PWMECCMR3X_OC3M3_MSK, (((n) >> 3) << 0))
#define HSPWME_OC3REFFrozen()           HSPWME_SetOC3OutputMode(0)
#define HSPWME_OC3REFHighIfMatch()      HSPWME_SetOC3OutputMode(1)
#define HSPWME_OC3REFLowIfMatch()       HSPWME_SetOC3OutputMode(2)
#define HSPWME_OC3REFToggleIfMatch()    HSPWME_SetOC3OutputMode(3)
#define HSPWME_OC3REFForceLow()         HSPWME_SetOC3OutputMode(4)
#define HSPWME_OC3REFForceHigh()        HSPWME_SetOC3OutputMode(5)
#define HSPWME_OC3REFPWMMode1()         HSPWME_SetOC3OutputMode(6)
#define HSPWME_OC3REFPWMMode2()         HSPWME_SetOC3OutputMode(7)
#define HSPWME_OC3REFReTrigOPMPWM1()    HSPWME_SetOC3OutputMode(8)
#define HSPWME_OC3REFReTrigOPMPWM2()    HSPWME_SetOC3OutputMode(9)
#define HSPWME_OC3REFCombinedPWM1()     HSPWME_SetOC3OutputMode(12)
#define HSPWME_OC3REFCombinedPWM2()     HSPWME_SetOC3OutputMode(13)
#define HSPWME_OC3REFAsymmetricPWM1()   HSPWME_SetOC3OutputMode(14)
#define HSPWME_OC3REFAsymmetricPWM2()   HSPWME_SetOC3OutputMode(15)

#define PWMECCMR3_OC3PE_MSK             BIT3
#define PWME_UnbufferCCR3()             CLR_REG_BIT(PWME_CCMR3, PWMECCMR3_OC3PE_MSK)
#define PWME_BufferCCR3()               SET_REG_BIT(PWME_CCMR3, PWMECCMR3_OC3PE_MSK)

#define HSPWME_UnbufferCCR3()           CLR_HSPWME_BIT(PWME_CCMR3, PWMECCMR3_OC3PE_MSK)
#define HSPWME_BufferCCR3()             SET_HSPWME_BIT(PWME_CCMR3, PWMECCMR3_OC3PE_MSK)

#define PWMECCMR3_OC3FE_MSK             BIT2
#define PWME_DisableOC3FastMode()       CLR_REG_BIT(PWME_CCMR3, PWMECCMR3_OC3FE_MSK)
#define PWME_EnableOC3FastMode()        SET_REG_BIT(PWME_CCMR3, PWMECCMR3_OC3FE_MSK)

#define HSPWME_DisableOC3FastMode()     CLR_HSPWME_BIT(PWME_CCMR3, PWMECCMR3_OC3FE_MSK)
#define HSPWME_EnableOC3FastMode()      SET_HSPWME_BIT(PWME_CCMR3, PWMECCMR3_OC3FE_MSK)

#define PWMECCMR3_CC3S_MSK              (BIT1 | BIT0)
#define PWME_SetCC3Mode(n)              MODIFY_REG(PWME_CCMR3,  PWMECCMR3_CC3S_MSK, ((n) << 0))
#define PWME_CC3Output()                PWME_SetCC3Mode(0)
#define PWME_CC3CaptureTI3FP3()         PWME_SetCC3Mode(1)
#define PWME_CC3CaptureTI4FP3()         PWME_SetCC3Mode(2)
#define PWME_CC3CaptureTRC()            PWME_SetCC3Mode(3)

#define HSPWME_SetCC3Mode(n)            MODIFY_HSPWME(PWME_CCMR3,  PWMECCMR3_CC3S_MSK, ((n) << 0))
#define HSPWME_CC3Output()              HSPWME_SetCC3Mode(0)
#define HSPWME_CC3CaptureTI3FP3()       HSPWME_SetCC3Mode(1)
#define HSPWME_CC3CaptureTI4FP3()       HSPWME_SetCC3Mode(2)
#define HSPWME_CC3CaptureTRC()          HSPWME_SetCC3Mode(3)

#define PWMECCMR3_IC3F_MSK              (BIT_HN)
#define PWME_SetIC3Filter(n)            MODIFY_REG(PWME_CCMR3,  PWMECCMR3_IC3F_MSK, ((n) << 4))
#define PWME_IC3Filter1()               PWME_SetIC3Filter(0)
#define PWME_IC3Filter2()               PWME_SetIC3Filter(1)
#define PWME_IC3Filter4()               PWME_SetIC3Filter(2)
#define PWME_IC3Filter8()               PWME_SetIC3Filter(3)
#define PWME_IC3Filter12()              PWME_SetIC3Filter(4)
#define PWME_IC3Filter16()              PWME_SetIC3Filter(5)
#define PWME_IC3Filter24()              PWME_SetIC3Filter(6)
#define PWME_IC3Filter32()              PWME_SetIC3Filter(7)
#define PWME_IC3Filter48()              PWME_SetIC3Filter(8)
#define PWME_IC3Filter64()              PWME_SetIC3Filter(9)
#define PWME_IC3Filter80()              PWME_SetIC3Filter(10)
#define PWME_IC3Filter96()              PWME_SetIC3Filter(11)
#define PWME_IC3Filter128()             PWME_SetIC3Filter(12)
#define PWME_IC3Filter160()             PWME_SetIC3Filter(13)
#define PWME_IC3Filter192()             PWME_SetIC3Filter(14)
#define PWME_IC3Filter256()             PWME_SetIC3Filter(15)

#define HSPWME_SetIC3Filter(n)          MODIFY_HSPWME(PWME_CCMR3,  PWMECCMR3_IC3F_MSK, ((n) << 4))
#define HSPWME_IC3Filter1()             HSPWME_SetIC3Filter(0)
#define HSPWME_IC3Filter2()             HSPWME_SetIC3Filter(1)
#define HSPWME_IC3Filter4()             HSPWME_SetIC3Filter(2)
#define HSPWME_IC3Filter8()             HSPWME_SetIC3Filter(3)
#define HSPWME_IC3Filter12()            HSPWME_SetIC3Filter(4)
#define HSPWME_IC3Filter16()            HSPWME_SetIC3Filter(5)
#define HSPWME_IC3Filter24()            HSPWME_SetIC3Filter(6)
#define HSPWME_IC3Filter32()            HSPWME_SetIC3Filter(7)
#define HSPWME_IC3Filter48()            HSPWME_SetIC3Filter(8)
#define HSPWME_IC3Filter64()            HSPWME_SetIC3Filter(9)
#define HSPWME_IC3Filter80()            HSPWME_SetIC3Filter(10)
#define HSPWME_IC3Filter96()            HSPWME_SetIC3Filter(11)
#define HSPWME_IC3Filter128()           HSPWME_SetIC3Filter(12)
#define HSPWME_IC3Filter160()           HSPWME_SetIC3Filter(13)
#define HSPWME_IC3Filter192()           HSPWME_SetIC3Filter(14)
#define HSPWME_IC3Filter256()           HSPWME_SetIC3Filter(15)

#define PWMECCMR3_IC3PS_MSK             (BIT3 | BIT2)
#define PWME_SetIC3Divider(n)           MODIFY_REG(PWME_CCMR3,  PWMECCMR3_IC3PS_MSK, ((n) << 2))
#define PWME_IC3Divider1()              PWME_SetIC3Divider(0)
#define PWME_IC3Divider2()              PWME_SetIC3Divider(1)
#define PWME_IC3Divider4()              PWME_SetIC3Divider(2)
#define PWME_IC3Divider8()              PWME_SetIC3Divider(3)

