fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWME_SetIC3Divider(n)         MODIFY_HSPWME(PWME_CCMR3,  PWMECCMR3_IC3PS_MSK, ((n) << 2))
#define HSPWME_IC3Divider1()            HSPWME_SetIC3Divider(0)
#define HSPWME_IC3Divider2()            HSPWME_SetIC3Divider(1)
#define HSPWME_IC3Divider4()            HSPWME_SetIC3Divider(2)
#define HSPWME_IC3Divider8()            HSPWME_SetIC3Divider(3)

#define PWMECCMR4_OC4CE_MSK             BIT7
#define PWME_EnableETRFClearOC4REF()    SET_REG_BIT(PWME_CCMR4, PWMECCMR4_OC4CE_MSK)
#define PWME_DisableETRFClearOC4REF()   CLR_REG_BIT(PWME_CCMR4, PWMECCMR4_OC4CE_MSK)

#define HSPWME_EnableETRFClearOC4REF()  SET_HSPWME_BIT(PWME_CCMR4, PWMECCMR4_OC4CE_MSK)
#define HSPWME_DisableETRFClearOC4REF() CLR_HSPWME_BIT(PWME_CCMR4, PWMECCMR4_OC4CE_MSK)

#define PWMECCMR4_OC4M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMECCMR4X_OC4M3_MSK            BIT0
#define PWME_SetOC4OutputMode(n)        MODIFY_REG(PWME_CCMR4,  PWMECCMR4_OC4M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWME_CCMR4X, PWMECCMR4X_OC4M3_MSK, (((n) >> 3) << 0))
#define PWME_OC4REFFrozen()             PWME_SetOC4OutputMode(0)
#define PWME_OC4REFHighIfMatch()        PWME_SetOC4OutputMode(1)
#define PWME_OC4REFLowIfMatch()         PWME_SetOC4OutputMode(2)
#define PWME_OC4REFToggleIfMatch()      PWME_SetOC4OutputMode(3)
#define PWME_OC4REFForceLow()           PWME_SetOC4OutputMode(4)
#define PWME_OC4REFForceHigh()          PWME_SetOC4OutputMode(5)
#define PWME_OC4REFPWMMode1()           PWME_SetOC4OutputMode(6)
#define PWME_OC4REFPWMMode2()           PWME_SetOC4OutputMode(7)
#define PWME_OC4REFReTrigOPMPWM1()      PWME_SetOC4OutputMode(8)
#define PWME_OC4REFReTrigOPMPWM2()      PWME_SetOC4OutputMode(9)
#define PWME_OC4REFCombinedPWM1()       PWME_SetOC4OutputMode(12)
#define PWME_OC4REFCombinedPWM2()       PWME_SetOC4OutputMode(13)
#define PWME_OC4REFAsymmetricPWM1()     PWME_SetOC4OutputMode(14)
#define PWME_OC4REFAsymmetricPWM2()     PWME_SetOC4OutputMode(15)

#define HSPWME_SetOC4OutputMode(n)      MODIFY_HSPWME(PWME_CCMR4,  PWMECCMR4_OC4M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWME(PWME_CCMR4X, PWMECCMR4X_OC4M3_MSK, (((n) >> 3) << 0))
#define HSPWME_OC4REFFrozen()           HSPWME_SetOC4OutputMode(0)
#define HSPWME_OC4REFHighIfMatch()      HSPWME_SetOC4OutputMode(1)
#define HSPWME_OC4REFLowIfMatch()       HSPWME_SetOC4OutputMode(2)
#define HSPWME_OC4REFToggleIfMatch()    HSPWME_SetOC4OutputMode(3)
#define HSPWME_OC4REFForceLow()         HSPWME_SetOC4OutputMode(4)
#define HSPWME_OC4REFForceHigh()        HSPWME_SetOC4OutputMode(5)
#define HSPWME_OC4REFPWMMode1()         HSPWME_SetOC4OutputMode(6)
#define HSPWME_OC4REFPWMMode2()         HSPWME_SetOC4OutputMode(7)
#define HSPWME_OC4REFReTrigOPMPWM1()    HSPWME_SetOC4OutputMode(8)
#define HSPWME_OC4REFReTrigOPMPWM2()    HSPWME_SetOC4OutputMode(9)
#define HSPWME_OC4REFCombinedPWM1()     HSPWME_SetOC4OutputMode(12)
#define HSPWME_OC4REFCombinedPWM2()     HSPWME_SetOC4OutputMode(13)
#define HSPWME_OC4REFAsymmetricPWM1()   HSPWME_SetOC4OutputMode(14)
#define HSPWME_OC4REFAsymmetricPWM2()   HSPWME_SetOC4OutputMode(15)

#define PWMECCMR4_OC4PE_MSK             BIT3
#define PWME_UnbufferCCR4()             CLR_REG_BIT(PWME_CCMR4, PWMECCMR4_OC4PE_MSK)
#define PWME_BufferCCR4()               SET_REG_BIT(PWME_CCMR4, PWMECCMR4_OC4PE_MSK)

#define HSPWME_UnbufferCCR4()           CLR_HSPWME_BIT(PWME_CCMR4, PWMECCMR4_OC4PE_MSK)
#define HSPWME_BufferCCR4()             SET_HSPWME_BIT(PWME_CCMR4, PWMECCMR4_OC4PE_MSK)

#define PWMECCMR4_OC4FE_MSK             BIT2
#define PWME_DisableOC4FastMode()       CLR_REG_BIT(PWME_CCMR4, PWMECCMR4_OC4FE_MSK)
#define PWME_EnableOC4FastMode()        SET_REG_BIT(PWME_CCMR4, PWMECCMR4_OC4FE_MSK)

#define HSPWME_DisableOC4FastMode()     CLR_HSPWME_BIT(PWME_CCMR4, PWMECCMR4_OC4FE_MSK)
#define HSPWME_EnableOC4FastMode()      SET_HSPWME_BIT(PWME_CCMR4, PWMECCMR4_OC4FE_MSK)

#define PWMECCMR4_CC4S_MSK              (BIT1 | BIT0)
#define PWME_SetCC4Mode(n)              MODIFY_REG(PWME_CCMR4,  PWMECCMR4_CC4S_MSK, ((n) << 0))
#define PWME_CC4Output()                PWME_SetCC4Mode(0)
#define PWME_CC4CaptureTI4FP4()         PWME_SetCC4Mode(1)
#define PWME_CC4CaptureTI3FP4()         PWME_SetCC4Mode(2)
#define PWME_CC4CaptureTRC()            PWME_SetCC4Mode(3)

#define HSPWME_SetCC4Mode(n)            MODIFY_HSPWME(PWME_CCMR4,  PWMECCMR4_CC4S_MSK, ((n) << 0))
#define HSPWME_CC4Output()              HSPWME_SetCC4Mode(0)
#define HSPWME_CC4CaptureTI4FP4()       HSPWME_SetCC4Mode(1)
#define HSPWME_CC4CaptureTI3FP4()       HSPWME_SetCC4Mode(2)
#define HSPWME_CC4CaptureTRC()          HSPWME_SetCC4Mode(3)

#define PWMECCMR4_IC4F_MSK              (BIT_HN)
#define PWME_SetIC4Filter(n)            MODIFY_REG(PWME_CCMR4,  PWMECCMR4_IC4F_MSK, ((n) << 4))
#define PWME_IC4Filter1()               PWME_SetIC4Filter(0)
#define PWME_IC4Filter2()               PWME_SetIC4Filter(1)
#define PWME_IC4Filter4()               PWME_SetIC4Filter(2)
#define PWME_IC4Filter8()               PWME_SetIC4Filter(3)
#define PWME_IC4Filter12()              PWME_SetIC4Filter(4)
#define PWME_IC4Filter16()              PWME_SetIC4Filter(5)
#define PWME_IC4Filter24()              PWME_SetIC4Filter(6)
#define PWME_IC4Filter32()              PWME_SetIC4Filter(7)
#define PWME_IC4Filter48()              PWME_SetIC4Filter(8)
#define PWME_IC4Filter64()              PWME_SetIC4Filter(9)
#define PWME_IC4Filter80()              PWME_SetIC4Filter(10)
#define PWME_IC4Filter96()              PWME_SetIC4Filter(11)
#define PWME_IC4Filter128()             PWME_SetIC4Filter(12)
#define PWME_IC4Filter160()             PWME_SetIC4Filter(13)
#define PWME_IC4Filter192()             PWME_SetIC4Filter(14)
#define PWME_IC4Filter256()             PWME_SetIC4Filter(15)

#define HSPWME_SetIC4Filter(n)          MODIFY_HSPWME(PWME_CCMR4,  PWMECCMR4_IC4F_MSK, ((n) << 4))
#define HSPWME_IC4Filter1()             HSPWME_SetIC4Filter(0)
#define HSPWME_IC4Filter2()             HSPWME_SetIC4Filter(1)
#define HSPWME_IC4Filter4()             HSPWME_SetIC4Filter(2)
#define HSPWME_IC4Filter8()             HSPWME_SetIC4Filter(3)
#define HSPWME_IC4Filter12()            HSPWME_SetIC4Filter(4)
#define HSPWME_IC4Filter16()            HSPWME_SetIC4Filter(5)
#define HSPWME_IC4Filter24()            HSPWME_SetIC4Filter(6)
#define HSPWME_IC4Filter32()            HSPWME_SetIC4Filter(7)
#define HSPWME_IC4Filter48()            HSPWME_SetIC4Filter(8)
#define HSPWME_IC4Filter64()            HSPWME_SetIC4Filter(9)
#define HSPWME_IC4Filter80()            HSPWME_SetIC4Filter(10)
#define HSPWME_IC4Filter96()            HSPWME_SetIC4Filter(11)
#define HSPWME_IC4Filter128()           HSPWME_SetIC4Filter(12)
#define HSPWME_IC4Filter160()           HSPWME_SetIC4Filter(13)
#define HSPWME_IC4Filter192()           HSPWME_SetIC4Filter(14)
#define HSPWME_IC4Filter256()           HSPWME_SetIC4Filter(15)

