fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMECCMR4_IC4PS_MSK             (BIT3 | BIT2)
#define PWME_SetIC4Divider(n)           MODIFY_REG(PWME_CCMR4,  PWMECCMR4_IC4PS_MSK, ((n) << 2))
#define PWME_IC4Divider1()              PWME_SetIC4Divider(0)
#define PWME_IC4Divider2()              PWME_SetIC4Divider(1)
#define PWME_IC4Divider4()              PWME_SetIC4Divider(2)
#define PWME_IC4Divider8()              PWME_SetIC4Divider(3)

#define HSPWME_SetIC4Divider(n)         MODIFY_HSPWME(PWME_CCMR4,  PWMECCMR4_IC4PS_MSK, ((n) << 2))
#define HSPWME_IC4Divider1()            HSPWME_SetIC4Divider(0)
#define HSPWME_IC4Divider2()            HSPWME_SetIC4Divider(1)
#define HSPWME_IC4Divider4()            HSPWME_SetIC4Divider(2)
#define HSPWME_IC4Divider8()            HSPWME_SetIC4Divider(3)

#define PWMECCMR5_OC5CE_MSK             BIT7
#define PWME_EnableETRFClearOC5REF()    SET_REG_BIT(PWME_CCMR5, PWMECCMR5_OC5CE_MSK)
#define PWME_DisableETRFClearOC5REF()   CLR_REG_BIT(PWME_CCMR5, PWMECCMR5_OC5CE_MSK)

#define HSPWME_EnableETRFClearOC5REF()  SET_HSPWME_BIT(PWME_CCMR5, PWMECCMR5_OC5CE_MSK)
#define HSPWME_DisableETRFClearOC5REF() CLR_HSPWME_BIT(PWME_CCMR5, PWMECCMR5_OC5CE_MSK)

#define PWMECCMR5_OC5M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMECCMR5X_OC5M3_MSK            BIT0
#define PWME_SetOC5OutputMode(n)        MODIFY_REG(PWME_CCMR5,  PWMECCMR5_OC5M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWME_CCMR5X, PWMECCMR5X_OC5M3_MSK, (((n) >> 3) << 0))
#define PWME_OC5REFFrozen()             PWME_SetOC5OutputMode(0)
#define PWME_OC5REFHighIfMatch()        PWME_SetOC5OutputMode(1)
#define PWME_OC5REFLowIfMatch()         PWME_SetOC5OutputMode(2)
#define PWME_OC5REFToggleIfMatch()      PWME_SetOC5OutputMode(3)
#define PWME_OC5REFForceLow()           PWME_SetOC5OutputMode(4)
#define PWME_OC5REFForceHigh()          PWME_SetOC5OutputMode(5)
#define PWME_OC5REFPWMMode1()           PWME_SetOC5OutputMode(6)
#define PWME_OC5REFPWMMode2()           PWME_SetOC5OutputMode(7)
#define PWME_OC5REFReTrigOPMPWM1()      PWME_SetOC5OutputMode(8)
#define PWME_OC5REFReTrigOPMPWM2()      PWME_SetOC5OutputMode(9)
#define PWME_OC5REFCombinedPWM1()       PWME_SetOC5OutputMode(12)
#define PWME_OC5REFCombinedPWM2()       PWME_SetOC5OutputMode(13)
#define PWME_OC5REFAsymmetricPWM1()     PWME_SetOC5OutputMode(14)
#define PWME_OC5REFAsymmetricPWM2()     PWME_SetOC5OutputMode(15)

#define HSPWME_SetOC5OutputMode(n)      MODIFY_HSPWME(PWME_CCMR5,  PWMECCMR5_OC5M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWME(PWME_CCMR5X, PWMECCMR5X_OC5M3_MSK, (((n) >> 3) << 0))
#define HSPWME_OC5REFFrozen()           HSPWME_SetOC5OutputMode(0)
#define HSPWME_OC5REFHighIfMatch()      HSPWME_SetOC5OutputMode(1)
#define HSPWME_OC5REFLowIfMatch()       HSPWME_SetOC5OutputMode(2)
#define HSPWME_OC5REFToggleIfMatch()    HSPWME_SetOC5OutputMode(3)
#define HSPWME_OC5REFForceLow()         HSPWME_SetOC5OutputMode(4)
#define HSPWME_OC5REFForceHigh()        HSPWME_SetOC5OutputMode(5)
#define HSPWME_OC5REFPWMMode1()         HSPWME_SetOC5OutputMode(6)
#define HSPWME_OC5REFPWMMode2()         HSPWME_SetOC5OutputMode(7)
#define HSPWME_OC5REFReTrigOPMPWM1()    HSPWME_SetOC5OutputMode(8)
#define HSPWME_OC5REFReTrigOPMPWM2()    HSPWME_SetOC5OutputMode(9)
#define HSPWME_OC5REFCombinedPWM1()     HSPWME_SetOC5OutputMode(12)
#define HSPWME_OC5REFCombinedPWM2()     HSPWME_SetOC5OutputMode(13)
#define HSPWME_OC5REFAsymmetricPWM1()   HSPWME_SetOC5OutputMode(14)
#define HSPWME_OC5REFAsymmetricPWM2()   HSPWME_SetOC5OutputMode(15)

#define PWMECCMR5_OC5PE_MSK             BIT3
#define PWME_UnbufferCCR5()             CLR_REG_BIT(PWME_CCMR5, PWMECCMR5_OC5PE_MSK)
#define PWME_BufferCCR5()               SET_REG_BIT(PWME_CCMR5, PWMECCMR5_OC5PE_MSK)

#define HSPWME_UnbufferCCR5()           CLR_HSPWME_BIT(PWME_CCMR5, PWMECCMR5_OC5PE_MSK)
#define HSPWME_BufferCCR5()             SET_HSPWME_BIT(PWME_CCMR5, PWMECCMR5_OC5PE_MSK)

#define PWMECCMR6_OC6CE_MSK             BIT7
#define PWME_EnableETRFClearOC6REF()    SET_REG_BIT(PWME_CCMR6, PWMECCMR6_OC6CE_MSK)
#define PWME_DisableETRFClearOC6REF()   CLR_REG_BIT(PWME_CCMR6, PWMECCMR6_OC6CE_MSK)

#define HSPWME_EnableETRFClearOC6REF()  SET_HSPWME_BIT(PWME_CCMR6, PWMECCMR6_OC6CE_MSK)
#define HSPWME_DisableETRFClearOC6REF() CLR_HSPWME_BIT(PWME_CCMR6, PWMECCMR6_OC6CE_MSK)

#define PWMECCMR6_OC6M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMECCMR6X_OC6M3_MSK            BIT0
#define PWME_SetOC6OutputMode(n)        MODIFY_REG(PWME_CCMR6,  PWMECCMR6_OC6M_MSK, ((n) << 4)); \
                                        MODIFY_REG(PWME_CCMR6X, PWMECCMR6X_OC6M3_MSK, (((n) >> 3) << 0))
#define PWME_OC6REFFrozen()             PWME_SetOC6OutputMode(0)
#define PWME_OC6REFHighIfMatch()        PWME_SetOC6OutputMode(1)
#define PWME_OC6REFLowIfMatch()         PWME_SetOC6OutputMode(2)
#define PWME_OC6REFToggleIfMatch()      PWME_SetOC6OutputMode(3)
#define PWME_OC6REFForceLow()           PWME_SetOC6OutputMode(4)
#define PWME_OC6REFForceHigh()          PWME_SetOC6OutputMode(5)
#define PWME_OC6REFPWMMode1()           PWME_SetOC6OutputMode(6)
#define PWME_OC6REFPWMMode2()           PWME_SetOC6OutputMode(7)
#define PWME_OC6REFReTrigOPMPWM1()      PWME_SetOC6OutputMode(8)
#define PWME_OC6REFReTrigOPMPWM2()      PWME_SetOC6OutputMode(9)
#define PWME_OC6REFCombinedPWM1()       PWME_SetOC6OutputMode(12)
#define PWME_OC6REFCombinedPWM2()       PWME_SetOC6OutputMode(13)
#define PWME_OC6REFAsymmetricPWM1()     PWME_SetOC6OutputMode(14)
#define PWME_OC6REFAsymmetricPWM2()     PWME_SetOC6OutputMode(15)

#define HSPWME_SetOC6OutputMode(n)      MODIFY_HSPWME(PWME_CCMR6,  PWMECCMR6_OC6M_MSK, ((n) << 4)); \
                                        MODIFY_HSPWME(PWME_CCMR6X, PWMECCMR6X_OC6M3_MSK, (((n) >> 3) << 0))
#define HSPWME_OC6REFFrozen()           HSPWME_SetOC6OutputMode(0)
#define HSPWME_OC6REFHighIfMatch()      HSPWME_SetOC6OutputMode(1)
#define HSPWME_OC6REFLowIfMatch()       HSPWME_SetOC6OutputMode(2)
#define HSPWME_OC6REFToggleIfMatch()    HSPWME_SetOC6OutputMode(3)
#define HSPWME_OC6REFForceLow()         HSPWME_SetOC6OutputMode(4)
#define HSPWME_OC6REFForceHigh()        HSPWME_SetOC6OutputMode(5)
#define HSPWME_OC6REFPWMMode1()         HSPWME_SetOC6OutputMode(6)
#define HSPWME_OC6REFPWMMode2()         HSPWME_SetOC6OutputMode(7)
#define HSPWME_OC6REFReTrigOPMPWM1()    HSPWME_SetOC6OutputMode(8)
#define HSPWME_OC6REFReTrigOPMPWM2()    HSPWME_SetOC6OutputMode(9)
#define HSPWME_OC6REFCombinedPWM1()     HSPWME_SetOC6OutputMode(12)
#define HSPWME_OC6REFCombinedPWM2()     HSPWME_SetOC6OutputMode(13)
#define HSPWME_OC6REFAsymmetricPWM1()   HSPWME_SetOC6OutputMode(14)
#define HSPWME_OC6REFAsymmetricPWM2()   HSPWME_SetOC6OutputMode(15)

#define PWMECCMR6_OC6PE_MSK             BIT3
#define PWME_UnbufferCCR6()             CLR_REG_BIT(PWME_CCMR6, PWMECCMR6_OC6PE_MSK)
#define PWME_BufferCCR6()               SET_REG_BIT(PWME_CCMR6, PWMECCMR6_OC6PE_MSK)

#define HSPWME_UnbufferCCR6()           CLR_HSPWME_BIT(PWME_CCMR6, PWMECCMR6_OC6PE_MSK)
#define HSPWME_BufferCCR6()             SET_HSPWME_BIT(PWME_CCMR6, PWMECCMR6_OC6PE_MSK)

