fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMECCER1_CC1E_MSK              BIT0
#define PWME_CC1PEnable()               SET_REG_BIT(PWME_CCER1, PWMECCER1_CC1E_MSK)
#define PWME_CC1PDisable()              CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC1E_MSK)

#define HSPWME_CC1PEnable()             SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1E_MSK)
#define HSPWME_CC1PDisable()            CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1E_MSK)

#define PWMECCER1_CC1P_MSK              BIT1
#define PWME_CC1PNonInverted()          CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC1P_MSK)
#define PWME_CC1PInverted()             SET_REG_BIT(PWME_CCER1, PWMECCER1_CC1P_MSK)

#define HSPWME_CC1PNonInverted()        CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1P_MSK)
#define HSPWME_CC1PInverted()           SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1P_MSK)

#define PWMECCER1_CC1NE_MSK             BIT2
#define PWME_CC1NEnable()               SET_REG_BIT(PWME_CCER1, PWMECCER1_CC1NE_MSK)
#define PWME_CC1NDisable()              CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC1NE_MSK)

#define HSPWME_CC1NEnable()             SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1NE_MSK)
#define HSPWME_CC1NDisable()            CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1NE_MSK)

#define PWMECCER1_CC1NP_MSK             BIT3
#define PWME_CC1NNonInverted()          CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC1NP_MSK)
#define PWME_CC1NInverted()             SET_REG_BIT(PWME_CCER1, PWMECCER1_CC1NP_MSK)

#define HSPWME_CC1NNonInverted()        CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1NP_MSK)
#define HSPWME_CC1NInverted()           SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC1NP_MSK)

#define PWMECCER1_CC2E_MSK              BIT4
#define PWME_CC2PEnable()               SET_REG_BIT(PWME_CCER1, PWMECCER1_CC2E_MSK)
#define PWME_CC2PDisable()              CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC2E_MSK)

#define HSPWME_CC2PEnable()             SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2E_MSK)
#define HSPWME_CC2PDisable()            CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2E_MSK)

#define PWMECCER1_CC2P_MSK              BIT5
#define PWME_CC2PNonInverted()          CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC2P_MSK)
#define PWME_CC2PInverted()             SET_REG_BIT(PWME_CCER1, PWMECCER1_CC2P_MSK)

#define HSPWME_CC2PNonInverted()        CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2P_MSK)
#define HSPWME_CC2PInverted()           SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2P_MSK)

#define PWMECCER1_CC2NE_MSK             BIT6
#define PWME_CC2NEnable()               SET_REG_BIT(PWME_CCER1, PWMECCER1_CC2NE_MSK)
#define PWME_CC2NDisable()              CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC2NE_MSK)

#define HSPWME_CC2NEnable()             SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2NE_MSK)
#define HSPWME_CC2NDisable()            CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2NE_MSK)

#define PWMECCER1_CC2NP_MSK             BIT7
#define PWME_CC2NNonInverted()          CLR_REG_BIT(PWME_CCER1, PWMECCER1_CC2NP_MSK)
#define PWME_CC2NInverted()             SET_REG_BIT(PWME_CCER1, PWMECCER1_CC2NP_MSK)

#define HSPWME_CC2NNonInverted()        CLR_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2NP_MSK)
#define HSPWME_CC2NInverted()           SET_HSPWME_BIT(PWME_CCER1, PWMECCER1_CC2NP_MSK)

#define PWMECCER2_CC3E_MSK              BIT0
#define PWME_CC3PEnable()               SET_REG_BIT(PWME_CCER2, PWMECCER2_CC3E_MSK)
#define PWME_CC3PDisable()              CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC3E_MSK)

#define HSPWME_CC3PEnable()             SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3E_MSK)
#define HSPWME_CC3PDisable()            CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3E_MSK)

#define PWMECCER2_CC3P_MSK              BIT1
#define PWME_CC3PNonInverted()          CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC3P_MSK)
#define PWME_CC3PInverted()             SET_REG_BIT(PWME_CCER2, PWMECCER2_CC3P_MSK)

#define HSPWME_CC3PNonInverted()        CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3P_MSK)
#define HSPWME_CC3PInverted()           SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3P_MSK)

#define PWMECCER2_CC3NE_MSK             BIT2
#define PWME_CC3NEnable()               SET_REG_BIT(PWME_CCER2, PWMECCER2_CC3NE_MSK)
#define PWME_CC3NDisable()              CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC3NE_MSK)

#define HSPWME_CC3NEnable()             SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3NE_MSK)
#define HSPWME_CC3NDisable()            CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3NE_MSK)

#define PWMECCER2_CC3NP_MSK             BIT3
#define PWME_CC3NNonInverted()          CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC3NP_MSK)
#define PWME_CC3NInverted()             SET_REG_BIT(PWME_CCER2, PWMECCER2_CC3NP_MSK)

#define HSPWME_CC3NNonInverted()        CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3NP_MSK)
#define HSPWME_CC3NInverted()           SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC3NP_MSK)

#define PWMECCER2_CC4E_MSK              BIT4
#define PWME_CC4PEnable()               SET_REG_BIT(PWME_CCER2, PWMECCER2_CC4E_MSK)
#define PWME_CC4PDisable()              CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC4E_MSK)

#define HSPWME_CC4PEnable()             SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4E_MSK)
#define HSPWME_CC4PDisable()            CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4E_MSK)

#define PWMECCER2_CC4P_MSK              BIT5
#define PWME_CC4PNonInverted()          CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC4P_MSK)
#define PWME_CC4PInverted()             SET_REG_BIT(PWME_CCER2, PWMECCER2_CC4P_MSK)

#define HSPWME_CC4PNonInverted()        CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4P_MSK)
#define HSPWME_CC4PInverted()           SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4P_MSK)

#define PWMECCER2_CC4NE_MSK             BIT6
#define PWME_CC4NEnable()               SET_REG_BIT(PWME_CCER2, PWMECCER2_CC4NE_MSK)
#define PWME_CC4NDisable()              CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC4NE_MSK)

#define HSPWME_CC4NEnable()             SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4NE_MSK)
#define HSPWME_CC4NDisable()            CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4NE_MSK)

#define PWMECCER2_CC4NP_MSK             BIT7
#define PWME_CC4NNonInverted()          CLR_REG_BIT(PWME_CCER2, PWMECCER2_CC4NP_MSK)
#define PWME_CC4NInverted()             SET_REG_BIT(PWME_CCER2, PWMECCER2_CC4NP_MSK)

