fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWME_CC4NNonInverted()        CLR_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4NP_MSK)
#define HSPWME_CC4NInverted()           SET_HSPWME_BIT(PWME_CCER2, PWMECCER2_CC4NP_MSK)

#define PWMECCER3_CC5E_MSK              BIT0
#define PWME_CC5PEnable()               SET_REG_BIT(PWME_CCER3, PWMECCER3_CC5E_MSK)
#define PWME_CC5PDisable()              CLR_REG_BIT(PWME_CCER3, PWMECCER3_CC5E_MSK)

#define HSPWME_CC5PEnable()             SET_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC5E_MSK)
#define HSPWME_CC5PDisable()            CLR_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC5E_MSK)

#define PWMECCER3_CC5P_MSK              BIT1
#define PWME_CC5PNonInverted()          CLR_REG_BIT(PWME_CCER3, PWMECCER3_CC5P_MSK)
#define PWME_CC5PInverted()             SET_REG_BIT(PWME_CCER3, PWMECCER3_CC5P_MSK)

#define HSPWME_CC5PNonInverted()        CLR_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC5P_MSK)
#define HSPWME_CC5PInverted()           SET_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC5P_MSK)

#define PWMECCER3_CC6E_MSK              BIT4
#define PWME_CC6PEnable()               SET_REG_BIT(PWME_CCER3, PWMECCER3_CC6E_MSK)
#define PWME_CC6PDisable()              CLR_REG_BIT(PWME_CCER3, PWMECCER3_CC6E_MSK)

#define HSPWME_CC6PEnable()             SET_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC6E_MSK)
#define HSPWME_CC6PDisable()            CLR_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC6E_MSK)

#define PWMECCER3_CC6P_MSK              BIT5
#define PWME_CC6PNonInverted()          CLR_REG_BIT(PWME_CCER3, PWMECCER3_CC6P_MSK)
#define PWME_CC6PInverted()             SET_REG_BIT(PWME_CCER3, PWMECCER3_CC6P_MSK)

#define HSPWME_CC6PNonInverted()        CLR_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC6P_MSK)
#define HSPWME_CC6PInverted()           SET_HSPWME_BIT(PWME_CCER3, PWMECCER3_CC6P_MSK)

#define PWMEBRK_MOE_MSK                 BIT7
#define PWME_EnableMainOutput()         SET_REG_BIT(PWME_BKR, PWMEBRK_MOE_MSK)
#define PWME_DisableMainOutput()        CLR_REG_BIT(PWME_BKR, PWMEBRK_MOE_MSK)

#define HSPWME_EnableMainOutput()       SET_HSPWME_BIT(PWME_BKR, PWMEBRK_MOE_MSK)
#define HSPWME_DisableMainOutput()      CLR_HSPWME_BIT(PWME_BKR, PWMEBRK_MOE_MSK)

#define PWMEBRK_AOE_MSK                 BIT6
#define PWME_EnableAutoOutput()         SET_REG_BIT(PWME_BKR, PWMEBRK_AOE_MSK)
#define PWME_DisableAutoOutput()        CLR_REG_BIT(PWME_BKR, PWMEBRK_AOE_MSK)

#define HSPWME_EnableAutoOutput()       SET_HSPWME_BIT(PWME_BKR, PWMEBRK_AOE_MSK)
#define HSPWME_DisableAutoOutput()      CLR_HSPWME_BIT(PWME_BKR, PWMEBRK_AOE_MSK)

#define PWMEBRK_BKP_MSK                 BIT5
#define PWME_BRKNonInverted()           SET_REG_BIT(PWME_BKR, PWMEBRK_BKP_MSK)
#define PWME_BRKInverted()              CLR_REG_BIT(PWME_BKR, PWMEBRK_BKP_MSK)

#define HSPWME_BRKNonInverted()         SET_HSPWME_BIT(PWME_BKR, PWMEBRK_BKP_MSK)
#define HSPWME_BRKInverted()            CLR_HSPWME_BIT(PWME_BKR, PWMEBRK_BKP_MSK)

#define PWMEBRK_BKE_MSK                 BIT4
#define PWME_BRKEnable()                SET_REG_BIT(PWME_BKR, PWMEBRK_BKE_MSK)
#define PWME_BRKDisable()               CLR_REG_BIT(PWME_BKR, PWMEBRK_BKE_MSK)

#define HSPWME_BRKEnable()              SET_HSPWME_BIT(PWME_BKR, PWMEBRK_BKE_MSK)
#define HSPWME_BRKDisable()             CLR_HSPWME_BIT(PWME_BKR, PWMEBRK_BKE_MSK)

#define PWMEBRK_OSSR_MSK                BIT3
#define PWMEBRK_OSSI_MSK                BIT2
#define PWME_RunInactiveNoOutput()      CLR_REG_BIT(PWME_BKR, PWMEBRK_OSSR_MSK)
#define PWME_RunInactiveOutput()        SET_REG_BIT(PWME_BKR, PWMEBRK_OSSR_MSK)
#define PWME_IdleInactiveNoOutput()     CLR_REG_BIT(PWME_BKR, PWMEBRK_OSSI_MSK)
#define PWME_IdleInactiveOutput()       SET_REG_BIT(PWME_BKR, PWMEBRK_OSSI_MSK)

#define HSPWME_RunInactiveNoOutput()    CLR_HSPWME_BIT(PWME_BKR, PWMEBRK_OSSR_MSK)
#define HSPWME_RunInactiveOutput()      SET_HSPWME_BIT(PWME_BKR, PWMEBRK_OSSR_MSK)
#define HSPWME_IdleInactiveNoOutput()   CLR_HSPWME_BIT(PWME_BKR, PWMEBRK_OSSI_MSK)
#define HSPWME_IdleInactiveOutput()     SET_HSPWME_BIT(PWME_BKR, PWMEBRK_OSSI_MSK)

#define PWMEBRK_LOCK_MSK                (BIT1 | BIT0)
#define PWME_SetLockLevel(n)            MODIFY_REG(PWME_BKR,  PWMEBRK_LOCK_MSK, ((n) << 0))
#define PWME_SetUnLock()                PWME_SetLockLevel(0)

#define HSPWME_SetLockLevel(n)          MODIFY_HSPWME(PWME_BKR,  PWMEBRK_LOCK_MSK, ((n) << 0))
#define HSPWME_SetUnLock()              HSPWME_SetLockLevel(0)

#define PWMEOISR_OIS1_MSK               BIT0
#define PWMEOISR_OIS1N_MSK              BIT1
#define PWMEOISR_OIS2_MSK               BIT2
#define PWMEOISR_OIS2N_MSK              BIT3
#define PWMEOISR_OIS3_MSK               BIT4
#define PWMEOISR_OIS3N_MSK              BIT5
#define PWMEOISR_OIS4_MSK               BIT6
#define PWMEOISR_OIS4N_MSK              BIT7
#define PWMECR3_OIS5_MSK                BIT0
#define PWMECR3_OIS6_MSK                BIT2
#define PWME_OC1PIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS1_MSK)
#define PWME_OC1PIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS1_MSK)
#define PWME_OC1NIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS1N_MSK)
#define PWME_OC1NIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS1N_MSK)
#define PWME_OC2PIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS2_MSK)
#define PWME_OC2PIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS2_MSK)
#define PWME_OC2NIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS2N_MSK)
#define PWME_OC2NIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS2N_MSK)
#define PWME_OC3PIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS3_MSK)
#define PWME_OC3PIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS3_MSK)
#define PWME_OC3NIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS3N_MSK)
#define PWME_OC3NIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS3N_MSK)
#define PWME_OC4PIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS4_MSK)
#define PWME_OC4PIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS4_MSK)
#define PWME_OC4NIdleLevelLow()         CLR_REG_BIT(PWME_OISR, PWMEOISR_OIS4N_MSK)
#define PWME_OC4NIdleLevelHigh()        SET_REG_BIT(PWME_OISR, PWMEOISR_OIS4N_MSK)
#define PWME_OC5PIdleLevelLow()         CLR_REG_BIT(PWME_CR3, PWMECR3_OIS5_MSK)
#define PWME_OC5PIdleLevelHigh()        SET_REG_BIT(PWME_CR3, PWMECR3_OIS5_MSK)
#define PWME_OC6PIdleLevelLow()         CLR_REG_BIT(PWME_CR3, PWMECR3_OIS6_MSK)
#define PWME_OC6PIdleLevelHigh()        SET_REG_BIT(PWME_CR3, PWMECR3_OIS6_MSK)

#define HSPWME_OC1PIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS1_MSK)
#define HSPWME_OC1PIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS1_MSK)
#define HSPWME_OC1NIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS1N_MSK)
#define HSPWME_OC1NIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS1N_MSK)
#define HSPWME_OC2PIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS2_MSK)
#define HSPWME_OC2PIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS2_MSK)
#define HSPWME_OC2NIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS2N_MSK)
#define HSPWME_OC2NIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS2N_MSK)
#define HSPWME_OC3PIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS3_MSK)
#define HSPWME_OC3PIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS3_MSK)
#define HSPWME_OC3NIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS3N_MSK)
#define HSPWME_OC3NIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS3N_MSK)
#define HSPWME_OC4PIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS4_MSK)
#define HSPWME_OC4PIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS4_MSK)
#define HSPWME_OC4NIdleLevelLow()       CLR_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS4N_MSK)
#define HSPWME_OC4NIdleLevelHigh()      SET_HSPWME_BIT(PWME_OISR, PWMEOISR_OIS4N_MSK)
#define HSPWME_OC5PIdleLevelLow()       CLR_HSPWME_BIT(PWME_CR3, PWMECR3_OIS5_MSK)
#define HSPWME_OC5PIdleLevelHigh()      SET_HSPWME_BIT(PWME_CR3, PWMECR3_OIS5_MSK)
#define HSPWME_OC6PIdleLevelLow()       CLR_HSPWME_BIT(PWME_CR3, PWMECR3_OIS6_MSK)
#define HSPWME_OC6PIdleLevelHigh()      SET_HSPWME_BIT(PWME_CR3, PWMECR3_OIS6_MSK)

#define PWME_SetCounter(n)              (PWME_CNTRH = HIBYTE(n), PWME_CNTRL = LOBYTE(n))
#define PWME_SetClockDivider(n)         (PWME_PSCRH = HIBYTE(n), PWME_PSCRL = LOBYTE(n))
#define PWME_SetReload16(n)             (PWME_ARRH = HIBYTE(n), PWME_ARRL = LOBYTE(n))
#define PWME_SetRepeatCounter(n)        (PWME_RCRH = HIBYTE(n), PWME_RCR = LOBYTE(n))

#define HSPWME_SetCounter(n)            (WRITE_HSPWME(PWME_CNTRH, HIBYTE(n)), WRITE_HSPWME(PWME_CNTRL, LOBYTE(n)))
#define HSPWME_SetClockDivider(n)       (WRITE_HSPWME(PWME_PSCRH, HIBYTE(n)), WRITE_HSPWME(PWME_PSCRL, LOBYTE(n)))
#define HSPWME_SetReload16(n)           (WRITE_HSPWME(PWME_ARRH, HIBYTE(n)), WRITE_HSPWME(PWME_ARRL, LOBYTE(n)))
#define HSPWME_SetRepeatCounter(n)      (WRITE_HSPWME(PWME_RCRH, HIBYTE(n)), WRITE_HSPWME(PWME_RCR, LOBYTE(n)))

#define PWME_SetCCR1Value(n)            (PWME_CCR1H = HIBYTE(n), PWME_CCR1L = LOBYTE(n))
#define PWME_SetCCR2Value(n)            (PWME_CCR2H = HIBYTE(n), PWME_CCR2L = LOBYTE(n))
#define PWME_SetCCR3Value(n)            (PWME_CCR3H = HIBYTE(n), PWME_CCR3L = LOBYTE(n))
#define PWME_SetCCR4Value(n)            (PWME_CCR4H = HIBYTE(n), PWME_CCR4L = LOBYTE(n))
#define PWME_SetCCR5Value(n)            (PWME_CCR5H = HIBYTE(n), PWME_CCR5L = LOBYTE(n))
#define PWME_SetCCR6Value(n)            (PWME_CCR6H = HIBYTE(n), PWME_CCR6L = LOBYTE(n))

#define HSPWME_SetCCR1Value(n)          (WRITE_HSPWME(PWME_CCR1H, HIBYTE(n)), WRITE_HSPWME(PWME_CCR1L, LOBYTE(n)))
#define HSPWME_SetCCR2Value(n)          (WRITE_HSPWME(PWME_CCR2H, HIBYTE(n)), WRITE_HSPWME(PWME_CCR2L, LOBYTE(n)))
#define HSPWME_SetCCR3Value(n)          (WRITE_HSPWME(PWME_CCR3H, HIBYTE(n)), WRITE_HSPWME(PWME_CCR3L, LOBYTE(n)))
#define HSPWME_SetCCR4Value(n)          (WRITE_HSPWME(PWME_CCR4H, HIBYTE(n)), WRITE_HSPWME(PWME_CCR4L, LOBYTE(n)))
#define HSPWME_SetCCR5Value(n)          (WRITE_HSPWME(PWME_CCR5H, HIBYTE(n)), WRITE_HSPWME(PWME_CCR5L, LOBYTE(n)))
#define HSPWME_SetCCR6Value(n)          (WRITE_HSPWME(PWME_CCR6H, HIBYTE(n)), WRITE_HSPWME(PWME_CCR6L, LOBYTE(n)))

#define PWME_ReadReload16()             MAKEWORD(PWME_ARRL, PWME_ARRH)

#define HSPWME_ReadReload16()           MAKEWORD(READ_HSPWME(PWME_ARRL), READ_HSPWME(PWME_ARRH))

#define PWME_ReadCCR1Value()            MAKEWORD(PWME_CCR1L, PWME_CCR1H)
#define PWME_ReadCCR2Value()            MAKEWORD(PWME_CCR2L, PWME_CCR2H)
#define PWME_ReadCCR3Value()            MAKEWORD(PWME_CCR3L, PWME_CCR3H)
#define PWME_ReadCCR4Value()            MAKEWORD(PWME_CCR4L, PWME_CCR4H)
#define PWME_ReadCCR5Value()            MAKEWORD(PWME_CCR5L, PWME_CCR5H)
#define PWME_ReadCCR6Value()            MAKEWORD(PWME_CCR6L, PWME_CCR6H)

#define HSPWME_ReadCCR1Value()          MAKEWORD(READ_HSPWME(PWME_CCR1L), READ_HSPWME(PWME_CCR1H))
#define HSPWME_ReadCCR2Value()          MAKEWORD(READ_HSPWME(PWME_CCR2L), READ_HSPWME(PWME_CCR2H))
#define HSPWME_ReadCCR3Value()          MAKEWORD(READ_HSPWME(PWME_CCR3L), READ_HSPWME(PWME_CCR3H))
#define HSPWME_ReadCCR4Value()          MAKEWORD(READ_HSPWME(PWME_CCR4L), READ_HSPWME(PWME_CCR4H))
#define HSPWME_ReadCCR5Value()          MAKEWORD(READ_HSPWME(PWME_CCR5L), READ_HSPWME(PWME_CCR5H))
#define HSPWME_ReadCCR6Value()          MAKEWORD(READ_HSPWME(PWME_CCR6L), READ_HSPWME(PWME_CCR6H))

#define PWME_SetDeadTime(n)             PWME_DTR = LOBYTE(n)

#define HSPWME_SetDeadTime(n)           WRITE_HSPWME(PWME_DTR, LOBYTE(n))

