fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMECCR5X_GC5C3_MSK             BIT7
#define PWMECCR5X_GC5C2_MSK             BIT6
#define PWMECCR5X_GC5C1_MSK             BIT5
#define PWME_OC3REFCIndependent()       CLR_REG_BIT(PWME_CCR5X, PWMECCR5X_GC5C3_MSK)
#define PWME_OC2REFCIndependent()       CLR_REG_BIT(PWME_CCR5X, PWMECCR5X_GC5C2_MSK)
#define PWME_OC1REFCIndependent()       CLR_REG_BIT(PWME_CCR5X, PWMECCR5X_GC5C1_MSK)
#define PWME_OC3REFCAndWithOC5REF()     SET_REG_BIT(PWME_CCR5X, PWMECCR5X_GC5C3_MSK)
#define PWME_OC2REFCAndWithOC5REF()     SET_REG_BIT(PWME_CCR5X, PWMECCR5X_GC5C2_MSK)
#define PWME_OC1REFCAndWithOC5REF()     SET_REG_BIT(PWME_CCR5X, PWMECCR5X_GC5C1_MSK)

#define HSPWME_OC3REFCIndependent()     CLR_HSPWME_BIT(PWME_CCR5X, PWMECCR5X_GC5C3_MSK)
#define HSPWME_OC2REFCIndependent()     CLR_HSPWME_BIT(PWME_CCR5X, PWMECCR5X_GC5C2_MSK)
#define HSPWME_OC1REFCIndependent()     CLR_HSPWME_BIT(PWME_CCR5X, PWMECCR5X_GC5C1_MSK)
#define HSPWME_OC3REFCAndWithOC5REF()   SET_HSPWME_BIT(PWME_CCR5X, PWMECCR5X_GC5C3_MSK)
#define HSPWME_OC2REFCAndWithOC5REF()   SET_HSPWME_BIT(PWME_CCR5X, PWMECCR5X_GC5C2_MSK)
#define HSPWME_OC1REFCAndWithOC5REF()   SET_HSPWME_BIT(PWME_CCR5X, PWMECCR5X_GC5C1_MSK)

////////////////////////

#define PWMEDER_TDE_MSK                 BIT6
#define PWMEDER_COMDE_MSK               BIT5
#define PWMEDER_CC4DE_MSK               BIT4
#define PWMEDER_CC3DE_MSK               BIT3
#define PWMEDER_CC2DE_MSK               BIT2
#define PWMEDER_CC1DE_MSK               BIT1
#define PWMEDER_UDE_MSK                 BIT0
#define PWME_TriggerIntAsDMAEvent()     SET_REG_BIT(PWME_DER, PWMEDER_TDE_MSK)
#define PWME_COMIntAsDMAEvent()         SET_REG_BIT(PWME_DER, PWMEDER_COMDE_MSK)
#define PWME_CC4IntAsDMAEvent()         SET_REG_BIT(PWME_DER, PWMEDER_CC4DE_MSK)
#define PWME_CC3IntAsDMAEvent()         SET_REG_BIT(PWME_DER, PWMEDER_CC3DE_MSK)
#define PWME_CC2IntAsDMAEvent()         SET_REG_BIT(PWME_DER, PWMEDER_CC2DE_MSK)
#define PWME_CC1IntAsDMAEvent()         SET_REG_BIT(PWME_DER, PWMEDER_CC1DE_MSK)
#define PWME_UpdateIntAsDMAEvent()      SET_REG_BIT(PWME_DER, PWMEDER_UDE_MSK)

#define HSPWME_TriggerIntAsDMAEvent()   SET_HSPWME_BIT(PWME_DER, PWMEDER_TDE_MSK)
#define HSPWME_COMIntAsDMAEvent()       SET_HSPWME_BIT(PWME_DER, PWMEDER_COMDE_MSK)
#define HSPWME_CC4IntAsDMAEvent()       SET_HSPWME_BIT(PWME_DER, PWMEDER_CC4DE_MSK)
#define HSPWME_CC3IntAsDMAEvent()       SET_HSPWME_BIT(PWME_DER, PWMEDER_CC3DE_MSK)
#define HSPWME_CC2IntAsDMAEvent()       SET_HSPWME_BIT(PWME_DER, PWMEDER_CC2DE_MSK)
#define HSPWME_CC1IntAsDMAEvent()       SET_HSPWME_BIT(PWME_DER, PWMEDER_CC1DE_MSK)
#define HSPWME_UpdateIntAsDMAEvent()    SET_HSPWME_BIT(PWME_DER, PWMEDER_UDE_MSK)

#define PWMEDBA_DBA_MSK                 (BIT4 | BIT_LN)
#define PWME_SetDMABaseAddress(d)       MODIFY_REG(PWME_DBA,  PWMEDBA_DBA_MSK, ((d) << 0))

#define HSPWME_SetDMABaseAddress(d)     MODIFY_HSPWME(PWME_DBA,  PWMEDBA_DBA_MSK, ((d) << 0))

#define PWMEDBL_DBL_MSK                 (BIT4 | BIT_LN)
#define PWME_SetDMABurstCount(d)        MODIFY_REG(PWME_DBL,  PWMEDBL_DBL_MSK, ((d) << 0))

#define HSPWME_SetDMABurstCount(d)      MODIFY_HSPWME(PWME_DBL,  PWMEDBL_DBL_MSK, ((d) << 0))

#define PWMEDMACR_SIZE_MSK              (BIT1 | BIT0)
#define PWME_SetDMABurstBytes(n)        MODIFY_REG(PWME_DMACR,  PWMEDMACR_SIZE_MSK, ((n) << 0))
#define PWME_SetDMABurst1Byte()         PWME_SetDMABurstBytes(0)
#define PWME_SetDMABurst2Bytes()        PWME_SetDMABurstBytes(1)
#define PWME_SetDMABurst3Bytes()        PWME_SetDMABurstBytes(2)
#define PWME_SetDMABurst4Bytes()        PWME_SetDMABurstBytes(3)

#define HSPWME_SetDMABurstBytes(n)      MODIFY_HSPWME(PWME_DMACR,  PWMEDMACR_SIZE_MSK, ((n) << 0))
#define HSPWME_SetDMABurst1Byte()       HSPWME_SetDMABurstBytes(0)
#define HSPWME_SetDMABurst2Bytes()      HSPWME_SetDMABurstBytes(1)
#define HSPWME_SetDMABurst3Bytes()      HSPWME_SetDMABurstBytes(2)
#define HSPWME_SetDMABurst4Bytes()      HSPWME_SetDMABurstBytes(3)

#define PWMEDMACR_DSKIP_MSK             BIT4
#define PWME_DMASkipSpace()             SET_REG_BIT(PWME_DMACR, PWMEDMACR_DSKIP_MSK)
#define PWME_DMANeverSkipSpace()        CLR_REG_BIT(PWME_DMACR, PWMEDMACR_DSKIP_MSK)

#define HSPWME_DMASkipSpace()           SET_HSPWME_BIT(PWME_DMACR, PWMEDMACR_DSKIP_MSK)
#define HSPWME_DMANeverSkipSpace()      CLR_HSPWME_BIT(PWME_DMACR, PWMEDMACR_DSKIP_MSK)

#define PWMEDMACR_DDIR_MSK              BIT3
#define PWME_SetDMAOutput()             CLR_REG_BIT(PWME_DMACR, PWMEDMACR_DDIR_MSK)
#define PWME_SetDMAInput()              SET_REG_BIT(PWME_DMACR, PWMEDMACR_DDIR_MSK)

#define HSPWME_SetDMAOutput()           CLR_HSPWME_BIT(PWME_DMACR, PWMEDMACR_DDIR_MSK)
#define HSPWME_SetDMAInput()            SET_HSPWME_BIT(PWME_DMACR, PWMEDMACR_DDIR_MSK)

#define PWMEDMACR_DMAEN_MSK             BIT2
#define PWME_EnableDMA()                SET_REG_BIT(PWME_DMACR, PWMEDMACR_DMAEN_MSK)
#define PWME_DisableDMA()               CLR_REG_BIT(PWME_DMACR, PWMEDMACR_DMAEN_MSK)

#define HSPWME_EnableDMA()              SET_HSPWME_BIT(PWME_DMACR, PWMEDMACR_DMAEN_MSK)
#define HSPWME_DisableDMA()             CLR_HSPWME_BIT(PWME_DMACR, PWMEDMACR_DMAEN_MSK)

////////////////////////

#define PWMFENO_ENO5P_MSK               BIT0
#define PWMFENO_ENO6P_MSK               BIT2
#define PWMFENO_ENO7P_MSK               BIT4
#define PWMFENO_ENO8P_MSK               BIT6
#define PWMF_EnablePWM5POutput()        SET_REG_BIT(PWMF_ENO, PWMFENO_ENO5P_MSK)
#define PWMF_DisablePWM5POutput()       CLR_REG_BIT(PWMF_ENO, PWMFENO_ENO5P_MSK)
#define PWMF_EnablePWM6POutput()        SET_REG_BIT(PWMF_ENO, PWMFENO_ENO6P_MSK)
#define PWMF_DisablePWM6POutput()       CLR_REG_BIT(PWMF_ENO, PWMFENO_ENO6P_MSK)
#define PWMF_EnablePWM7POutput()        SET_REG_BIT(PWMF_ENO, PWMFENO_ENO7P_MSK)
#define PWMF_DisablePWM7POutput()       CLR_REG_BIT(PWMF_ENO, PWMFENO_ENO7P_MSK)
#define PWMF_EnablePWM8POutput()        SET_REG_BIT(PWMF_ENO, PWMFENO_ENO8P_MSK)
#define PWMF_DisablePWM8POutput()       CLR_REG_BIT(PWMF_ENO, PWMFENO_ENO8P_MSK)

#define HSPWMF_EnablePWM5POutput()      SET_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO5P_MSK)
#define HSPWMF_DisablePWM5POutput()     CLR_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO5P_MSK)
#define HSPWMF_EnablePWM6POutput()      SET_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO6P_MSK)
#define HSPWMF_DisablePWM6POutput()     CLR_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO6P_MSK)
#define HSPWMF_EnablePWM7POutput()      SET_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO7P_MSK)
#define HSPWMF_DisablePWM7POutput()     CLR_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO7P_MSK)
#define HSPWMF_EnablePWM8POutput()      SET_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO8P_MSK)
#define HSPWMF_DisablePWM8POutput()     CLR_HSPWMF_BIT(PWMF_ENO, PWMFENO_ENO8P_MSK)

#define PWMFIOAUX_AUX5P_MSK             BIT0
#define PWMFIOAUX_AUX6P_MSK             BIT2
#define PWMFIOAUX_AUX7P_MSK             BIT4
#define PWMFIOAUX_AUX8P_MSK             BIT6
#define PWMF_EnoCtrlPWM5P()             CLR_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX5P_MSK)
#define PWMF_EnoBrkCtrlPWM5P()          SET_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX5P_MSK)
#define PWMF_EnoCtrlPWM6P()             CLR_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX6P_MSK)
#define PWMF_EnoBrkCtrlPWM6P()          SET_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX6P_MSK)
#define PWMF_EnoCtrlPWM7P()             CLR_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX7P_MSK)
#define PWMF_EnoBrkCtrlPWM7P()          SET_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX7P_MSK)
#define PWMF_EnoCtrlPWM8P()             CLR_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX8P_MSK)
#define PWMF_EnoBrkCtrlPWM8P()          SET_REG_BIT(PWMF_IOAUX, PWMFIOAUX_AUX8P_MSK)

#define HSPWMF_EnoCtrlPWM5P()           CLR_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX5P_MSK)
#define HSPWMF_EnoBrkCtrlPWM5P()        SET_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX5P_MSK)
#define HSPWMF_EnoCtrlPWM6P()           CLR_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX6P_MSK)
#define HSPWMF_EnoBrkCtrlPWM6P()        SET_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX6P_MSK)
#define HSPWMF_EnoCtrlPWM7P()           CLR_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX7P_MSK)
#define HSPWMF_EnoBrkCtrlPWM7P()        SET_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX7P_MSK)
#define HSPWMF_EnoCtrlPWM8P()           CLR_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX8P_MSK)
#define HSPWMF_EnoBrkCtrlPWM8P()        SET_HSPWMF_BIT(PWMF_IOAUX, PWMFIOAUX_AUX8P_MSK)

