fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMFCR1_ARPE_MSK                BIT7
#define PWMF_UnbufferARR()              CLR_REG_BIT(PWMF_CR1, PWMFCR1_ARPE_MSK)
#define PWMF_BufferARR()                SET_REG_BIT(PWMF_CR1, PWMFCR1_ARPE_MSK)

#define HSPWMF_UnbufferARR()            CLR_HSPWMF_BIT(PWMF_CR1, PWMFCR1_ARPE_MSK)
#define HSPWMF_BufferARR()              SET_HSPWMF_BIT(PWMF_CR1, PWMFCR1_ARPE_MSK)

#define PWMFCR1_CMS_MSK                 (BIT6 | BIT5)
#define PWMF_SetAlignMode(n)            MODIFY_REG(PWMF_CR1,  PWMFCR1_CMS_MSK, ((n) << 5))
#define PWMF_EdgeAlignMode()            PWMF_SetAlignMode(0)
#define PWMF_CenterAlignMode1()         PWMF_SetAlignMode(1)
#define PWMF_CenterAlignMode2()         PWMF_SetAlignMode(2)
#define PWMF_CenterAlignMode3()         PWMF_SetAlignMode(3)

#define HSPWMF_SetAlignMode(n)          MODIFY_HSPWMF(PWMF_CR1,  PWMFCR1_CMS_MSK, ((n) << 5))
#define HSPWMF_EdgeAlignMode()          HSPWMF_SetAlignMode(0)
#define HSPWMF_CenterAlignMode1()       HSPWMF_SetAlignMode(1)
#define HSPWMF_CenterAlignMode2()       HSPWMF_SetAlignMode(2)
#define HSPWMF_CenterAlignMode3()       HSPWMF_SetAlignMode(3)

#define PWMFCR1_DIR_MSK                 BIT4
#define PWMF_UpCounter()                CLR_REG_BIT(PWMF_CR1, PWMFCR1_DIR_MSK)
#define PWMF_DownCounter()              SET_REG_BIT(PWMF_CR1, PWMFCR1_DIR_MSK)

#define HSPWMF_UpCounter()              CLR_HSPWMF_BIT(PWMF_CR1, PWMFCR1_DIR_MSK)
#define HSPWMF_DownCounter()            SET_HSPWMF_BIT(PWMF_CR1, PWMFCR1_DIR_MSK)

#define PWMFCR1_OPM_MSK                 BIT3
#define PWMF_ContinueMode()             CLR_REG_BIT(PWMF_CR1, PWMFCR1_OPM_MSK)
#define PWMF_OnePulseMode()             SET_REG_BIT(PWMF_CR1, PWMFCR1_OPM_MSK)

#define HSPWMF_ContinueMode()           CLR_HSPWMF_BIT(PWMF_CR1, PWMFCR1_OPM_MSK)
#define HSPWMF_OnePulseMode()           SET_HSPWMF_BIT(PWMF_CR1, PWMFCR1_OPM_MSK)

#define PWMFCR1_URS_MSK                 BIT2
#define PWMF_UpdateRequestMode1()       SET_REG_BIT(PWMF_CR1, PWMFCR1_URS_MSK)
#define PWMF_UpdateRequestMode2()       CLR_REG_BIT(PWMF_CR1, PWMFCR1_URS_MSK)

#define HSPWMF_UpdateRequestMode1()     SET_HSPWMF_BIT(PWMF_CR1, PWMFCR1_URS_MSK)
#define HSPWMF_UpdateRequestMode2()     CLR_HSPWMF_BIT(PWMF_CR1, PWMFCR1_URS_MSK)

#define PWMFCR1_UDIS_MSK                BIT1
#define PWMF_EnableUpdate()             CLR_REG_BIT(PWMF_CR1, PWMFCR1_UDIS_MSK)
#define PWMF_DisableUpdate()            SET_REG_BIT(PWMF_CR1, PWMFCR1_UDIS_MSK)

#define HSPWMF_EnableUpdate()           CLR_HSPWMF_BIT(PWMF_CR1, PWMFCR1_UDIS_MSK)
#define HSPWMF_DisableUpdate()          SET_HSPWMF_BIT(PWMF_CR1, PWMFCR1_UDIS_MSK)

#define PWMFCR1_CEN_MSK                 BIT0
#define PWMF_Run()                      SET_REG_BIT(PWMF_CR1, PWMFCR1_CEN_MSK)
#define PWMF_Stop()                     CLR_REG_BIT(PWMF_CR1, PWMFCR1_CEN_MSK)

#define HSPWMF_Run()                    SET_HSPWMF_BIT(PWMF_CR1, PWMFCR1_CEN_MSK)
#define HSPWMF_Stop()                   CLR_HSPWMF_BIT(PWMF_CR1, PWMFCR1_CEN_MSK)

#define PWMFCR2_TIS_MSK                 BIT7
#define PWMF_PWM5PToTI()                CLR_REG_BIT(PWMF_CR2, PWMFCR2_TIS_MSK)
#define PWMF_Xor5P6P7PToTI()            SET_REG_BIT(PWMF_CR2, PWMFCR2_TIS_MSK)

#define HSPWMF_PWM5PToTI()              CLR_HSPWMF_BIT(PWMF_CR2, PWMFCR2_TIS_MSK)
#define HSPWMF_Xor5P6P7PToTI()          SET_HSPWMF_BIT(PWMF_CR2, PWMFCR2_TIS_MSK)

#define PWMFCR2_MMS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMF_SelectTRGO(n)              MODIFY_REG(PWMF_CR2,  PWMFCR2_MMS_MSK, ((n) << 4))
#define PWMF_ResetAsTRGO()              PWMF_SelectTRGO(0)
#define PWMF_EnableAsTRGO()             PWMF_SelectTRGO(1)
#define PWMF_UpdateAsTRGO()             PWMF_SelectTRGO(2)
#define PWMF_MatchAsTRGO()              PWMF_SelectTRGO(3)
#define PWMF_OC5REFAsTRGO()             PWMF_SelectTRGO(4)
#define PWMF_OC6REFAsTRGO()             PWMF_SelectTRGO(5)
#define PWMF_OC7REFAsTRGO()             PWMF_SelectTRGO(6)
#define PWMF_OC8REFAsTRGO()             PWMF_SelectTRGO(7)

#define HSPWMF_SelectTRGO(n)            MODIFY_HSPWMF(PWMF_CR2,  PWMFCR2_MMS_MSK, ((n) << 4))
#define HSPWMF_ResetAsTRGO()            HSPWMF_SelectTRGO(0)
#define HSPWMF_EnableAsTRGO()           HSPWMF_SelectTRGO(1)
#define HSPWMF_UpdateAsTRGO()           HSPWMF_SelectTRGO(2)
#define HSPWMF_MatchAsTRGO()            HSPWMF_SelectTRGO(3)
#define HSPWMF_OC5REFAsTRGO()           HSPWMF_SelectTRGO(4)
#define HSPWMF_OC6REFAsTRGO()           HSPWMF_SelectTRGO(5)
#define HSPWMF_OC7REFAsTRGO()           HSPWMF_SelectTRGO(6)
#define HSPWMF_OC8REFAsTRGO()           HSPWMF_SelectTRGO(7)

#define PWMFCR2_COMS_MSK                BIT2
#define PWMF_CCOCUpdateMode0()          CLR_REG_BIT(PWMF_CR2, PWMFCR2_COMS_MSK)
#define PWMF_CCOCUpdateMode1()          SET_REG_BIT(PWMF_CR2, PWMFCR2_COMS_MSK)

#define HSPWMF_CCOCUpdateMode0()        CLR_HSPWMF_BIT(PWMF_CR2, PWMFCR2_COMS_MSK)
#define HSPWMF_CCOCUpdateMode1()        SET_HSPWMF_BIT(PWMF_CR2, PWMFCR2_COMS_MSK)

#define PWMFCR2_CCPC_MSK                BIT0
#define PWMF_UnbufferCCOC()             CLR_REG_BIT(PWMF_CR2, PWMFCR2_CCPC_MSK)
#define PWMF_BufferCCOC()               SET_REG_BIT(PWMF_CR2, PWMFCR2_CCPC_MSK)

#define HSPWMF_UnbufferCCOC()           CLR_HSPWMF_BIT(PWMF_CR2, PWMFCR2_CCPC_MSK)
#define HSPWMF_BufferCCOC()             SET_HSPWMF_BIT(PWMF_CR2, PWMFCR2_CCPC_MSK)

#define PWMFSMCR_MSM_MSK                BIT7
#define PWMF_StandaloneMode()           CLR_REG_BIT(PWMF_SMCR, PWMFSMCR_MSM_MSK)
#define PWMF_MasterSlaveMode()          SET_REG_BIT(PWMF_SMCR, PWMFSMCR_MSM_MSK)

#define HSPWMF_StandaloneMode()         CLR_HSPWMF_BIT(PWMF_SMCR, PWMFSMCR_MSM_MSK)
#define HSPWMF_MasterSlaveMode()        SET_HSPWMF_BIT(PWMF_SMCR, PWMFSMCR_MSM_MSK)

#define PWMFSMCR_TS_MSK                 (BIT6 | BIT5 | BIT4)
#define PWMF_SelectTRGI(n)              MODIFY_REG(PWMF_SMCR,  PWMFSMCR_TS_MSK, ((n) << 4))
#define PWMF_DisableTRGI()              PWMF_SelectTRGI(0)
#define PWMF_TI5FEDAsTRGI()             PWMF_SelectTRGI(4)
#define PWMF_TI5FP5AsTRGI()             PWMF_SelectTRGI(5)
#define PWMF_TI6FP6AsTRGI()             PWMF_SelectTRGI(6)
#define PWMF_ETRFAsTRGI()               PWMF_SelectTRGI(7)

