fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMF_SelectTRGI(n)            MODIFY_HSPWMF(PWMF_SMCR,  PWMFSMCR_TS_MSK, ((n) << 4))
#define HSPWMF_DisableTRGI()            HSPWMF_SelectTRGI(0)
#define HSPWMF_TI5FEDAsTRGI()           HSPWMF_SelectTRGI(4)
#define HSPWMF_TI5FP5AsTRGI()           HSPWMF_SelectTRGI(5)
#define HSPWMF_TI6FP6AsTRGI()           HSPWMF_SelectTRGI(6)
#define HSPWMF_ETRFAsTRGI()             HSPWMF_SelectTRGI(7)

#define PWMFSMCR_SMS_MSK                (BIT2 | BIT1 | BIT0)
#define PWMF_SetClockMode(n)            MODIFY_REG(PWMF_SMCR,  PWMFSMCR_SMS_MSK, ((n) << 0))
#define PWMF_InternalClockMode()        PWMF_SetClockMode(0)
#define PWMF_EncoderMode1()             PWMF_SetClockMode(1)
#define PWMF_EncoderMode2()             PWMF_SetClockMode(2)
#define PWMF_EncoderMode3()             PWMF_SetClockMode(3)
#define PWMF_TriggerResetMode()         PWMF_SetClockMode(4)
#define PWMF_TriggerGateMode()          PWMF_SetClockMode(5)
#define PWMF_TriggerStartMode()         PWMF_SetClockMode(6)
#define PWMF_ExternalClockMode()        PWMF_SetClockMode(7)

#define HSPWMF_SetClockMode(n)          MODIFY_HSPWMF(PWMF_SMCR,  PWMFSMCR_SMS_MSK, ((n) << 0))
#define HSPWMF_InternalClockMode()      HSPWMF_SetClockMode(0)
#define HSPWMF_EncoderMode1()           HSPWMF_SetClockMode(1)
#define HSPWMF_EncoderMode2()           HSPWMF_SetClockMode(2)
#define HSPWMF_EncoderMode3()           HSPWMF_SetClockMode(3)
#define HSPWMF_TriggerResetMode()       HSPWMF_SetClockMode(4)
#define HSPWMF_TriggerGateMode()        HSPWMF_SetClockMode(5)
#define HSPWMF_TriggerStartMode()       HSPWMF_SetClockMode(6)
#define HSPWMF_ExternalClockMode()      HSPWMF_SetClockMode(7)

#define PWMFETR_ETP_MSK                 BIT7
#define PWMF_ETRNonInverted()           CLR_REG_BIT(PWMF_ETR, PWMFETR_ETP_MSK)
#define PWMF_ETRInverted()              SET_REG_BIT(PWMF_ETR, PWMFETR_ETP_MSK)

#define HSPWMF_ETRNonInverted()         CLR_HSPWMF_BIT(PWMF_ETR, PWMFETR_ETP_MSK)
#define HSPWMF_ETRInverted()            SET_HSPWMF_BIT(PWMF_ETR, PWMFETR_ETP_MSK)

#define PWMFETR_ECE_MSK                 BIT6
#define PWMF_DisableExternalClock2()    CLR_REG_BIT(PWMF_ETR, PWMFETR_ECE_MSK)
#define PWMF_EnableExternalClock2()     SET_REG_BIT(PWMF_ETR, PWMFETR_ECE_MSK)

#define HSPWMF_DisableExternalClock2()  CLR_HSPWMF_BIT(PWMF_ETR, PWMFETR_ECE_MSK)
#define HSPWMF_EnableExternalClock2()   SET_HSPWMF_BIT(PWMF_ETR, PWMFETR_ECE_MSK)

#define PWMFETR_ETPS_MSK                (BIT5 | BIT4)
#define PWMF_SetETRDivider(n)           MODIFY_REG(PWMF_ETR,  PWMFETR_ETPS_MSK, ((n) << 4))
#define PWMF_ETRDivider1()              PWMF_SetETRDivider(0)
#define PWMF_ETRDivider2()              PWMF_SetETRDivider(1)
#define PWMF_ETRDivider4()              PWMF_SetETRDivider(2)
#define PWMF_ETRDivider8()              PWMF_SetETRDivider(3)

#define HSPWMF_SetETRDivider(n)         MODIFY_HSPWMF(PWMF_ETR,  PWMFETR_ETPS_MSK, ((n) << 4))
#define HSPWMF_ETRDivider1()            HSPWMF_SetETRDivider(0)
#define HSPWMF_ETRDivider2()            HSPWMF_SetETRDivider(1)
#define HSPWMF_ETRDivider4()            HSPWMF_SetETRDivider(2)
#define HSPWMF_ETRDivider8()            HSPWMF_SetETRDivider(3)

#define PWMFETR_ETF_MSK                 (BIT_LN)
#define PWMF_SetETRFilter(n)            MODIFY_REG(PWMF_ETR,  PWMFETR_ETF_MSK, ((n) << 0))
#define PWMF_ETRFilter1()               PWMF_SetETRFilter(0)
#define PWMF_ETRFilter2()               PWMF_SetETRFilter(1)
#define PWMF_ETRFilter4()               PWMF_SetETRFilter(2)
#define PWMF_ETRFilter8()               PWMF_SetETRFilter(3)
#define PWMF_ETRFilter12()              PWMF_SetETRFilter(4)
#define PWMF_ETRFilter16()              PWMF_SetETRFilter(5)
#define PWMF_ETRFilter24()              PWMF_SetETRFilter(6)
#define PWMF_ETRFilter32()              PWMF_SetETRFilter(7)
#define PWMF_ETRFilter48()              PWMF_SetETRFilter(8)
#define PWMF_ETRFilter64()              PWMF_SetETRFilter(9)
#define PWMF_ETRFilter80()              PWMF_SetETRFilter(10)
#define PWMF_ETRFilter96()              PWMF_SetETRFilter(11)
#define PWMF_ETRFilter128()             PWMF_SetETRFilter(12)
#define PWMF_ETRFilter160()             PWMF_SetETRFilter(13)
#define PWMF_ETRFilter192()             PWMF_SetETRFilter(14)
#define PWMF_ETRFilter256()             PWMF_SetETRFilter(15)

#define HSPWMF_SetETRFilter(n)          MODIFY_HSPWMF(PWMF_ETR,  PWMFETR_ETF_MSK, ((n) << 0))
#define HSPWMF_ETRFilter1()             HSPWMF_SetETRFilter(0)
#define HSPWMF_ETRFilter2()             HSPWMF_SetETRFilter(1)
#define HSPWMF_ETRFilter4()             HSPWMF_SetETRFilter(2)
#define HSPWMF_ETRFilter8()             HSPWMF_SetETRFilter(3)
#define HSPWMF_ETRFilter12()            HSPWMF_SetETRFilter(4)
#define HSPWMF_ETRFilter16()            HSPWMF_SetETRFilter(5)
#define HSPWMF_ETRFilter24()            HSPWMF_SetETRFilter(6)
#define HSPWMF_ETRFilter32()            HSPWMF_SetETRFilter(7)
#define HSPWMF_ETRFilter48()            HSPWMF_SetETRFilter(8)
#define HSPWMF_ETRFilter64()            HSPWMF_SetETRFilter(9)
#define HSPWMF_ETRFilter80()            HSPWMF_SetETRFilter(10)
#define HSPWMF_ETRFilter96()            HSPWMF_SetETRFilter(11)
#define HSPWMF_ETRFilter128()           HSPWMF_SetETRFilter(12)
#define HSPWMF_ETRFilter160()           HSPWMF_SetETRFilter(13)
#define HSPWMF_ETRFilter192()           HSPWMF_SetETRFilter(14)
#define HSPWMF_ETRFilter256()           HSPWMF_SetETRFilter(15)

#define PWMFEGR_BG_MSK                  BIT7
#define PWMFEGR_TG_MSK                  BIT6
#define PWMFEGR_COMG_MSK                BIT5
#define PWMFEGR_CC8G_MSK                BIT4
#define PWMFEGR_CC7G_MSK                BIT3
#define PWMFEGR_CC6G_MSK                BIT2
#define PWMFEGR_CC5G_MSK                BIT1
#define PWMFEGR_UG_MSK                  BIT0
#define PWMF_GenerateBreakEvent()       SET_REG_BIT(PWMF_EGR, PWMFEGR_BG_MSK)
#define PWMF_GenerateTriggerEvent()     SET_REG_BIT(PWMF_EGR, PWMFEGR_TG_MSK)
#define PWMF_GenerateCOMEvent()         SET_REG_BIT(PWMF_EGR, PWMFEGR_COMG_MSK)
#define PWMF_GenerateCC8Event()         SET_REG_BIT(PWMF_EGR, PWMFEGR_CC8G_MSK)
#define PWMF_GenerateCC7Event()         SET_REG_BIT(PWMF_EGR, PWMFEGR_CC7G_MSK)
#define PWMF_GenerateCC6Event()         SET_REG_BIT(PWMF_EGR, PWMFEGR_CC6G_MSK)
#define PWMF_GenerateCC5Event()         SET_REG_BIT(PWMF_EGR, PWMFEGR_CC5G_MSK)
#define PWMF_GenerateUpdateEvent()      SET_REG_BIT(PWMF_EGR, PWMFEGR_UG_MSK)

#define HSPWMF_GenerateBreakEvent()     SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_BG_MSK)
#define HSPWMF_GenerateTriggerEvent()   SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_TG_MSK)
#define HSPWMF_GenerateCOMEvent()       SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_COMG_MSK)
#define HSPWMF_GenerateCC8Event()       SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_CC8G_MSK)
#define HSPWMF_GenerateCC7Event()       SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_CC7G_MSK)
#define HSPWMF_GenerateCC6Event()       SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_CC6G_MSK)
#define HSPWMF_GenerateCC5Event()       SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_CC5G_MSK)
#define HSPWMF_GenerateUpdateEvent()    SET_HSPWMF_BIT(PWMF_EGR, PWMFEGR_UG_MSK)

#define PWMFCCMR1_OC5CE_MSK             BIT7
#define PWMF_EnableETRFClearOC5REF()    SET_REG_BIT(PWMF_CCMR1, PWMFCCMR1_OC5CE_MSK)
#define PWMF_DisableETRFClearOC5REF()   CLR_REG_BIT(PWMF_CCMR1, PWMFCCMR1_OC5CE_MSK)

#define HSPWMF_EnableETRFClearOC5REF()  SET_HSPWMF_BIT(PWMF_CCMR1, PWMFCCMR1_OC5CE_MSK)
#define HSPWMF_DisableETRFClearOC5REF() CLR_HSPWMF_BIT(PWMF_CCMR1, PWMFCCMR1_OC5CE_MSK)

