fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMFCCMR1_OC5M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMF_SetOC5OutputMode(n)        MODIFY_REG(PWMF_CCMR1,  PWMFCCMR1_OC5M_MSK, ((n) << 4))
#define PWMF_OC5REFFrozen()             PWMF_SetOC5OutputMode(0)
#define PWMF_OC5REFHighIfMatch()        PWMF_SetOC5OutputMode(1)
#define PWMF_OC5REFLowIfMatch()         PWMF_SetOC5OutputMode(2)
#define PWMF_OC5REFToggleIfMatch()      PWMF_SetOC5OutputMode(3)
#define PWMF_OC5REFForceLow()           PWMF_SetOC5OutputMode(4)
#define PWMF_OC5REFForceHigh()          PWMF_SetOC5OutputMode(5)
#define PWMF_OC5REFPWMMode1()           PWMF_SetOC5OutputMode(6)
#define PWMF_OC5REFPWMMode2()           PWMF_SetOC5OutputMode(7)

#define HSPWMF_SetOC5OutputMode(n)      MODIFY_HSPWMF(PWMF_CCMR1,  PWMFCCMR1_OC5M_MSK, ((n) << 4))
#define HSPWMF_OC5REFFrozen()           HSPWMF_SetOC5OutputMode(0)
#define HSPWMF_OC5REFHighIfMatch()      HSPWMF_SetOC5OutputMode(1)
#define HSPWMF_OC5REFLowIfMatch()       HSPWMF_SetOC5OutputMode(2)
#define HSPWMF_OC5REFToggleIfMatch()    HSPWMF_SetOC5OutputMode(3)
#define HSPWMF_OC5REFForceLow()         HSPWMF_SetOC5OutputMode(4)
#define HSPWMF_OC5REFForceHigh()        HSPWMF_SetOC5OutputMode(5)
#define HSPWMF_OC5REFPWMMode1()         HSPWMF_SetOC5OutputMode(6)
#define HSPWMF_OC5REFPWMMode2()         HSPWMF_SetOC5OutputMode(7)

#define PWMFCCMR1_OC5PE_MSK             BIT3
#define PWMF_UnbufferCCR5()             CLR_REG_BIT(PWMF_CCMR1, PWMFCCMR1_OC5PE_MSK)
#define PWMF_BufferCCR5()               SET_REG_BIT(PWMF_CCMR1, PWMFCCMR1_OC5PE_MSK)

#define HSPWMF_UnbufferCCR5()           CLR_HSPWMF_BIT(PWMF_CCMR1, PWMFCCMR1_OC5PE_MSK)
#define HSPWMF_BufferCCR5()             SET_HSPWMF_BIT(PWMF_CCMR1, PWMFCCMR1_OC5PE_MSK)

#define PWMFCCMR1_OC5FE_MSK             BIT2
#define PWMF_DisableOC5FastMode()       CLR_REG_BIT(PWMF_CCMR1, PWMFCCMR1_OC5FE_MSK)
#define PWMF_EnableOC5FastMode()        SET_REG_BIT(PWMF_CCMR1, PWMFCCMR1_OC5FE_MSK)

#define HSPWMF_DisableOC5FastMode()     CLR_HSPWMF_BIT(PWMF_CCMR1, PWMFCCMR1_OC5FE_MSK)
#define HSPWMF_EnableOC5FastMode()      SET_HSPWMF_BIT(PWMF_CCMR1, PWMFCCMR1_OC5FE_MSK)

#define PWMFCCMR1_CC5S_MSK              (BIT1 | BIT0)
#define PWMF_SetCC5Mode(n)              MODIFY_REG(PWMF_CCMR1,  PWMFCCMR1_CC5S_MSK, ((n) << 0))
#define PWMF_CC5Output()                PWMF_SetCC5Mode(0)
#define PWMF_CC5CaptureTI5FP5()         PWMF_SetCC5Mode(1)
#define PWMF_CC5CaptureTI6FP5()         PWMF_SetCC5Mode(2)
#define PWMF_CC5CaptureTRC()            PWMF_SetCC5Mode(3)

#define HSPWMF_SetCC5Mode(n)            MODIFY_HSPWMF(PWMF_CCMR1,  PWMFCCMR1_CC5S_MSK, ((n) << 0))
#define HSPWMF_CC5Output()              HSPWMF_SetCC5Mode(0)
#define HSPWMF_CC5CaptureTI5FP5()       HSPWMF_SetCC5Mode(1)
#define HSPWMF_CC5CaptureTI6FP5()       HSPWMF_SetCC5Mode(2)
#define HSPWMF_CC5CaptureTRC()          HSPWMF_SetCC5Mode(3)

#define PWMFCCMR1_IC5F_MSK              (BIT_HN)
#define PWMF_SetIC5Filter(n)            MODIFY_REG(PWMF_CCMR1,  PWMFCCMR1_IC5F_MSK, ((n) << 4))
#define PWMF_IC5Filter1()               PWMF_SetIC5Filter(0)
#define PWMF_IC5Filter2()               PWMF_SetIC5Filter(1)
#define PWMF_IC5Filter4()               PWMF_SetIC5Filter(2)
#define PWMF_IC5Filter8()               PWMF_SetIC5Filter(3)
#define PWMF_IC5Filter12()              PWMF_SetIC5Filter(4)
#define PWMF_IC5Filter16()              PWMF_SetIC5Filter(5)
#define PWMF_IC5Filter24()              PWMF_SetIC5Filter(6)
#define PWMF_IC5Filter32()              PWMF_SetIC5Filter(7)
#define PWMF_IC5Filter48()              PWMF_SetIC5Filter(8)
#define PWMF_IC5Filter64()              PWMF_SetIC5Filter(9)
#define PWMF_IC5Filter80()              PWMF_SetIC5Filter(10)
#define PWMF_IC5Filter96()              PWMF_SetIC5Filter(11)
#define PWMF_IC5Filter128()             PWMF_SetIC5Filter(12)
#define PWMF_IC5Filter160()             PWMF_SetIC5Filter(13)
#define PWMF_IC5Filter192()             PWMF_SetIC5Filter(14)
#define PWMF_IC5Filter256()             PWMF_SetIC5Filter(15)

#define HSPWMF_SetIC5Filter(n)          MODIFY_HSPWMF(PWMF_CCMR1,  PWMFCCMR1_IC5F_MSK, ((n) << 4))
#define HSPWMF_IC5Filter1()             HSPWMF_SetIC5Filter(0)
#define HSPWMF_IC5Filter2()             HSPWMF_SetIC5Filter(1)
#define HSPWMF_IC5Filter4()             HSPWMF_SetIC5Filter(2)
#define HSPWMF_IC5Filter8()             HSPWMF_SetIC5Filter(3)
#define HSPWMF_IC5Filter12()            HSPWMF_SetIC5Filter(4)
#define HSPWMF_IC5Filter16()            HSPWMF_SetIC5Filter(5)
#define HSPWMF_IC5Filter24()            HSPWMF_SetIC5Filter(6)
#define HSPWMF_IC5Filter32()            HSPWMF_SetIC5Filter(7)
#define HSPWMF_IC5Filter48()            HSPWMF_SetIC5Filter(8)
#define HSPWMF_IC5Filter64()            HSPWMF_SetIC5Filter(9)
#define HSPWMF_IC5Filter80()            HSPWMF_SetIC5Filter(10)
#define HSPWMF_IC5Filter96()            HSPWMF_SetIC5Filter(11)
#define HSPWMF_IC5Filter128()           HSPWMF_SetIC5Filter(12)
#define HSPWMF_IC5Filter160()           HSPWMF_SetIC5Filter(13)
#define HSPWMF_IC5Filter192()           HSPWMF_SetIC5Filter(14)
#define HSPWMF_IC5Filter256()           HSPWMF_SetIC5Filter(15)

#define PWMFCCMR1_IC5PS_MSK             (BIT3 | BIT2)
#define PWMF_SetIC5Divider(n)           MODIFY_REG(PWMF_CCMR1,  PWMFCCMR1_IC5PS_MSK, ((n) << 2))
#define PWMF_IC5Divider1()              PWMF_SetIC5Divider(0)
#define PWMF_IC5Divider2()              PWMF_SetIC5Divider(1)
#define PWMF_IC5Divider4()              PWMF_SetIC5Divider(2)
#define PWMF_IC5Divider8()              PWMF_SetIC5Divider(3)

#define HSPWMF_SetIC5Divider(n)         MODIFY_HSPWMF(PWMF_CCMR1,  PWMFCCMR1_IC5PS_MSK, ((n) << 2))
#define HSPWMF_IC5Divider1()            HSPWMF_SetIC5Divider(0)
#define HSPWMF_IC5Divider2()            HSPWMF_SetIC5Divider(1)
#define HSPWMF_IC5Divider4()            HSPWMF_SetIC5Divider(2)
#define HSPWMF_IC5Divider8()            HSPWMF_SetIC5Divider(3)

#define PWMFCCMR2_OC6CE_MSK             BIT7
#define PWMF_EnableETRFClearOC6REF()    SET_REG_BIT(PWMF_CCMR2, PWMFCCMR2_OC6CE_MSK)
#define PWMF_DisableETRFClearOC6REF()   CLR_REG_BIT(PWMF_CCMR2, PWMFCCMR2_OC6CE_MSK)

#define HSPWMF_EnableETRFClearOC6REF()  SET_HSPWMF_BIT(PWMF_CCMR2, PWMFCCMR2_OC6CE_MSK)
#define HSPWMF_DisableETRFClearOC6REF() CLR_HSPWMF_BIT(PWMF_CCMR2, PWMFCCMR2_OC6CE_MSK)

#define PWMFCCMR2_OC6M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMF_SetOC6OutputMode(n)        MODIFY_REG(PWMF_CCMR2,  PWMFCCMR2_OC6M_MSK, ((n) << 4))
#define PWMF_OC6REFFrozen()             PWMF_SetOC6OutputMode(0)
#define PWMF_OC6REFHighIfMatch()        PWMF_SetOC6OutputMode(1)
#define PWMF_OC6REFLowIfMatch()         PWMF_SetOC6OutputMode(2)
#define PWMF_OC6REFToggleIfMatch()      PWMF_SetOC6OutputMode(3)
#define PWMF_OC6REFForceLow()           PWMF_SetOC6OutputMode(4)
#define PWMF_OC6REFForceHigh()          PWMF_SetOC6OutputMode(5)
#define PWMF_OC6REFPWMMode1()           PWMF_SetOC6OutputMode(6)
#define PWMF_OC6REFPWMMode2()           PWMF_SetOC6OutputMode(7)

#define HSPWMF_SetOC6OutputMode(n)      MODIFY_HSPWMF(PWMF_CCMR2,  PWMFCCMR2_OC6M_MSK, ((n) << 4))
#define HSPWMF_OC6REFFrozen()           HSPWMF_SetOC6OutputMode(0)
#define HSPWMF_OC6REFHighIfMatch()      HSPWMF_SetOC6OutputMode(1)
#define HSPWMF_OC6REFLowIfMatch()       HSPWMF_SetOC6OutputMode(2)
#define HSPWMF_OC6REFToggleIfMatch()    HSPWMF_SetOC6OutputMode(3)
#define HSPWMF_OC6REFForceLow()         HSPWMF_SetOC6OutputMode(4)
#define HSPWMF_OC6REFForceHigh()        HSPWMF_SetOC6OutputMode(5)
#define HSPWMF_OC6REFPWMMode1()         HSPWMF_SetOC6OutputMode(6)
#define HSPWMF_OC6REFPWMMode2()         HSPWMF_SetOC6OutputMode(7)

