fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMFCCMR2_OC6PE_MSK             BIT3
#define PWMF_UnbufferCCR6()             CLR_REG_BIT(PWMF_CCMR2, PWMFCCMR2_OC6PE_MSK)
#define PWMF_BufferCCR6()               SET_REG_BIT(PWMF_CCMR2, PWMFCCMR2_OC6PE_MSK)

#define HSPWMF_UnbufferCCR6()           CLR_HSPWMF_BIT(PWMF_CCMR2, PWMFCCMR2_OC6PE_MSK)
#define HSPWMF_BufferCCR6()             SET_HSPWMF_BIT(PWMF_CCMR2, PWMFCCMR2_OC6PE_MSK)

#define PWMFCCMR2_OC6FE_MSK             BIT2
#define PWMF_DisableOC6FastMode()       CLR_REG_BIT(PWMF_CCMR2, PWMFCCMR2_OC6FE_MSK)
#define PWMF_EnableOC6FastMode()        SET_REG_BIT(PWMF_CCMR2, PWMFCCMR2_OC6FE_MSK)

#define HSPWMF_DisableOC6FastMode()     CLR_HSPWMF_BIT(PWMF_CCMR2, PWMFCCMR2_OC6FE_MSK)
#define HSPWMF_EnableOC6FastMode()      SET_HSPWMF_BIT(PWMF_CCMR2, PWMFCCMR2_OC6FE_MSK)

#define PWMFCCMR2_CC6S_MSK              (BIT1 | BIT0)
#define PWMF_SetCC6Mode(n)              MODIFY_REG(PWMF_CCMR2,  PWMFCCMR2_CC6S_MSK, ((n) << 0))
#define PWMF_CC6Output()                PWMF_SetCC6Mode(0)
#define PWMF_CC6CaptureTI6FP6()         PWMF_SetCC6Mode(1)
#define PWMF_CC6CaptureTI5FP6()         PWMF_SetCC6Mode(2)
#define PWMF_CC6CaptureTRC()            PWMF_SetCC6Mode(3)

#define HSPWMF_SetCC6Mode(n)            MODIFY_HSPWMF(PWMF_CCMR2,  PWMFCCMR2_CC6S_MSK, ((n) << 0))
#define HSPWMF_CC6Output()              HSPWMF_SetCC6Mode(0)
#define HSPWMF_CC6CaptureTI6FP6()       HSPWMF_SetCC6Mode(1)
#define HSPWMF_CC6CaptureTI5FP6()       HSPWMF_SetCC6Mode(2)
#define HSPWMF_CC6CaptureTRC()          HSPWMF_SetCC6Mode(3)

#define PWMFCCMR2_IC6F_MSK              (BIT_HN)
#define PWMF_SetIC6Filter(n)            MODIFY_REG(PWMF_CCMR2,  PWMFCCMR2_IC6F_MSK, ((n) << 4))
#define PWMF_IC6Filter1()               PWMF_SetIC6Filter(0)
#define PWMF_IC6Filter2()               PWMF_SetIC6Filter(1)
#define PWMF_IC6Filter4()               PWMF_SetIC6Filter(2)
#define PWMF_IC6Filter8()               PWMF_SetIC6Filter(3)
#define PWMF_IC6Filter12()              PWMF_SetIC6Filter(4)
#define PWMF_IC6Filter16()              PWMF_SetIC6Filter(5)
#define PWMF_IC6Filter24()              PWMF_SetIC6Filter(6)
#define PWMF_IC6Filter32()              PWMF_SetIC6Filter(7)
#define PWMF_IC6Filter48()              PWMF_SetIC6Filter(8)
#define PWMF_IC6Filter64()              PWMF_SetIC6Filter(9)
#define PWMF_IC6Filter80()              PWMF_SetIC6Filter(10)
#define PWMF_IC6Filter96()              PWMF_SetIC6Filter(11)
#define PWMF_IC6Filter128()             PWMF_SetIC6Filter(12)
#define PWMF_IC6Filter160()             PWMF_SetIC6Filter(13)
#define PWMF_IC6Filter192()             PWMF_SetIC6Filter(14)
#define PWMF_IC6Filter256()             PWMF_SetIC6Filter(15)

#define HSPWMF_SetIC6Filter(n)          MODIFY_HSPWMF(PWMF_CCMR2,  PWMFCCMR2_IC6F_MSK, ((n) << 4))
#define HSPWMF_IC6Filter1()             HSPWMF_SetIC6Filter(0)
#define HSPWMF_IC6Filter2()             HSPWMF_SetIC6Filter(1)
#define HSPWMF_IC6Filter4()             HSPWMF_SetIC6Filter(2)
#define HSPWMF_IC6Filter8()             HSPWMF_SetIC6Filter(3)
#define HSPWMF_IC6Filter12()            HSPWMF_SetIC6Filter(4)
#define HSPWMF_IC6Filter16()            HSPWMF_SetIC6Filter(5)
#define HSPWMF_IC6Filter24()            HSPWMF_SetIC6Filter(6)
#define HSPWMF_IC6Filter32()            HSPWMF_SetIC6Filter(7)
#define HSPWMF_IC6Filter48()            HSPWMF_SetIC6Filter(8)
#define HSPWMF_IC6Filter64()            HSPWMF_SetIC6Filter(9)
#define HSPWMF_IC6Filter80()            HSPWMF_SetIC6Filter(10)
#define HSPWMF_IC6Filter96()            HSPWMF_SetIC6Filter(11)
#define HSPWMF_IC6Filter128()           HSPWMF_SetIC6Filter(12)
#define HSPWMF_IC6Filter160()           HSPWMF_SetIC6Filter(13)
#define HSPWMF_IC6Filter192()           HSPWMF_SetIC6Filter(14)
#define HSPWMF_IC6Filter256()           HSPWMF_SetIC6Filter(15)

#define PWMFCCMR2_IC6PS_MSK             (BIT3 | BIT2)
#define PWMF_SetIC6Divider(n)           MODIFY_REG(PWMF_CCMR2,  PWMFCCMR2_IC6PS_MSK, ((n) << 2))
#define PWMF_IC6Divider1()              PWMF_SetIC6Divider(0)
#define PWMF_IC6Divider2()              PWMF_SetIC6Divider(1)
#define PWMF_IC6Divider4()              PWMF_SetIC6Divider(2)
#define PWMF_IC6Divider8()              PWMF_SetIC6Divider(3)

#define HSPWMF_SetIC6Divider(n)         MODIFY_HSPWMF(PWMF_CCMR2,  PWMFCCMR2_IC6PS_MSK, ((n) << 2))
#define HSPWMF_IC6Divider1()            HSPWMF_SetIC6Divider(0)
#define HSPWMF_IC6Divider2()            HSPWMF_SetIC6Divider(1)
#define HSPWMF_IC6Divider4()            HSPWMF_SetIC6Divider(2)
#define HSPWMF_IC6Divider8()            HSPWMF_SetIC6Divider(3)

#define PWMFCCMR3_OC7CE_MSK             BIT7
#define PWMF_EnableETRFClearOC7REF()    SET_REG_BIT(PWMF_CCMR3, PWMFCCMR3_OC7CE_MSK)
#define PWMF_DisableETRFClearOC7REF()   CLR_REG_BIT(PWMF_CCMR3, PWMFCCMR3_OC7CE_MSK)

#define HSPWMF_EnableETRFClearOC7REF()  SET_HSPWMF_BIT(PWMF_CCMR3, PWMFCCMR3_OC7CE_MSK)
#define HSPWMF_DisableETRFClearOC7REF() CLR_HSPWMF_BIT(PWMF_CCMR3, PWMFCCMR3_OC7CE_MSK)

#define PWMFCCMR3_OC7M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMF_SetOC7OutputMode(n)        MODIFY_REG(PWMF_CCMR3,  PWMFCCMR3_OC7M_MSK, ((n) << 4))
#define PWMF_OC7REFFrozen()             PWMF_SetOC7OutputMode(0)
#define PWMF_OC7REFHighIfMatch()        PWMF_SetOC7OutputMode(1)
#define PWMF_OC7REFLowIfMatch()         PWMF_SetOC7OutputMode(2)
#define PWMF_OC7REFToggleIfMatch()      PWMF_SetOC7OutputMode(3)
#define PWMF_OC7REFForceLow()           PWMF_SetOC7OutputMode(4)
#define PWMF_OC7REFForceHigh()          PWMF_SetOC7OutputMode(5)
#define PWMF_OC7REFPWMMode1()           PWMF_SetOC7OutputMode(6)
#define PWMF_OC7REFPWMMode2()           PWMF_SetOC7OutputMode(7)

#define HSPWMF_SetOC7OutputMode(n)      MODIFY_HSPWMF(PWMF_CCMR3,  PWMFCCMR3_OC7M_MSK, ((n) << 4))
#define HSPWMF_OC7REFFrozen()           HSPWMF_SetOC7OutputMode(0)
#define HSPWMF_OC7REFHighIfMatch()      HSPWMF_SetOC7OutputMode(1)
#define HSPWMF_OC7REFLowIfMatch()       HSPWMF_SetOC7OutputMode(2)
#define HSPWMF_OC7REFToggleIfMatch()    HSPWMF_SetOC7OutputMode(3)
#define HSPWMF_OC7REFForceLow()         HSPWMF_SetOC7OutputMode(4)
#define HSPWMF_OC7REFForceHigh()        HSPWMF_SetOC7OutputMode(5)
#define HSPWMF_OC7REFPWMMode1()         HSPWMF_SetOC7OutputMode(6)
#define HSPWMF_OC7REFPWMMode2()         HSPWMF_SetOC7OutputMode(7)

#define PWMFCCMR3_OC7PE_MSK             BIT3
#define PWMF_UnbufferCCR7()             CLR_REG_BIT(PWMF_CCMR3, PWMFCCMR3_OC7PE_MSK)
#define PWMF_BufferCCR7()               SET_REG_BIT(PWMF_CCMR3, PWMFCCMR3_OC7PE_MSK)

#define HSPWMF_UnbufferCCR7()           CLR_HSPWMF_BIT(PWMF_CCMR3, PWMFCCMR3_OC7PE_MSK)
#define HSPWMF_BufferCCR7()             SET_HSPWMF_BIT(PWMF_CCMR3, PWMFCCMR3_OC7PE_MSK)

#define PWMFCCMR3_OC7FE_MSK             BIT2
#define PWMF_DisableOC7FastMode()       CLR_REG_BIT(PWMF_CCMR3, PWMFCCMR3_OC7FE_MSK)
#define PWMF_EnableOC7FastMode()        SET_REG_BIT(PWMF_CCMR3, PWMFCCMR3_OC7FE_MSK)

#define HSPWMF_DisableOC7FastMode()     CLR_HSPWMF_BIT(PWMF_CCMR3, PWMFCCMR3_OC7FE_MSK)
#define HSPWMF_EnableOC7FastMode()      SET_HSPWMF_BIT(PWMF_CCMR3, PWMFCCMR3_OC7FE_MSK)

