fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define PWMFCCMR3_CC7S_MSK              (BIT1 | BIT0)
#define PWMF_SetCC7Mode(n)              MODIFY_REG(PWMF_CCMR3,  PWMFCCMR3_CC7S_MSK, ((n) << 0))
#define PWMF_CC7Output()                PWMF_SetCC7Mode(0)
#define PWMF_CC7CaptureTI7FP7()         PWMF_SetCC7Mode(1)
#define PWMF_CC7CaptureTI8FP7()         PWMF_SetCC7Mode(2)
#define PWMF_CC7CaptureTRC()            PWMF_SetCC7Mode(3)

#define HSPWMF_SetCC7Mode(n)            MODIFY_HSPWMF(PWMF_CCMR3,  PWMFCCMR3_CC7S_MSK, ((n) << 0))
#define HSPWMF_CC7Output()              HSPWMF_SetCC7Mode(0)
#define HSPWMF_CC7CaptureTI7FP7()       HSPWMF_SetCC7Mode(1)
#define HSPWMF_CC7CaptureTI8FP7()       HSPWMF_SetCC7Mode(2)
#define HSPWMF_CC7CaptureTRC()          HSPWMF_SetCC7Mode(3)

#define PWMFCCMR3_IC7F_MSK              (BIT_HN)
#define PWMF_SetIC7Filter(n)            MODIFY_REG(PWMF_CCMR3,  PWMFCCMR3_IC7F_MSK, ((n) << 4))
#define PWMF_IC7Filter1()               PWMF_SetIC7Filter(0)
#define PWMF_IC7Filter2()               PWMF_SetIC7Filter(1)
#define PWMF_IC7Filter4()               PWMF_SetIC7Filter(2)
#define PWMF_IC7Filter8()               PWMF_SetIC7Filter(3)
#define PWMF_IC7Filter12()              PWMF_SetIC7Filter(4)
#define PWMF_IC7Filter16()              PWMF_SetIC7Filter(5)
#define PWMF_IC7Filter24()              PWMF_SetIC7Filter(6)
#define PWMF_IC7Filter32()              PWMF_SetIC7Filter(7)
#define PWMF_IC7Filter48()              PWMF_SetIC7Filter(8)
#define PWMF_IC7Filter64()              PWMF_SetIC7Filter(9)
#define PWMF_IC7Filter80()              PWMF_SetIC7Filter(10)
#define PWMF_IC7Filter96()              PWMF_SetIC7Filter(11)
#define PWMF_IC7Filter128()             PWMF_SetIC7Filter(12)
#define PWMF_IC7Filter160()             PWMF_SetIC7Filter(13)
#define PWMF_IC7Filter192()             PWMF_SetIC7Filter(14)
#define PWMF_IC7Filter256()             PWMF_SetIC7Filter(15)

#define HSPWMF_SetIC7Filter(n)          MODIFY_HSPWMF(PWMF_CCMR3,  PWMFCCMR3_IC7F_MSK, ((n) << 4))
#define HSPWMF_IC7Filter1()             HSPWMF_SetIC7Filter(0)
#define HSPWMF_IC7Filter2()             HSPWMF_SetIC7Filter(1)
#define HSPWMF_IC7Filter4()             HSPWMF_SetIC7Filter(2)
#define HSPWMF_IC7Filter8()             HSPWMF_SetIC7Filter(3)
#define HSPWMF_IC7Filter12()            HSPWMF_SetIC7Filter(4)
#define HSPWMF_IC7Filter16()            HSPWMF_SetIC7Filter(5)
#define HSPWMF_IC7Filter24()            HSPWMF_SetIC7Filter(6)
#define HSPWMF_IC7Filter32()            HSPWMF_SetIC7Filter(7)
#define HSPWMF_IC7Filter48()            HSPWMF_SetIC7Filter(8)
#define HSPWMF_IC7Filter64()            HSPWMF_SetIC7Filter(9)
#define HSPWMF_IC7Filter80()            HSPWMF_SetIC7Filter(10)
#define HSPWMF_IC7Filter96()            HSPWMF_SetIC7Filter(11)
#define HSPWMF_IC7Filter128()           HSPWMF_SetIC7Filter(12)
#define HSPWMF_IC7Filter160()           HSPWMF_SetIC7Filter(13)
#define HSPWMF_IC7Filter192()           HSPWMF_SetIC7Filter(14)
#define HSPWMF_IC7Filter256()           HSPWMF_SetIC7Filter(15)

#define PWMFCCMR3_IC7PS_MSK             (BIT3 | BIT2)
#define PWMF_SetIC7Divider(n)           MODIFY_REG(PWMF_CCMR3,  PWMFCCMR3_IC7PS_MSK, ((n) << 2))
#define PWMF_IC7Divider1()              PWMF_SetIC7Divider(0)
#define PWMF_IC7Divider2()              PWMF_SetIC7Divider(1)
#define PWMF_IC7Divider4()              PWMF_SetIC7Divider(2)
#define PWMF_IC7Divider8()              PWMF_SetIC7Divider(3)

#define HSPWMF_SetIC7Divider(n)         MODIFY_HSPWMF(PWMF_CCMR3,  PWMFCCMR3_IC7PS_MSK, ((n) << 2))
#define HSPWMF_IC7Divider1()            HSPWMF_SetIC7Divider(0)
#define HSPWMF_IC7Divider2()            HSPWMF_SetIC7Divider(1)
#define HSPWMF_IC7Divider4()            HSPWMF_SetIC7Divider(2)
#define HSPWMF_IC7Divider8()            HSPWMF_SetIC7Divider(3)

#define PWMFCCMR4_OC8CE_MSK             BIT7
#define PWMF_EnableETRFClearOC8REF()    SET_REG_BIT(PWMF_CCMR4, PWMFCCMR4_OC8CE_MSK)
#define PWMF_DisableETRFClearOC8REF()   CLR_REG_BIT(PWMF_CCMR4, PWMFCCMR4_OC8CE_MSK)

#define HSPWMF_EnableETRFClearOC8REF()  SET_HSPWMF_BIT(PWMF_CCMR4, PWMFCCMR4_OC8CE_MSK)
#define HSPWMF_DisableETRFClearOC8REF() CLR_HSPWMF_BIT(PWMF_CCMR4, PWMFCCMR4_OC8CE_MSK)

#define PWMFCCMR4_OC8M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMF_SetOC8OutputMode(n)        MODIFY_REG(PWMF_CCMR4,  PWMFCCMR4_OC8M_MSK, ((n) << 4))
#define PWMF_OC8REFFrozen()             PWMF_SetOC8OutputMode(0)
#define PWMF_OC8REFHighIfMatch()        PWMF_SetOC8OutputMode(1)
#define PWMF_OC8REFLowIfMatch()         PWMF_SetOC8OutputMode(2)
#define PWMF_OC8REFToggleIfMatch()      PWMF_SetOC8OutputMode(3)
#define PWMF_OC8REFForceLow()           PWMF_SetOC8OutputMode(4)
#define PWMF_OC8REFForceHigh()          PWMF_SetOC8OutputMode(5)
#define PWMF_OC8REFPWMMode1()           PWMF_SetOC8OutputMode(6)
#define PWMF_OC8REFPWMMode2()           PWMF_SetOC8OutputMode(7)

#define HSPWMF_SetOC8OutputMode(n)      MODIFY_HSPWMF(PWMF_CCMR4,  PWMFCCMR4_OC8M_MSK, ((n) << 4))
#define HSPWMF_OC8REFFrozen()           HSPWMF_SetOC8OutputMode(0)
#define HSPWMF_OC8REFHighIfMatch()      HSPWMF_SetOC8OutputMode(1)
#define HSPWMF_OC8REFLowIfMatch()       HSPWMF_SetOC8OutputMode(2)
#define HSPWMF_OC8REFToggleIfMatch()    HSPWMF_SetOC8OutputMode(3)
#define HSPWMF_OC8REFForceLow()         HSPWMF_SetOC8OutputMode(4)
#define HSPWMF_OC8REFForceHigh()        HSPWMF_SetOC8OutputMode(5)
#define HSPWMF_OC8REFPWMMode1()         HSPWMF_SetOC8OutputMode(6)
#define HSPWMF_OC8REFPWMMode2()         HSPWMF_SetOC8OutputMode(7)

#define PWMFCCMR4_OC8PE_MSK             BIT3
#define PWMF_UnbufferCCR8()             CLR_REG_BIT(PWMF_CCMR4, PWMFCCMR4_OC8PE_MSK)
#define PWMF_BufferCCR8()               SET_REG_BIT(PWMF_CCMR4, PWMFCCMR4_OC8PE_MSK)

#define HSPWMF_UnbufferCCR8()           CLR_HSPWMF_BIT(PWMF_CCMR4, PWMFCCMR4_OC8PE_MSK)
#define HSPWMF_BufferCCR8()             SET_HSPWMF_BIT(PWMF_CCMR4, PWMFCCMR4_OC8PE_MSK)

#define PWMFCCMR4_OC8FE_MSK             BIT2
#define PWMF_DisableOC8FastMode()       CLR_REG_BIT(PWMF_CCMR4, PWMFCCMR4_OC8FE_MSK)
#define PWMF_EnableOC8FastMode()        SET_REG_BIT(PWMF_CCMR4, PWMFCCMR4_OC8FE_MSK)

#define HSPWMF_DisableOC8FastMode()     CLR_HSPWMF_BIT(PWMF_CCMR4, PWMFCCMR4_OC8FE_MSK)
#define HSPWMF_EnableOC8FastMode()      SET_HSPWMF_BIT(PWMF_CCMR4, PWMFCCMR4_OC8FE_MSK)

#define PWMFCCMR4_CC8S_MSK              (BIT1 | BIT0)
#define PWMF_SetCC8Mode(n)              MODIFY_REG(PWMF_CCMR4,  PWMFCCMR4_CC8S_MSK, ((n) << 0))
#define PWMF_CC8Output()                PWMF_SetCC8Mode(0)
#define PWMF_CC8CaptureTI8FP8()         PWMF_SetCC8Mode(1)
#define PWMF_CC8CaptureTI7FP8()         PWMF_SetCC8Mode(2)
#define PWMF_CC8CaptureTRC()            PWMF_SetCC8Mode(3)

#define HSPWMF_SetCC8Mode(n)            MODIFY_HSPWMF(PWMF_CCMR4,  PWMFCCMR4_CC8S_MSK, ((n) << 0))
#define HSPWMF_CC8Output()              HSPWMF_SetCC8Mode(0)
#define HSPWMF_CC8CaptureTI8FP8()       HSPWMF_SetCC8Mode(1)
#define HSPWMF_CC8CaptureTI7FP8()       HSPWMF_SetCC8Mode(2)
#define HSPWMF_CC8CaptureTRC()          HSPWMF_SetCC8Mode(3)

#define PWMFCCMR4_IC8F_MSK              (BIT_HN)
#define PWMF_SetIC8Filter(n)            MODIFY_REG(PWMF_CCMR4,  PWMFCCMR4_IC8F_MSK, ((n) << 4))
#define PWMF_IC8Filter1()               PWMF_SetIC8Filter(0)
#define PWMF_IC8Filter2()               PWMF_SetIC8Filter(1)
#define PWMF_IC8Filter4()               PWMF_SetIC8Filter(2)
#define PWMF_IC8Filter8()               PWMF_SetIC8Filter(3)
#define PWMF_IC8Filter12()              PWMF_SetIC8Filter(4)
#define PWMF_IC8Filter16()              PWMF_SetIC8Filter(5)
#define PWMF_IC8Filter24()              PWMF_SetIC8Filter(6)
#define PWMF_IC8Filter32()              PWMF_SetIC8Filter(7)
#define PWMF_IC8Filter48()              PWMF_SetIC8Filter(8)
#define PWMF_IC8Filter64()              PWMF_SetIC8Filter(9)
#define PWMF_IC8Filter80()              PWMF_SetIC8Filter(10)
#define PWMF_IC8Filter96()              PWMF_SetIC8Filter(11)
#define PWMF_IC8Filter128()             PWMF_SetIC8Filter(12)
#define PWMF_IC8Filter160()             PWMF_SetIC8Filter(13)
#define PWMF_IC8Filter192()             PWMF_SetIC8Filter(14)
#define PWMF_IC8Filter256()             PWMF_SetIC8Filter(15)

#define HSPWMF_SetIC8Filter(n)          MODIFY_HSPWMF(PWMF_CCMR4,  PWMFCCMR4_IC8F_MSK, ((n) << 4))
#define HSPWMF_IC8Filter1()             HSPWMF_SetIC8Filter(0)
#define HSPWMF_IC8Filter2()             HSPWMF_SetIC8Filter(1)
#define HSPWMF_IC8Filter4()             HSPWMF_SetIC8Filter(2)
#define HSPWMF_IC8Filter8()             HSPWMF_SetIC8Filter(3)
#define HSPWMF_IC8Filter12()            HSPWMF_SetIC8Filter(4)
#define HSPWMF_IC8Filter16()            HSPWMF_SetIC8Filter(5)
#define HSPWMF_IC8Filter24()            HSPWMF_SetIC8Filter(6)
#define HSPWMF_IC8Filter32()            HSPWMF_SetIC8Filter(7)
#define HSPWMF_IC8Filter48()            HSPWMF_SetIC8Filter(8)
#define HSPWMF_IC8Filter64()            HSPWMF_SetIC8Filter(9)
#define HSPWMF_IC8Filter80()            HSPWMF_SetIC8Filter(10)
#define HSPWMF_IC8Filter96()            HSPWMF_SetIC8Filter(11)
#define HSPWMF_IC8Filter128()           HSPWMF_SetIC8Filter(12)
#define HSPWMF_IC8Filter160()           HSPWMF_SetIC8Filter(13)
#define HSPWMF_IC8Filter192()           HSPWMF_SetIC8Filter(14)
#define HSPWMF_IC8Filter256()           HSPWMF_SetIC8Filter(15)

#define PWMFCCMR4_IC8PS_MSK             (BIT3 | BIT2)
#define PWMF_SetIC8Divider(n)           MODIFY_REG(PWMF_CCMR4,  PWMFCCMR4_IC8PS_MSK, ((n) << 2))
#define PWMF_IC8Divider1()              PWMF_SetIC8Divider(0)
#define PWMF_IC8Divider2()              PWMF_SetIC8Divider(1)
#define PWMF_IC8Divider4()              PWMF_SetIC8Divider(2)
#define PWMF_IC8Divider8()              PWMF_SetIC8Divider(3)

#define HSPWMF_SetIC8Divider(n)         MODIFY_HSPWMF(PWMF_CCMR4,  PWMFCCMR4_IC8PS_MSK, ((n) << 2))
#define HSPWMF_IC8Divider1()            HSPWMF_SetIC8Divider(0)
#define HSPWMF_IC8Divider2()            HSPWMF_SetIC8Divider(1)
#define HSPWMF_IC8Divider4()            HSPWMF_SetIC8Divider(2)
#define HSPWMF_IC8Divider8()            HSPWMF_SetIC8Divider(3)

#define PWMFCCER1_CC5E_MSK              BIT0
#define PWMF_CC5PEnable()               SET_REG_BIT(PWMF_CCER1, PWMFCCER1_CC5E_MSK)
#define PWMF_CC5PDisable()              CLR_REG_BIT(PWMF_CCER1, PWMFCCER1_CC5E_MSK)

#define HSPWMF_CC5PEnable()             SET_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC5E_MSK)
#define HSPWMF_CC5PDisable()            CLR_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC5E_MSK)

#define PWMFCCER1_CC5P_MSK              BIT1
#define PWMF_CC5PNonInverted()          CLR_REG_BIT(PWMF_CCER1, PWMFCCER1_CC5P_MSK)
#define PWMF_CC5PInverted()             SET_REG_BIT(PWMF_CCER1, PWMFCCER1_CC5P_MSK)

