fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMF_CC5PNonInverted()        CLR_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC5P_MSK)
#define HSPWMF_CC5PInverted()           SET_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC5P_MSK)

#define PWMFCCER1_CC6E_MSK              BIT4
#define PWMF_CC6PEnable()               SET_REG_BIT(PWMF_CCER1, PWMFCCER1_CC6E_MSK)
#define PWMF_CC6PDisable()              CLR_REG_BIT(PWMF_CCER1, PWMFCCER1_CC6E_MSK)

#define HSPWMF_CC6PEnable()             SET_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC6E_MSK)
#define HSPWMF_CC6PDisable()            CLR_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC6E_MSK)

#define PWMFCCER1_CC6P_MSK              BIT5
#define PWMF_CC6PNonInverted()          CLR_REG_BIT(PWMF_CCER1, PWMFCCER1_CC6P_MSK)
#define PWMF_CC6PInverted()             SET_REG_BIT(PWMF_CCER1, PWMFCCER1_CC6P_MSK)

#define HSPWMF_CC6PNonInverted()        CLR_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC6P_MSK)
#define HSPWMF_CC6PInverted()           SET_HSPWMF_BIT(PWMF_CCER1, PWMFCCER1_CC6P_MSK)

#define PWMFCCER2_CC7E_MSK              BIT0
#define PWMF_CC7PEnable()               SET_REG_BIT(PWMF_CCER2, PWMFCCER2_CC7E_MSK)
#define PWMF_CC7PDisable()              CLR_REG_BIT(PWMF_CCER2, PWMFCCER2_CC7E_MSK)

#define HSPWMF_CC7PEnable()             SET_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC7E_MSK)
#define HSPWMF_CC7PDisable()            CLR_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC7E_MSK)

#define PWMFCCER2_CC7P_MSK              BIT1
#define PWMF_CC7PNonInverted()          CLR_REG_BIT(PWMF_CCER2, PWMFCCER2_CC7P_MSK)
#define PWMF_CC7PInverted()             SET_REG_BIT(PWMF_CCER2, PWMFCCER2_CC7P_MSK)

#define HSPWMF_CC7PNonInverted()        CLR_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC7P_MSK)
#define HSPWMF_CC7PInverted()           SET_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC7P_MSK)

#define PWMFCCER2_CC8E_MSK              BIT4
#define PWMF_CC8PEnable()               SET_REG_BIT(PWMF_CCER2, PWMFCCER2_CC8E_MSK)
#define PWMF_CC8PDisable()              CLR_REG_BIT(PWMF_CCER2, PWMFCCER2_CC8E_MSK)

#define HSPWMF_CC8PEnable()             SET_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC8E_MSK)
#define HSPWMF_CC8PDisable()            CLR_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC8E_MSK)

#define PWMFCCER2_CC8P_MSK              BIT5
#define PWMF_CC8PNonInverted()          CLR_REG_BIT(PWMF_CCER2, PWMFCCER2_CC8P_MSK)
#define PWMF_CC8PInverted()             SET_REG_BIT(PWMF_CCER2, PWMFCCER2_CC8P_MSK)

#define HSPWMF_CC8PNonInverted()        CLR_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC8P_MSK)
#define HSPWMF_CC8PInverted()           SET_HSPWMF_BIT(PWMF_CCER2, PWMFCCER2_CC8P_MSK)

#define PWMFBRK_MOE_MSK                 BIT7
#define PWMF_EnableMainOutput()         SET_REG_BIT(PWMF_BKR, PWMFBRK_MOE_MSK)
#define PWMF_DisableMainOutput()        CLR_REG_BIT(PWMF_BKR, PWMFBRK_MOE_MSK)

#define HSPWMF_EnableMainOutput()       SET_HSPWMF_BIT(PWMF_BKR, PWMFBRK_MOE_MSK)
#define HSPWMF_DisableMainOutput()      CLR_HSPWMF_BIT(PWMF_BKR, PWMFBRK_MOE_MSK)

#define PWMFBRK_AOE_MSK                 BIT6
#define PWMF_EnableAutoOutput()         SET_REG_BIT(PWMF_BKR, PWMFBRK_AOE_MSK)
#define PWMF_DisableAutoOutput()        CLR_REG_BIT(PWMF_BKR, PWMFBRK_AOE_MSK)

#define HSPWMF_EnableAutoOutput()       SET_HSPWMF_BIT(PWMF_BKR, PWMFBRK_AOE_MSK)
#define HSPWMF_DisableAutoOutput()      CLR_HSPWMF_BIT(PWMF_BKR, PWMFBRK_AOE_MSK)

#define PWMFBRK_BKP_MSK                 BIT5
#define PWMF_BRKNonInverted()           SET_REG_BIT(PWMF_BKR, PWMFBRK_BKP_MSK)
#define PWMF_BRKInverted()              CLR_REG_BIT(PWMF_BKR, PWMFBRK_BKP_MSK)

#define HSPWMF_BRKNonInverted()         SET_HSPWMF_BIT(PWMF_BKR, PWMFBRK_BKP_MSK)
#define HSPWMF_BRKInverted()            CLR_HSPWMF_BIT(PWMF_BKR, PWMFBRK_BKP_MSK)

#define PWMFBRK_BKE_MSK                 BIT4
#define PWMF_BRKEnable()                SET_REG_BIT(PWMF_BKR, PWMFBRK_BKE_MSK)
#define PWMF_BRKDisable()               CLR_REG_BIT(PWMF_BKR, PWMFBRK_BKE_MSK)

#define HSPWMF_BRKEnable()              SET_HSPWMF_BIT(PWMF_BKR, PWMFBRK_BKE_MSK)
#define HSPWMF_BRKDisable()             CLR_HSPWMF_BIT(PWMF_BKR, PWMFBRK_BKE_MSK)

#define PWMFBRK_OSSR_MSK                BIT3
#define PWMFBRK_OSSI_MSK                BIT2
#define PWMF_RunInactiveNoOutput()      CLR_REG_BIT(PWMF_BKR, PWMFBRK_OSSR_MSK)
#define PWMF_RunInactiveOutput()        SET_REG_BIT(PWMF_BKR, PWMFBRK_OSSR_MSK)
#define PWMF_IdleInactiveNoOutput()     CLR_REG_BIT(PWMF_BKR, PWMFBRK_OSSI_MSK)
#define PWMF_IdleInactiveOutput()       SET_REG_BIT(PWMF_BKR, PWMFBRK_OSSI_MSK)

#define HSPWMF_RunInactiveNoOutput()    CLR_HSPWMF_BIT(PWMF_BKR, PWMFBRK_OSSR_MSK)
#define HSPWMF_RunInactiveOutput()      SET_HSPWMF_BIT(PWMF_BKR, PWMFBRK_OSSR_MSK)
#define HSPWMF_IdleInactiveNoOutput()   CLR_HSPWMF_BIT(PWMF_BKR, PWMFBRK_OSSI_MSK)
#define HSPWMF_IdleInactiveOutput()     SET_HSPWMF_BIT(PWMF_BKR, PWMFBRK_OSSI_MSK)

#define PWMFBRK_LOCK_MSK                (BIT1 | BIT0)
#define PWMF_SetLockLevel(n)            MODIFY_REG(PWMF_BKR,  PWMFBRK_LOCK_MSK, ((n) << 0))
#define PWMF_SetUnLock()                PWMF_SetLockLevel(0)

#define HSPWMF_SetLockLevel(n)          MODIFY_HSPWMF(PWMF_BKR,  PWMFBRK_LOCK_MSK, ((n) << 0))
#define HSPWMF_SetUnLock()              HSPWMF_SetLockLevel(0)

#define PWMFOISR_OIS5_MSK               BIT0
#define PWMFOISR_OIS6_MSK               BIT2
#define PWMFOISR_OIS7_MSK               BIT4
#define PWMFOISR_OIS8_MSK               BIT6
#define PWMF_OC5PIdleLevelLow()         CLR_REG_BIT(PWMF_OISR, PWMFOISR_OIS5_MSK)
#define PWMF_OC5PIdleLevelHigh()        SET_REG_BIT(PWMF_OISR, PWMFOISR_OIS5_MSK)
#define PWMF_OC6PIdleLevelLow()         CLR_REG_BIT(PWMF_OISR, PWMFOISR_OIS6_MSK)
#define PWMF_OC6PIdleLevelHigh()        SET_REG_BIT(PWMF_OISR, PWMFOISR_OIS6_MSK)
#define PWMF_OC7PIdleLevelLow()         CLR_REG_BIT(PWMF_OISR, PWMFOISR_OIS7_MSK)
#define PWMF_OC7PIdleLevelHigh()        SET_REG_BIT(PWMF_OISR, PWMFOISR_OIS7_MSK)
#define PWMF_OC8PIdleLevelLow()         CLR_REG_BIT(PWMF_OISR, PWMFOISR_OIS8_MSK)
#define PWMF_OC8PIdleLevelHigh()        SET_REG_BIT(PWMF_OISR, PWMFOISR_OIS8_MSK)

#define HSPWMF_OC5PIdleLevelLow()       CLR_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS5_MSK)
#define HSPWMF_OC5PIdleLevelHigh()      SET_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS5_MSK)
#define HSPWMF_OC6PIdleLevelLow()       CLR_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS6_MSK)
#define HSPWMF_OC6PIdleLevelHigh()      SET_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS6_MSK)
#define HSPWMF_OC7PIdleLevelLow()       CLR_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS7_MSK)
#define HSPWMF_OC7PIdleLevelHigh()      SET_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS7_MSK)
#define HSPWMF_OC8PIdleLevelLow()       CLR_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS8_MSK)
#define HSPWMF_OC8PIdleLevelHigh()      SET_HSPWMF_BIT(PWMF_OISR, PWMFOISR_OIS8_MSK)

#define PWMF_SetCounter(n)              (PWMF_CNTRH = HIBYTE(n), PWMF_CNTRL = LOBYTE(n))
#define PWMF_SetClockDivider(n)         (PWMF_PSCRH = HIBYTE(n), PWMF_PSCRL = LOBYTE(n))
#define PWMF_SetReload16(n)             (PWMF_ARRH = HIBYTE(n), PWMF_ARRL = LOBYTE(n))
#define PWMF_SetRepeatCounter(n)        (PWMF_RCRH = HIBYTE(n), PWMF_RCR = LOBYTE(n))

#define HSPWMF_SetCounter(n)            (WRITE_HSPWMF(PWMF_CNTRH, HIBYTE(n)), WRITE_HSPWMF(PWMF_CNTRL, LOBYTE(n)))
#define HSPWMF_SetClockDivider(n)       (WRITE_HSPWMF(PWMF_PSCRH, HIBYTE(n)), WRITE_HSPWMF(PWMF_PSCRL, LOBYTE(n)))
#define HSPWMF_SetReload16(n)           (WRITE_HSPWMF(PWMF_ARRH, HIBYTE(n)), WRITE_HSPWMF(PWMF_ARRL, LOBYTE(n)))
#define HSPWMF_SetRepeatCounter(n)      (WRITE_HSPWMF(PWMF_RCRH, HIBYTE(n)), WRITE_HSPWMF(PWMF_RCR, LOBYTE(n)))

#define PWMF_SetCCR5Value(n)            (PWMF_CCR5H = HIBYTE(n), PWMF_CCR5L = LOBYTE(n))
#define PWMF_SetCCR6Value(n)            (PWMF_CCR6H = HIBYTE(n), PWMF_CCR6L = LOBYTE(n))
#define PWMF_SetCCR7Value(n)            (PWMF_CCR7H = HIBYTE(n), PWMF_CCR7L = LOBYTE(n))
#define PWMF_SetCCR8Value(n)            (PWMF_CCR8H = HIBYTE(n), PWMF_CCR8L = LOBYTE(n))

