fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMF_SetCCR5Value(n)          (WRITE_HSPWMF(PWMF_CCR5H, HIBYTE(n)), WRITE_HSPWMF(PWMF_CCR5L, LOBYTE(n)))
#define HSPWMF_SetCCR6Value(n)          (WRITE_HSPWMF(PWMF_CCR6H, HIBYTE(n)), WRITE_HSPWMF(PWMF_CCR6L, LOBYTE(n)))
#define HSPWMF_SetCCR7Value(n)          (WRITE_HSPWMF(PWMF_CCR7H, HIBYTE(n)), WRITE_HSPWMF(PWMF_CCR7L, LOBYTE(n)))
#define HSPWMF_SetCCR8Value(n)          (WRITE_HSPWMF(PWMF_CCR8H, HIBYTE(n)), WRITE_HSPWMF(PWMF_CCR8L, LOBYTE(n)))

#define PWMF_ReadReload16()             MAKEWORD(PWMF_ARRL, PWMF_ARRH)

#define HSPWMF_ReadReload16()           MAKEWORD(READ_HSPWMF(PWMF_ARRL), READ_HSPWMF(PWMF_ARRH))

#define PWMF_ReadCCR5Value()            MAKEWORD(PWMF_CCR5L, PWMF_CCR5H)
#define PWMF_ReadCCR6Value()            MAKEWORD(PWMF_CCR6L, PWMF_CCR6H)
#define PWMF_ReadCCR7Value()            MAKEWORD(PWMF_CCR7L, PWMF_CCR7H)
#define PWMF_ReadCCR8Value()            MAKEWORD(PWMF_CCR8L, PWMF_CCR8H)

#define HSPWMF_ReadCCR5Value()          MAKEWORD(READ_HSPWMF(PWMF_CCR5L), READ_HSPWMF(PWMF_CCR5H))
#define HSPWMF_ReadCCR6Value()          MAKEWORD(READ_HSPWMF(PWMF_CCR6L), READ_HSPWMF(PWMF_CCR6H))
#define HSPWMF_ReadCCR7Value()          MAKEWORD(READ_HSPWMF(PWMF_CCR7L), READ_HSPWMF(PWMF_CCR7H))
#define HSPWMF_ReadCCR8Value()          MAKEWORD(READ_HSPWMF(PWMF_CCR8L), READ_HSPWMF(PWMF_CCR8H))

#define PWMF_SetDeadTime(n)             PWMF_DTR = LOBYTE(n)

#define HSPWMF_SetDeadTime(n)           WRITE_HSPWMF(PWMF_DTR, LOBYTE(n))

/////////////////////////////////////////////////

#define READ_HSPWMA(r)                  HSPWMA_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWMA(r, d)              HSPWMA_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWMA(r, clr, set)      WRITE_HSPWMA((r), ((READ_HSPWMA(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWMA_BIT(r, b)           (READ_HSPWMA(r) & (b))
#define CLR_HSPWMA_BIT(r, b)            WRITE_HSPWMA((r), (READ_HSPWMA(r) & ~(b)))
#define SET_HSPWMA_BIT(r, b)            WRITE_HSPWMA((r), (READ_HSPWMA(r) | (b)))

#define READ_HSPWMB(r)                  HSPWMB_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWMB(r, d)              HSPWMB_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWMB(r, clr, set)      WRITE_HSPWMB((r), ((READ_HSPWMB(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWMB_BIT(r, b)           (READ_HSPWMB(r) & (b))
#define CLR_HSPWMB_BIT(r, b)            WRITE_HSPWMB((r), (READ_HSPWMB(r) & ~(b)))
#define SET_HSPWMB_BIT(r, b)            WRITE_HSPWMB((r), (READ_HSPWMB(r) | (b)))

#define READ_HSPWMC(r)                  HSPWMC_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWMC(r, d)              HSPWMC_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWMC(r, clr, set)      WRITE_HSPWMC((r), ((READ_HSPWMC(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWMC_BIT(r, b)           (READ_HSPWMC(r) & (b))
#define CLR_HSPWMC_BIT(r, b)            WRITE_HSPWMC((r), (READ_HSPWMC(r) & ~(b)))
#define SET_HSPWMC_BIT(r, b)            WRITE_HSPWMC((r), (READ_HSPWMC(r) | (b)))

#define READ_HSPWMD(r)                  HSPWMD_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWMD(r, d)              HSPWMD_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWMD(r, clr, set)      WRITE_HSPWMD((r), ((READ_HSPWMD(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWMD_BIT(r, b)           (READ_HSPWMD(r) & (b))
#define CLR_HSPWMD_BIT(r, b)            WRITE_HSPWMD((r), (READ_HSPWMD(r) & ~(b)))
#define SET_HSPWMD_BIT(r, b)            WRITE_HSPWMD((r), (READ_HSPWMD(r) | (b)))

#define READ_HSPWME(r)                  HSPWME_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWME(r, d)              HSPWME_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWME(r, clr, set)      WRITE_HSPWME((r), ((READ_HSPWME(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWME_BIT(r, b)           (READ_HSPWME(r) & (b))
#define CLR_HSPWME_BIT(r, b)            WRITE_HSPWME((r), (READ_HSPWME(r) & ~(b)))
#define SET_HSPWME_BIT(r, b)            WRITE_HSPWME((r), (READ_HSPWME(r) | (b)))

#define READ_HSPWMF(r)                  HSPWMF_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWMF(r, d)              HSPWMF_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWMF(r, clr, set)      WRITE_HSPWMF((r), ((READ_HSPWMF(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWMF_BIT(r, b)           (READ_HSPWMF(r) & (b))
#define CLR_HSPWMF_BIT(r, b)            WRITE_HSPWMF((r), (READ_HSPWMF(r) & ~(b)))
#define SET_HSPWMF_BIT(r, b)            WRITE_HSPWMF((r), (READ_HSPWMF(r) | (b)))

////////////////////////

#define HSPWMACFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWMA_Enable()                 MODIFY_REG(HSPWMA_CFG, HSPWMACFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWMA_Disable()                MODIFY_REG(HSPWMA_CFG, HSPWMACFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMACFG_INTEN_MSK             BIT2
#define HSPWMA_EnableInt()              SET_REG_BIT(HSPWMA_CFG, HSPWMACFG_INTEN_MSK)
#define HSPWMA_DisableInt()             CLR_REG_BIT(HSPWMA_CFG, HSPWMACFG_INTEN_MSK)

#define HSPWMACFG_EXTN_MSK              BIT3
#define HSPWMA_SelectBankFE80H()        CLR_REG_BIT(HSPWMA_CFG, HSPWMACFG_EXTN_MSK)
#define HSPWMA_SelectBankF900H()        SET_REG_BIT(HSPWMA_CFG, HSPWMACFG_EXTN_MSK)

#define HSPWMAADR_BUSY_MSK              BIT7
#define HSPWMA_CheckBusy()              READ_REG_BIT(HSPWMA_ADR, HSPWMAADR_BUSY_MSK)

#define HSPWMAADR_READ_MSK              BIT7
#define HSPWMA_AsyncRead(r, d)          HSPWMA_ADR = ((r) | HSPWMAADR_READ_MSK);    \
                                        while (HSPWMA_CheckBusy());                 \
                                        (d) = HSPWMA_DAT

#define HSPWMA_AsyncWrite(r, d)         HSPWMA_DAT = (d);                           \
                                        HSPWMA_ADR = ((r) & ~HSPWMAADR_READ_MSK)

////////////////////////

#define HSPWMBCFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWMB_Enable()                 MODIFY_REG(HSPWMB_CFG, HSPWMBCFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWMB_Disable()                MODIFY_REG(HSPWMB_CFG, HSPWMBCFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMBCFG_INTEN_MSK             BIT2
#define HSPWMB_EnableInt()              SET_REG_BIT(HSPWMB_CFG, HSPWMBCFG_INTEN_MSK)
#define HSPWMB_DisableInt()             CLR_REG_BIT(HSPWMB_CFG, HSPWMBCFG_INTEN_MSK)

#define HSPWMBCFG_EXTN_MSK              BIT3
#define HSPWMB_SelectBankFE80H()        CLR_REG_BIT(HSPWMB_CFG, HSPWMBCFG_EXTN_MSK)
#define HSPWMB_SelectBankF900H()        SET_REG_BIT(HSPWMB_CFG, HSPWMBCFG_EXTN_MSK)

