fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define HSPWMBADR_BUSY_MSK              BIT7
#define HSPWMB_CheckBusy()              READ_REG_BIT(HSPWMB_ADR, HSPWMBADR_BUSY_MSK)

#define HSPWMBADR_READ_MSK              BIT7
#define HSPWMB_AsyncRead(r, d)          HSPWMB_ADR = ((r) | HSPWMBADR_READ_MSK);    \
                                        while (HSPWMB_CheckBusy());                 \
                                        (d) = HSPWMB_DAT

#define HSPWMB_AsyncWrite(r, d)         HSPWMB_DAT = (d);                           \
                                        HSPWMB_ADR = ((r) & ~HSPWMBADR_READ_MSK)

////////////////////////

#define HSPWMCCFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWMC_Enable()                 MODIFY_REG(HSPWMC_CFG, HSPWMCCFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWMC_Disable()                MODIFY_REG(HSPWMC_CFG, HSPWMCCFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMCCFG_INTEN_MSK             BIT2
#define HSPWMC_EnableInt()              SET_REG_BIT(HSPWMC_CFG, HSPWMCCFG_INTEN_MSK)
#define HSPWMC_DisableInt()             CLR_REG_BIT(HSPWMC_CFG, HSPWMCCFG_INTEN_MSK)

#define HSPWMCCFG_EXTN_MSK              BIT3
#define HSPWMC_SelectBankFE80H()        CLR_REG_BIT(HSPWMC_CFG, HSPWMCCFG_EXTN_MSK)
#define HSPWMC_SelectBankF900H()        SET_REG_BIT(HSPWMC_CFG, HSPWMCCFG_EXTN_MSK)

#define HSPWMCADR_BUSY_MSK              BIT7
#define HSPWMC_CheckBusy()              READ_REG_BIT(HSPWMC_ADR, HSPWMCADR_BUSY_MSK)

#define HSPWMCADR_READ_MSK              BIT7
#define HSPWMC_AsyncRead(r, d)          HSPWMC_ADR = ((r) | HSPWMCADR_READ_MSK);    \
                                        while (HSPWMC_CheckBusy());                 \
                                        (d) = HSPWMC_DAT

#define HSPWMC_AsyncWrite(r, d)         HSPWMC_DAT = (d);                           \
                                        HSPWMC_ADR = ((r) & ~HSPWMCADR_READ_MSK)

////////////////////////

#define HSPWMDCFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWMD_Enable()                 MODIFY_REG(HSPWMD_CFG, HSPWMDCFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWMD_Disable()                MODIFY_REG(HSPWMD_CFG, HSPWMDCFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMDCFG_INTEN_MSK             BIT2
#define HSPWMD_EnableInt()              SET_REG_BIT(HSPWMD_CFG, HSPWMDCFG_INTEN_MSK)
#define HSPWMD_DisableInt()             CLR_REG_BIT(HSPWMD_CFG, HSPWMDCFG_INTEN_MSK)

#define HSPWMDCFG_EXTN_MSK              BIT3
#define HSPWMD_SelectBankFE80H()        CLR_REG_BIT(HSPWMD_CFG, HSPWMDCFG_EXTN_MSK)
#define HSPWMD_SelectBankF900H()        SET_REG_BIT(HSPWMD_CFG, HSPWMDCFG_EXTN_MSK)

#define HSPWMDADR_BUSY_MSK              BIT7
#define HSPWMD_CheckBusy()              READ_REG_BIT(HSPWMD_ADR, HSPWMDADR_BUSY_MSK)

#define HSPWMDADR_READ_MSK              BIT7
#define HSPWMD_AsyncRead(r, d)          HSPWMD_ADR = ((r) | HSPWMDADR_READ_MSK);    \
                                        while (HSPWMD_CheckBusy());                 \
                                        (d) = HSPWMD_DAT

#define HSPWMD_AsyncWrite(r, d)         HSPWMD_DAT = (d);                           \
                                        HSPWMD_ADR = ((r) & ~HSPWMDADR_READ_MSK)

////////////////////////

#define HSPWMECFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWME_Enable()                 MODIFY_REG(HSPWME_CFG, HSPWMECFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWME_Disable()                MODIFY_REG(HSPWME_CFG, HSPWMECFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMECFG_INTEN_MSK             BIT2
#define HSPWME_EnableInt()              SET_REG_BIT(HSPWME_CFG, HSPWMECFG_INTEN_MSK)
#define HSPWME_DisableInt()             CLR_REG_BIT(HSPWME_CFG, HSPWMECFG_INTEN_MSK)

#define HSPWMECFG_EXTN_MSK              BIT3
#define HSPWME_SelectBankFE80H()        CLR_REG_BIT(HSPWME_CFG, HSPWMECFG_EXTN_MSK)
#define HSPWME_SelectBankF900H()        SET_REG_BIT(HSPWME_CFG, HSPWMECFG_EXTN_MSK)

#define HSPWMEADR_BUSY_MSK              BIT7
#define HSPWME_CheckBusy()              READ_REG_BIT(HSPWME_ADR, HSPWMEADR_BUSY_MSK)

#define HSPWMEADR_READ_MSK              BIT7
#define HSPWME_AsyncRead(r, d)          HSPWME_ADR = ((r) | HSPWMEADR_READ_MSK);    \
                                        while (HSPWME_CheckBusy());                 \
                                        (d) = HSPWME_DAT

#define HSPWME_AsyncWrite(r, d)         HSPWME_DAT = (d);                           \
                                        HSPWME_ADR = ((r) & ~HSPWMEADR_READ_MSK)

////////////////////////

#define HSPWMFCFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWMF_Enable()                 MODIFY_REG(HSPWMF_CFG, HSPWMFCFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWMF_Disable()                MODIFY_REG(HSPWMF_CFG, HSPWMFCFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMFCFG_INTEN_MSK             BIT2
#define HSPWMF_EnableInt()              SET_REG_BIT(HSPWMF_CFG, HSPWMFCFG_INTEN_MSK)
#define HSPWMF_DisableInt()             CLR_REG_BIT(HSPWMF_CFG, HSPWMFCFG_INTEN_MSK)

#define HSPWMFCFG_EXTN_MSK              BIT3
#define HSPWMF_SelectBankFE80H()        CLR_REG_BIT(HSPWMF_CFG, HSPWMFCFG_EXTN_MSK)
#define HSPWMF_SelectBankF900H()        SET_REG_BIT(HSPWMF_CFG, HSPWMFCFG_EXTN_MSK)

#define HSPWMFADR_BUSY_MSK              BIT7
#define HSPWMF_CheckBusy()              READ_REG_BIT(HSPWMF_ADR, HSPWMFADR_BUSY_MSK)

#define HSPWMFADR_READ_MSK              BIT7
#define HSPWMF_AsyncRead(r, d)          HSPWMF_ADR = ((r) | HSPWMFADR_READ_MSK);    \
                                        while (HSPWMF_CheckBusy());                 \
                                        (d) = HSPWMF_DAT

#define HSPWMF_AsyncWrite(r, d)         HSPWMF_DAT = (d);                           \
                                        HSPWMF_ADR = ((r) & ~HSPWMFADR_READ_MSK)

/////////////////////////////////////////////////


#define P2PDMA_SetSource(p, n)          DMA_P2P##p##_SRC = (n)
#define P2PDMA_SetDestination(p, n)     DMA_P2P##p##_DEST = (n)

#define DMA_P2PA_SetUART1Receive()      P2PDMA_SetSource(1, P2P_SRC_UR1RX )
#define DMA_P2PA_SetUART2Receive()      P2PDMA_SetSource(1, P2P_SRC_UR2RX )
#define DMA_P2PA_SetUART3Receive()      P2PDMA_SetSource(1, P2P_SRC_UR3RX )
#define DMA_P2PA_SetUART4Receive()      P2PDMA_SetSource(1, P2P_SRC_UR4RX )
#define DMA_P2PA_SetSPI1Receive()       P2PDMA_SetSource(1, P2P_SRC_SPI1RX)
#define DMA_P2PA_SetI2C1Receive()       P2PDMA_SetSource(1, P2P_SRC_I2C1RX)
#define DMA_P2PA_SetLCMReceive()        P2PDMA_SetSource(1, P2P_SRC_LCMRX )
#define DMA_P2PA_SetQSPIReceive()       P2PDMA_SetSource(1, P2P_SRC_QSPIRX)
#define DMA_P2PA_SetADC1Receive()       P2PDMA_SetSource(1, P2P_SRC_ADC1  )
#define DMA_P2PA_SetI2S1Receive()       P2PDMA_SetSource(1, P2P_SRC_I2S1RX)
#define DMA_P2PA_SetUART5Receive()      P2PDMA_SetSource(1, P2P_SRC_UR5RX )
#define DMA_P2PA_SetUART6Receive()      P2PDMA_SetSource(1, P2P_SRC_UR6RX )
#define DMA_P2PA_SetUART7Receive()      P2PDMA_SetSource(1, P2P_SRC_UR7RX )
#define DMA_P2PA_SetUART8Receive()      P2PDMA_SetSource(1, P2P_SRC_UR8RX )
#define DMA_P2PA_SetSPI2Receive()       P2PDMA_SetSource(1, P2P_SRC_SPI2RX)
#define DMA_P2PA_SetSPI3Receive()       P2PDMA_SetSource(1, P2P_SRC_SPI3RX)
#define DMA_P2PA_SetSPI4Receive()       P2PDMA_SetSource(1, P2P_SRC_SPI4RX)
#define DMA_P2PA_SetI2C2Receive()       P2PDMA_SetSource(1, P2P_SRC_I2C2RX)
#define DMA_P2PA_SetI2S2Receive()       P2PDMA_SetSource(1, P2P_SRC_I2S2RX)
#define DMA_P2PA_SetCAN1Receive()       P2PDMA_SetSource(1, P2P_SRC_CAN1RX)
#define DMA_P2PA_SetCAN2Receive()       P2PDMA_SetSource(1, P2P_SRC_CAN2RX)
#define DMA_P2PA_SetADC2Receive()       P2PDMA_SetSource(1, P2P_SRC_ADC2  )

