fxy21638/yunzongyanji/library/core/stc32g144k246_def.h
#define DMA_P2PA_SetUART1Send()         P2PDMA_SetDestination(1, P2P_DEST_UR1TX )
#define DMA_P2PA_SetUART2Send()         P2PDMA_SetDestination(1, P2P_DEST_UR2TX )
#define DMA_P2PA_SetUART3Send()         P2PDMA_SetDestination(1, P2P_DEST_UR3TX )
#define DMA_P2PA_SetUART4Send()         P2PDMA_SetDestination(1, P2P_DEST_UR4TX )
#define DMA_P2PA_SetSPI1Send()          P2PDMA_SetDestination(1, P2P_DEST_SPI1TX)
#define DMA_P2PA_SetI2C1Send()          P2PDMA_SetDestination(1, P2P_DEST_I2C1TX)
#define DMA_P2PA_SetLCMSend()           P2PDMA_SetDestination(1, P2P_DEST_LCMTX )
#define DMA_P2PA_SetQSPISend()          P2PDMA_SetDestination(1, P2P_DEST_QSPITX)
#define DMA_P2PA_SetI2S1Send()          P2PDMA_SetDestination(1, P2P_DEST_I2S1TX)
#define DMA_P2PA_SetUART5Send()         P2PDMA_SetDestination(1, P2P_DEST_UR5TX )
#define DMA_P2PA_SetUART6Send()         P2PDMA_SetDestination(1, P2P_DEST_UR6TX )
#define DMA_P2PA_SetUART7Send()         P2PDMA_SetDestination(1, P2P_DEST_UR7TX )
#define DMA_P2PA_SetUART8Send()         P2PDMA_SetDestination(1, P2P_DEST_UR8TX )
#define DMA_P2PA_SetSPI2Send()          P2PDMA_SetDestination(1, P2P_DEST_SPI2TX)
#define DMA_P2PA_SetSPI3Send()          P2PDMA_SetDestination(1, P2P_DEST_SPI3TX)
#define DMA_P2PA_SetSPI4Send()          P2PDMA_SetDestination(1, P2P_DEST_SPI4TX)
#define DMA_P2PA_SetI2C2Send()          P2PDMA_SetDestination(1, P2P_DEST_I2C2TX)
#define DMA_P2PA_SetI2S2Send()          P2PDMA_SetDestination(1, P2P_DEST_I2S2TX)
#define DMA_P2PA_SetDAC1Send()          P2PDMA_SetDestination(1, P2P_DEST_DAC1TX)
#define DMA_P2PA_SetDAC2Send()          P2PDMA_SetDestination(1, P2P_DEST_DAC2TX)
#define DMA_P2PA_SetCAN1Send()          P2PDMA_SetDestination(1, P2P_DEST_CAN1TX)
#define DMA_P2PA_SetCAN2Send()          P2PDMA_SetDestination(1, P2P_DEST_CAN2TX)

#define DMA_P2PB_SetUART1Receive()      P2PDMA_SetSource(2, P2P_SRC_UR1RX )
#define DMA_P2PB_SetUART2Receive()      P2PDMA_SetSource(2, P2P_SRC_UR2RX )
#define DMA_P2PB_SetUART3Receive()      P2PDMA_SetSource(2, P2P_SRC_UR3RX )
#define DMA_P2PB_SetUART4Receive()      P2PDMA_SetSource(2, P2P_SRC_UR4RX )
#define DMA_P2PB_SetSPI1Receive()       P2PDMA_SetSource(2, P2P_SRC_SPI1RX)
#define DMA_P2PB_SetI2C1Receive()       P2PDMA_SetSource(2, P2P_SRC_I2C1RX)
#define DMA_P2PB_SetLCMReceive()        P2PDMA_SetSource(2, P2P_SRC_LCMRX )
#define DMA_P2PB_SetQSPIReceive()       P2PDMA_SetSource(2, P2P_SRC_QSPIRX)
#define DMA_P2PB_SetADC1Receive()       P2PDMA_SetSource(2, P2P_SRC_ADC1  )
#define DMA_P2PB_SetI2S1Receive()       P2PDMA_SetSource(2, P2P_SRC_I2S1RX)
#define DMA_P2PB_SetUART5Receive()      P2PDMA_SetSource(2, P2P_SRC_UR5RX )
#define DMA_P2PB_SetUART6Receive()      P2PDMA_SetSource(2, P2P_SRC_UR6RX )
#define DMA_P2PB_SetUART7Receive()      P2PDMA_SetSource(2, P2P_SRC_UR7RX )
#define DMA_P2PB_SetUART8Receive()      P2PDMA_SetSource(2, P2P_SRC_UR8RX )
#define DMA_P2PB_SetSPI2Receive()       P2PDMA_SetSource(2, P2P_SRC_SPI2RX)
#define DMA_P2PB_SetSPI3Receive()       P2PDMA_SetSource(2, P2P_SRC_SPI3RX)
#define DMA_P2PB_SetSPI4Receive()       P2PDMA_SetSource(2, P2P_SRC_SPI4RX)
#define DMA_P2PB_SetI2C2Receive()       P2PDMA_SetSource(2, P2P_SRC_I2C2RX)
#define DMA_P2PB_SetI2S2Receive()       P2PDMA_SetSource(2, P2P_SRC_I2S2RX)
#define DMA_P2PB_SetCAN1Receive()       P2PDMA_SetSource(2, P2P_SRC_CAN1RX)
#define DMA_P2PB_SetCAN2Receive()       P2PDMA_SetSource(2, P2P_SRC_CAN2RX)
#define DMA_P2PB_SetADC2Receive()       P2PDMA_SetSource(2, P2P_SRC_ADC2  )

#define DMA_P2PB_SetUART1Send()         P2PDMA_SetDestination(2, P2P_DEST_UR1TX )
#define DMA_P2PB_SetUART2Send()         P2PDMA_SetDestination(2, P2P_DEST_UR2TX )
#define DMA_P2PB_SetUART3Send()         P2PDMA_SetDestination(2, P2P_DEST_UR3TX )
#define DMA_P2PB_SetUART4Send()         P2PDMA_SetDestination(2, P2P_DEST_UR4TX )
#define DMA_P2PB_SetSPI1Send()          P2PDMA_SetDestination(2, P2P_DEST_SPI1TX)
#define DMA_P2PB_SetI2C1Send()          P2PDMA_SetDestination(2, P2P_DEST_I2C1TX)
#define DMA_P2PB_SetLCMSend()           P2PDMA_SetDestination(2, P2P_DEST_LCMTX )
#define DMA_P2PB_SetQSPISend()          P2PDMA_SetDestination(2, P2P_DEST_QSPITX)
#define DMA_P2PB_SetI2S1Send()          P2PDMA_SetDestination(2, P2P_DEST_I2S1TX)
#define DMA_P2PB_SetUART5Send()         P2PDMA_SetDestination(2, P2P_DEST_UR5TX )
#define DMA_P2PB_SetUART6Send()         P2PDMA_SetDestination(2, P2P_DEST_UR6TX )
#define DMA_P2PB_SetUART7Send()         P2PDMA_SetDestination(2, P2P_DEST_UR7TX )
#define DMA_P2PB_SetUART8Send()         P2PDMA_SetDestination(2, P2P_DEST_UR8TX )
#define DMA_P2PB_SetSPI2Send()          P2PDMA_SetDestination(2, P2P_DEST_SPI2TX)
#define DMA_P2PB_SetSPI3Send()          P2PDMA_SetDestination(2, P2P_DEST_SPI3TX)
#define DMA_P2PB_SetSPI4Send()          P2PDMA_SetDestination(2, P2P_DEST_SPI4TX)
#define DMA_P2PB_SetI2C2Send()          P2PDMA_SetDestination(2, P2P_DEST_I2C2TX)
#define DMA_P2PB_SetI2S2Send()          P2PDMA_SetDestination(2, P2P_DEST_I2S2TX)
#define DMA_P2PB_SetDAC1Send()          P2PDMA_SetDestination(2, P2P_DEST_DAC1TX)
#define DMA_P2PB_SetDAC2Send()          P2PDMA_SetDestination(2, P2P_DEST_DAC2TX)
#define DMA_P2PB_SetCAN1Send()          P2PDMA_SetDestination(2, P2P_DEST_CAN1TX)
#define DMA_P2PB_SetCAN2Send()          P2PDMA_SetDestination(2, P2P_DEST_CAN2TX)

#define DMA_P2PA_Disable()              (DMA_P2P1_DEST = 0, DMA_P2P1_SRC = 0)
#define DMA_P2PB_Disable()              (DMA_P2P2_DEST = 0, DMA_P2P2_SRC = 0)

/////////////////////////////////////////////////

#define CRCCR_RST_MSK                   BIT7
#define CRC_Reset()                     SET_REG_BIT(CRC_CR, CRCCR_RST_MSK)

#define CRCCR_MODE_MSK                  BIT4
#define CRC_ModebusMode()               CLR_REG_BIT(CRC_CR, CRCCR_MODE_MSK)
#define CRC_EthernetMode()              SET_REG_BIT(CRC_CR, CRCCR_MODE_MSK)
#define CRC_IsCRC32()                   READ_REG_BIT(CRC_CR, CRCCR_MODE_MSK)

#define CRCCR_INVOUT_MSK                BIT2
#define CRC_ResultNonInverted()         CLR_REG_BIT(CRC_CR, CRCCR_INVOUT_MSK)
#define CRC_ResultInverted()            SET_REG_BIT(CRC_CR, CRCCR_INVOUT_MSK)

#define CRCCR_REVIN_MSK                 BIT1
#define CRC_DataNonReverse()            CLR_REG_BIT(CRC_CR, CRCCR_REVIN_MSK)
#define CRC_DataReverse()               SET_REG_BIT(CRC_CR, CRCCR_REVIN_MSK)

#define CRCCR_REVOUT_MSK                BIT0
#define CRC_ResultNonReverse()          CLR_REG_BIT(CRC_CR, CRCCR_REVOUT_MSK)
#define CRC_ResultReverse()             SET_REG_BIT(CRC_CR, CRCCR_REVOUT_MSK)

#define CRC_DataIn(n)                   CRC_DIN = LOBYTE(n)

#define CRC_SetInitial16(n)             CRC_DOH = HIBYTE(n);    \
                                        CRC_DOL = LOBYTE(n)

#define CRC_SetInitial32(n)             CRC_DO3 = BYTE0(n);     \
                                        CRC_DO2 = BYTE1(n);     \
                                        CRC_DO1 = BYTE2(n);     \
                                        CRC_DO0 = BYTE3(n)

#define CRC_ReadResult16()              MAKEWORD(CRC_DOL, CRC_DOH)
#define CRC_ReadResult32()              MAKELONG(MAKEWORD(CRC_DO3, CRC_DO2), MAKEWORD(CRC_DO1, CRC_DO0))

/////////////////////////////////////////////////

#endif

